Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: By [binding](glossary://binding) the the model’s `viewfinderImage` property to your `ViewfinderView`, you ensure that the viewfinder updates whenever the view receives a new preview image.
de: Durch die [Bindung](glossary://binding) der Eigenschaft `viewfinderImage` an `ViewfinderView`, stellst du sicher, dass der Sucher mit jedem empfangenen Vorschaubild aktualisiert wird.
es: Al [vincular](glossary://binding) la propiedad `viewfinderImage` del modelo a `ViewfinderView`, te aseguras de que el visor se actualice cada vez que la vista reciba una nueva imagen de previsualización.
es_419: Al [ligar](glossary://binding) la propiedad `viewfinderImage` del modelo a tu visualización `ViewfinderView`, te aseguras de que el visor se actualice cada vez que la visualización reciba una imagen de vista previa nueva.
fr: En [associant](glossary://binding) la propriété `viewfinderImage` du modèle à ta vue `ViewfinderView`, tu t’assures que le viseur se met à jour quand la vue reçoit une nouvelle image d’aperçu.
it: Creando un [vincolo](glossary://binding) tra la proprietà del modello `viewfinderImage` e `ViewfinderView`, fai in modo che il mirino si aggiorni ogni volta che la vista riceve una nuova anteprima dell’immagine.
ja: モデルの`viewfinderImage`（ファインダーイメージ）プロパティを`ViewfinderView`（ファインダービュー）に[バインド](glossary://binding)して、ビューに新しいプレビューイメージが届くたびにファインダーがアップデートされるようにします。
ko: 모델의 `viewfinderImage` 속성을 `ViewfinderView`에 [바인딩](glossary://binding)하면, 보기가 새로운 미리보기 이미지를 받을 때마다 뷰파인더가 업데이트되도록 할 수 있습니다.
nl: Door de `viewfinderImage`-eigenschap van het model aan je `ViewfinderView` te [binden](glossary://binding), zorg je ervoor dat de zoeker telkens wordt bijgewerkt wanneer de weergave een nieuw voorvertoningsbeeld ontvangt.
no: Ved å [binde](glossary://binding) modellens `viewfinderImage`-egenskap til `ViewfinderView` sørger du for at søkeren oppdateres når visningen mottar et nytt forhåndsvisningsbilde.
pt: Ao [vincular](glossary://binding) a propriedade `viewfinderImage` do modelo à visualização `ViewfinderView`, você garante que o visor seja atualizado sempre que a câmera recebe uma nova imagem de pré‑visualização.
sv: Genom att [koppla](glossary://binding) modellens `viewfinderImage`-egenskap till din `ViewfinderView` ser du till att sökaren uppdateras så fort vyn tar emot en ny förhandsvisningsbild.
th: การ[รวม](glossary://binding)คุณสมบัติ `viewfinderImage` ของโมเดลกับ `ViewfinderView` ของคุณช่วยให้คุณแน่ใจว่าช่องมองภาพจะอัปเดตทุกครั้งที่มุมมองได้รับภาพการแสดงตัวอย่างใหม่
tr: Modelin `viewfinderImage` özelliğini `ViewfinderView`’una [bağlayarak](glossary://binding) görüntünün her yeni önizleme görüntüsü alışında vizörün güncellenmesini sağlarsın.
vi: Bằng việc [ràng buộc](glossary://binding) thuộc tính `viewfinderImage` của mô hình với `ViewfinderView`, bạn đảm bảo rằng kính ngắm cập nhật bất kỳ lúc nào chế độ xem nhận được một hình ảnh xem trước mới.
zh_cn: 通过将模型的 `viewfinderImage` 属性[绑定](glossary://binding)到 `ViewfinderView`，可确保视图每次收到新预览图像时，取景器都会更新。
zh_tw: 藉由將模型的 `viewfinderImage` 屬性[綁定](glossary://binding)到你的 `ViewfinderView`，你可以確保每次顯示區接收到新的預覽影像時，都會更新觀景窗。

source: Because the preview image updates many times per second, your eyes see it as live video in the viewfinder.
de: Da das Vorschaubild viele Male pro Sekunde aktualisiert wird, nehmen deine Augen es als Livevideo im Sucher wahr.
es: Dado que la imagen de previsualización se actualiza muchas veces por segundo, tus ojos la ven como un vídeo en directo en el visor.
es_419: Debido a que las imágenes se actualizan muchas veces cada segundo, tú lo ves como video en vivo en el visor.
fr: Comme l’image d’aperçu se met à jour de nombreuses fois par seconde, tes yeux la perçoivent comme une vidéo en direct dans le viseur.
it: Visto che l’anteprima dell’immagine si aggiorna diverse volte al secondo, i nostri occhi la percepiscono come un video dal vivo nel mirino.
ja: プレビューイメージは1秒間に何度もアップデートされるので、ファインダーでライブビデオのように見えます。
ko: 미리보기 이미지가 초당 여러 번 업데이트되기 때문에 뷰파인더에서 우리의 눈이 이것을 라이브 영상으로 인식하게 됩니다.
nl: Omdat het voorvertoningsbeeld zo vaak per seconde wordt bijgewerkt, zien je ogen het als livevideo in de zoeker.
no: Siden forhåndsvisningsbildet oppdateres mange ganger i sekundet, oppfatter øynene dem som en direktestrømmet video i søkeren.
pt: Como a imagem de pré‑visualização é atualizada várias vezes por segundo, seus olhos a veem como um vídeo ao vivo no visor.
sv: Eftersom förhandsvisningsbilden uppdateras många gånger per sekund uppfattar ögonen den som en direktsänd video i sökaren.
th: เนื่องจากภาพการแสดงตัวอย่างอัปเดตหลายครั้งต่อวินาที ตาของคุณจึงมองเห็นภาพเป็นวิดีโอสดในช่องมองภาพ
tr: Önizleme görüntüsü saniyede pek çok kez güncellendiğinden gözlerin onu vizörde canlı video olarak görür.
vi: Vì hình ảnh xem trước cập nhật nhiều lần mỗi giây nên mắt của bạn nhìn thấy hình ảnh giống như video trực tiếp trong kính ngắm.
zh_cn: 由于预览图像每秒更新很多次，你在取景器中看到的就像实时视频一样。
zh_tw: 因為預覽影像每秒更新許多次，以至於你的眼睛會在觀景窗中將其視為即時影片。

source: Rotate or Blur the Viewfinder
de: Den Sucher drehen oder weichzeichnen
es: Girar o difuminar el visor
es_419: Gira o difumina el visor
fr: Faire pivoter ou flouter le viseur
it: Ruotare o sfocare il mirino
ja: ファインダーを回転する/ぼかす
ko: 뷰파인더를 회전하거나 흐리게 처리하기
nl: De zoeker roteren of vervagen
no: Roter eller gjør søkeren uskarp
pt: Gire ou Desfoque o Visor
sv: Rotera eller gör sökaren oskarp
th: หมุนหรือเบลอช่องมองภาพ
tr: Vizörü Döndürme veya Bulanıklaştırma
vi: Xoay hoặc làm mờ kính ngắm
zh_cn: 旋转或模糊化取景器
zh_tw: 旋轉或模糊觀景窗

source: Experiment by rotating or blurring the images in the preview stream.
de: Experimentiere, indem du die Bilder im Vorschau-Stream drehst oder weichzeichnest.
es: Experimenta girando o desenfocando las imágenes en la secuencia de vista previa.
es_419: Experimenta al girar o difuminar las imágenes en el flujo de vista previa.
fr: Fais des expériences en faisant pivoter ou en floutant les images dans le flux d’aperçu.
it: Fai qualche esperimento: prova a ruotare o a sfocare le immagini nel flusso di anteprime.
ja: プレビューストリームのイメージを回転したりぼかしたりしてみましょう。
ko: 미리보기 스트림에서 이미지를 회전하거나 흐리게 처리해 보세요.
nl: Experimenteer door de afbeeldingen in de voorvertoningsstroom te roteren of te vervagen.
no: Eksperimenter ved å rotere bildene eller gjøre dem uskarpe i forhåndsvisningsstrømmen.
pt: Experimente girar ou desfocar as imagens no fluxo de pré‑visualização.
sv: Experimentera genom att rotera eller göra bilderna i förhandsvisningsströmmen oskarpa.
th: ทดลองใช้โดยหมุนหรือเบลอภาพในสตรีมการแสดงตัวอย่าง
tr: Önizleme yayınındaki görüntüleri döndürerek veya bulanıklaştırarak denemeler yap.
vi: Thử nghiệm bằng cách xoay hoặc làm mờ hình ảnh trong luồng xem trước.
zh_cn: 尝试旋转或模糊化预览流中的图像。
zh_tw: 藉由旋轉或模糊預覽串流中的影像來進行實驗。

source: Your `handleCameraPreviews` method maps the camera’s preview [stream](glossary://asynchronous%20stream) of [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) instances to a stream of [Image](doc://com.apple.documentation/documentation/swiftui/image) views, ready for display in your `ViewfinderView`.
de: Die Methode `handleCameraPreviews` (Kameravorschau verarbeiten) ordnet den Vorschau-[Stream](glossary://asynchronous%20stream) der Kamera aus [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-Instanzen einem Stream aus [Bild](doc://com.apple.documentation/documentation/swiftui/image)-Ansichten zu, die in `ViewfinderView` (Sucheransicht) angezeigt werden können.
es: El método `handleCameraPreviews` asigna la [secuencia](glossary://asynchronous%20stream) de vista previa de la cámara de las instancias de [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) a una secuencia de vistas de [imagen](doc://com.apple.documentation/documentation/swiftui/image), listas para su visualización en `ViewfinderView`.
es_419: Tu método `"handleCameraPreviews"` asigna el [flujo](glossary://asynchronous%20stream) de instancias [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) de la vista previa al flujo de visualizaciones [Image](doc://com.apple.documentation/documentation/swiftui/image) de la cámara, y permite que se muestren en tu visualización `"ViewfinderView"`.
fr: Ta méthode `handleCameraPreviews` cartographie le [flux](glossary://asynchronous%20stream) des instances [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) de l’aperçu de l’appareil photo dans un flux de vues [Image](doc://com.apple.documentation/documentation/swiftui/image), pour un affichage direct dans `ViewfinderView`.
it: Il metodo `handleCameraPreviews` mappa il [flusso](glossary://asynchronous%20stream) di anteprime della fotocamera delle istanze [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) in un flusso di viste [Image](doc://com.apple.documentation/documentation/swiftui/image), pronte per essere visualizzate in `ViewfinderView`.
ja: `handleCameraPreviews`メソッドは、[CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)（コアイメージ）インスタンスのカメラのプレビュー[ストリーム](glossary://asynchronous%20stream)を、`ViewfinderView`（ファインダービュー）に表示できる状態になった[Image](doc://com.apple.documentation/documentation/swiftui/image)（イメージ）ビューのストリームにマッピングします。
ko: `handleCameraPreviews` 메소드는 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 인스턴스의 카메라 미리보기 [스트림](glossary://asynchronous%20stream)을 `ViewfinderView`에 표시할 준비가 된 [Image](doc://com.apple.documentation/documentation/swiftui/image) 보기 스트림에 매핑합니다.
nl: De methode `handleCameraPreviews` koppelt de voorvertonings[stroom](glossary://asynchronous%20stream) met [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-instanties van de camera aan een stroom met [Image](doc://com.apple.documentation/documentation/swiftui/image)-weergaven, klaar om te worden weergegeven in de `ViewfinderView`.
no: `handleCameraPreviews`-metoden kobler kameraets forhåndsvisnings[strøm](glossary://asynchronous%20stream) for [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-instanser til en strøm av [Image](doc://com.apple.documentation/documentation/swiftui/image)-visninger som kan vises i `ViewfinderView`.
pt: O seu método `handleCameraPreviews` mapeia o [fluxo assíncrono](glossary://asynchronous%20stream) de instâncias [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) da pré‑visualização da câmera para um fluxo de visualizações [Image](doc://com.apple.documentation/documentation/swiftui/image), prontas para serem mostradas na visualização `ViewfinderView`.
sv: Metoden `handleCameraPreviews` associerar kamerans förhandsvisnings[ström](glossary://asynchronous%20stream) för instanser av [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) till en ström med [Image](doc://com.apple.documentation/documentation/swiftui/image)-vyer som är klara att visas i `ViewfinderView`.
th: วิธีการ `handleCameraPreviews` จะแมป[สตรีม](glossary://asynchronous%20stream)การแสดงตัวอย่างของกล้องของชื่อแทนประเภท [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) กับสตรีมของมุมมอง [Image](doc://com.apple.documentation/documentation/swiftui/image) ที่พร้อมแล้วสำหรับการแสดงผลใน `ViewfinderView` ของคุณ
tr: `handleCameraPreviews` metodun kameranın [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) örneklerini önizleme [akışını](glossary://asynchronous%20stream) `ViewfinderView`’ında görüntülenmeye hazır olan bir [Resim](doc://com.apple.documentation/documentation/swiftui/image) görüntüleri akışına eşler.
vi: Phương thức `handleCameraPreviews` của bạn ánh xạ [luồng](glossary://asynchronous%20stream) xem trước của camera gồm các thể hiện [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) thành một luồng gồm các chế độ xem [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image), sẵn sàng để hiển thị trong `ViewfinderView` của bạn.
zh_cn: `handleCameraPreviews` 方法会将相机的 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 实例预览[流](glossary://asynchronous%20stream)映射到 [Image](doc://com.apple.documentation/documentation/swiftui/image) 视图流，以准备好在 `ViewfinderView` 中显示。
zh_tw: 你的 `handleCameraPreviews` 方法會將 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 實例的相機預覽[串流](glossary://asynchronous%20stream)對應到 [Image](doc://com.apple.documentation/documentation/swiftui/image) 顯示區的串流，以備在你的 `ViewfinderView` 中顯示。

source: This is a great place to do other useful things to the preview images before mapping them to an [Image](doc://com.apple.documentation/documentation/swiftui/image) view.
de: Dies ist der ideale Ort, um weitere nützliche Dinge mit den Vorschaubildern zu machen, bevor du sie mit einer [Bild](doc://com.apple.documentation/documentation/swiftui/image)ansicht verknüpfst.
es: Este es un gran lugar para hacer otras cosas útiles a las imágenes de previsualización antes de asignarlas a una vista de [imagen](doc://com.apple.documentation/documentation/swiftui/image).
es_419: Este es el lugar ideal para hacer más cosas útiles a las imágenes de vista previa antes de que se asignen a una visualización [Image](doc://com.apple.documentation/documentation/swiftui/image).
fr: C’est l’endroit parfait pour effectuer d’autres modifications utiles aux images de l’aperçu avant de les cartographier dans une vue [Image](doc://com.apple.documentation/documentation/swiftui/image).
it: Qui potrai fare altre cose utili con le immagini di anteprima prima di mapparle su una vista [Image](doc://com.apple.documentation/documentation/swiftui/image).
ja: ここは、[image](doc://com.apple.documentation/documentation/swiftui/image)（イメージ）ビューにマッピングする前にプレビューイメージにほかの有益な処理を施す絶好の場所です。
ko: 여기에서 미리보기 이미지를 [Image](doc://com.apple.documentation/documentation/swiftui/image) 보기에 매핑하기 전에 미리보기 이미지로 다른 유용한 작업을 수행할 수 있습니다.
nl: Dit is een goede plek om andere nuttige dingen met de voorvertoningsbeelden te doen voordat je ze aan een [Image](doc://com.apple.documentation/documentation/swiftui/image)-weergave koppelt.
no: Dette er et supert sted å gjøre andre nyttige ting med forhåndsvisningsbildene før de kobles til en [Image](doc://com.apple.documentation/documentation/swiftui/image)-visning.
pt: Este é um bom lugar para fazer outras coisas úteis nas imagens de pré‑visualização antes que você as mapeie em uma visualização [Image](doc://com.apple.documentation/documentation/swiftui/image).
sv: Det här är ett bra ställe att göra andra användbara saker med förhandsvisningsbilderna innan du associerar dem till en [Image](doc://com.apple.documentation/documentation/swiftui/image)-vy.
th: นี่เป็นที่ที่ยอดเยี่ยมในการทำสิ่งอื่นๆ ที่เป็นประโยชน์สำหรับภาพการแสดงตัวอย่างก่อนที่จะแมปภาพเหล่านั้นกับมุมมอง [Image](doc://com.apple.documentation/documentation/swiftui/image)
tr: Bu, önizleme görüntülerini bir [Resim](doc://com.apple.documentation/documentation/swiftui/image) görüntüsüne eşlemeden önce bunlara başka yararlı şeyler yapmak için harika bir yerdir.
vi: Đây là nơi tuyệt vời để thực hiện những việc hữu ích khác cho các hình ảnh xem trước, trước khi ánh xạ chúng thành một chế độ xem [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image).
zh_cn: 这个位置非常适合对预览图像进行其他有用的处理，然后再将它们映射到 [Image](doc://com.apple.documentation/documentation/swiftui/image) 视图。
zh_tw: 在你將預覽影像對應到 [Image](doc://com.apple.documentation/documentation/swiftui/image) 顯示區之前，這是一個對預覽影像執行其他實用操作的好位置。

source: Say you wanted to turn the image sideways, or even upside down, you could call its [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) method.
de: Gehen wir davon aus, dass du das Bild seitwärts oder sogar auf den Kopf drehen möchtest. Dafür könntest du einfach die Methode [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) (Ausrichtung) aufrufen.
es: Supongamos que quieres girar la imagen de lado, o incluso boca abajo; puedes hacerlo llamando a su método [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
es_419: Digamos que quieres girar la imagen a los lados o incluso al revés. Para ello, puedes llamar su método [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
fr: Imaginons que tu veuilles tourner l’image sur le côté, ou même la retourner, tu pourrais alors appeler sa méthode [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
it: Se volessi ruotare l’immagine lateralmente o addirittura capovolgerla, potresti richiamare il metodo [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
ja: 例えば、イメージを横向きに（または上下逆さまに）したい場合は、[oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented)（向き）メソッドを呼び出せます。
ko: 이미지를 옆으로 회전하거나 거꾸로 뒤집고 싶다면 [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) 메소드를 호출하면 됩니다.
nl: Stel dat je de afbeelding wilt kantelen of ondersteboven wilt weergeven. Hiervoor kun je de methode [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) aanroepen.
no: Hvis du vil rotere bildet sideveis eller snu det opp ned, kan du kalle [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented)-metoden.
pt: Digamos que você queira virar a imagem lateralmente ou até mesmo de cabeça para baixo: você pode chamar o método [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
sv: Om du vill vrida bilden åt sidan, eller till och med upp och ned, anropar du dess [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented)-metod.
th: อย่างเช่น คุณต้องการที่จะเปลี่ยนให้ภาพเอียงไปทางด้านข้างหรือแม้แต่คว่ำลง คุณก็สามารถเรียกใช้วิธีการ [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) ได้
tr: Diyelim ki görüntüyü yan ya da baş aşağı çevirmek istiyorsun. Onun [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) metodunu çağırabilirsin.
vi: Giả sử bạn muốn lật hình ảnh sang hai bên hoặc thậm chí là lật ngược, bạn có thể gọi phương thức [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented).
zh_cn: 假如你想要将图像向侧面转动，或者甚至上下颠倒，可以调用它的 [oriented(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented)（方向）方法。
zh_tw: 假設你想將影像橫向翻轉，甚至上下翻轉，可以呼叫它的 [orientation(_:)](doc://com.apple.documentation/documentation/coreimage/ciimage/2919727-oriented) 方法。

source: In the definition for `imageStream`, add this line of code above `.map { $0.image }`:
de: Füge zur Definition `imageStream` (Bild-Stream) die folgende Codezeile über `.map { $0.image }` (Bild zuordnen) hinzu:
es: En la definición para `imageStream`, añade esta línea de código encima de `.map { $0.image }`:
es_419: En la definición de `imageStream`, agrega esta línea de código arriba de `.map { $0.image }`:
fr: Dans la définition de `imageStream`, ajoute cette ligne de code au-dessus de `.map { $0.image }` :
it: Nella definizione di `imageStream`, aggiungi questa riga di codice sopra a `.map { $0.image }`:
ja: `imageStream`（イメージストリーム）の定義で、このコード行を`.map { $0.image }`の上に追加します:
ko: `imageStream`의 정의에서 `.map { $0.image }` 위에 다음 코드 줄을 추가합니다.
nl: In de definitie voor `imageStream` voeg je deze regel code toe boven `.map { $0.image }`:
no: Legg til denne kodelinjen over `.map { $0.image }` i definisjonen for `imageStream`:
pt: Na definição de `imageStream`, adicione esta linha de código acima `.map { $0.image }`:
sv: Lägg till den här kodraden ovanför `.map { $0.image }` i definitionen för `imageStream`:
th: ในคำจำกัดความของ `imageStream` ให้เพิ่มโค้ดบรรทัดนี้เหนือ `.map { $0.image }`:
tr: `imageStream` tanımında, bu kod satırını `.map { $0.image }` öğesinin üstüne ekle:
vi: Trong định nghĩa cho `imageStream`, hãy thêm dòng mã này phía trên `.map { $0.image }`:
zh_cn: 在 `imageStream` 定义中，将这行代码添加到 `.map { $0.image }` 上方：
zh_tw: 在 `imageStream` 的定義中，於 `.map { $0.image }` 上方加入這行程式碼：

source: Here, you’re using `map` to turn a stream of images into a stream of rotated images by calling the function `oriented(.left)` for each element (`$0`) in the stream.
de: Hier verwendest du `map` (zuordnen), um einen Stream aus Bildern in einen Stream aus gedrehten Bildern zu verwandeln. Dafür rufst du die Funktion `oriented(.left)` (Ausrichtung links) für jedes Element (`$0`) im Stream auf.
es: Aquí estás usando `map` para convertir una secuencia de imágenes en una secuencia de imágenes giradas llamando a la función `oriented(.left)` para cada elemento (`$0`) de la secuencia.
es_419: Aquí se usa `map` para convertir un flujo de imágenes en un flujo de imágenes giradas mediante la llamada a la función `oriented(.left)` para cada elemento (`$0`) del flujo.
fr: Ici, tu utilises `map` pour transformer un flux d’images en flux d’images pivotées, en appelant la fonction `oriented(.left)` pour chaque élément (`$0`) dans le flux.
it: In questo caso, stai usando `map` per trasformare un flusso di immagini ordinarie in un flusso di immagini ruotate, richiamando la funzione `oriented(.left)` per ciascun elemento (`$0`) presente nel flusso.
ja: ここでは、`map`を使って、ストリーム内の要素（`$0`）ごとに関数`oriented(.left)`を呼び出すことによって、イメージのストリームを回転後のイメージのストリームに変換します。
ko: 여기에서는 `map`을 사용하여 이미지 스트림을 회전된 이미지 스트림으로 변환합니다. 이렇게 하려면 스트림의 각 요소(`$0`)에 대해 `oriented(.left)` 함수를 호출합니다.
nl: Hier gebruik je `map` om een stream met afbeeldingen in een stream met geroteerde afbeeldingen om te zetten door de functie `oriented(.left)` aan te roepen voor elk element (`$0`) in de stream.
no: Her bruker du `map` til å gjøre en strøm med bilder om til en strøm med roterte bilder ved å kalle funksjonen `oriented(.left)` for hvert element (`$0`) i strømmen.
pt: Aqui, você está usando `map` para transformar um fluxo de imagens em um fluxo de imagens giradas ao chamar a função `oriented(.left)` para cada elemento (`$0`) no fluxo.
sv: Här använder du `map` till att förvandla en bildström till en ström med roterade bilder genom att anropa funktionen `oriented(.left)` för varenda element (`$0`) i strömmen.
th: ในขั้นตอนนี้ คุณจะใช้ `map` เพื่อเปลี่ยนสตรีมของภาพเป็นสตรีมของภาพที่หมุนโดยเรียกใช้ฟังก์ชั่น `oriented(.left)` สำหรับแต่ละองค์ประกอบ (`$0`) ในสตรีม
tr: Burada, akıştaki her bir öğe (`$0`) için `oriented(.left)` fonksiyonunu çağırarak görüntü akışını döndürülen görüntü akışına dönüştürmek üzere `map`’i kullanıyorsun.
vi: Tại đây, bạn đang sử dụng `map` để biến một luồng hình ảnh thành một luồng hình ảnh được xoay bằng cách gọi hàm `oriented(.left)` cho từng phần tử (`$0`) trong luồng.
zh_cn: 在这里，你正在使用 `map`，并通过为图像流中的每个元素 (`$0`) 调用函数 `oriented(.left)`，来将图像流变为旋转后的图像流。
zh_tw: 在這裡，你使用 `map` 將影像流轉換為旋轉影像串流，方法是為串流中的每個元件 (`$0`) 呼叫函數 `orient(.left)`。

source: Or perhaps you’d like to blur the preview images a little?
de: Oder vielleicht möchtest du die Vorschaubilder ein bisschen weichzeichnen?
es: ¿O tal vez te gustaría difuminar un poco las imágenes de previsualización?
es_419: ¿O quizá te gustaría difuminar las vistas previas un poco?
fr: Sinon, tu veux peut-être flouter un peu les images de l’aperçu ?
it: O forse ti piacerebbe sfocare un po’ le immagini dell’anteprima?
ja: または、プレビューイメージをほんの少しぼかしたいですか?
ko: 아니면 미리보기 이미지를 약간 흐리게 하고 싶으신가요?
nl: Of misschien wil je de voorvertoningsbeelden een beetje vervagen?
no: Eller kanskje du vil gjøre forhåndsvisningsbildene litt uskarpe?
pt: Ou talvez você queira desfocar um pouco as imagens da pré‑visualização?
sv: Eller du kanske vill göra förhandsvisningsbilderna en aning oskarpa?
th: หรือบางทีคุณต้องการที่จะเบลอภาพการแสดงตัวอย่างสักเล็กน้อยใช่ไหม
tr: Belki de önizleme görüntülerini biraz bulanıklaştırmak istersin?
vi: Hoặc có lẽ bạn muốn làm mờ hình ảnh xem trước một chút?
zh_cn: 或者你可能想要将预览图像变得模糊一点？
zh_tw: 或者你想要讓預覽影像稍微模糊一些？
