Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Learn about the photo collection in your data model and how it provides the photos for your gallery.
de: Erfahre mehr über die Fotosammlung in deinem Datenmodell und wie sie die Fotos für die Galerie bereitstellt.
es: Aprende sobre la colección de fotos en tu modelo de datos y cómo proporciona las fotos para tu galería.
es_419: Obtén información sobre la colección de fotos en tu modelo de datos, y cómo proporciona las fotos para tu galería.
fr: Obtiens des informations sur la collection de photos dans ton modèle de données et la façon dont elle fournit les photos pour ta galerie.
it: Scopri ulteriori informazioni sulla raccolta di foto nel tuo modello di dati e come quest’ultimo fornisce foto per la galleria.
ja: データモデルのフォトコレクションの概要と、ギャラリーに写真を表示する仕組みを学びましょう。
ko: 데이터 모델의 사진 모음에 관해 알아보고, 사진 모음이 갤러리에 사진을 제공하는 방법을 배워보세요.
nl: Lees meer over de fotoverzameling in je gegevensmodel en hoe de foto's voor je galerie worden aangeleverd.
no: Lær om bildesamlingen i datamodellen din og hvordan den leverer bildene til galleriet.
pt: Aprenda sobre a coleção de fotos no seu modelo de dados e como ele fornece as fotos à galeria.
sv: Lär dig om bildsamlingen i datamodellen och hur den tillhandahåller bilderna för galleriet.
th: เรียนรู้เกี่ยวกับคอลเลกชั่นรูปภาพในโมเดลข้อมูลของคุณและวิธีที่คอลเลกชั่นให้รูปภาพสำหรับแกลเลอรี่ของคุณ
tr: Veri modelindeki fotoğraf koleksiyonu ve galerin için nasıl fotoğraf sağlayacağı hakkında bilgi edin.
vi: Tìm hiểu về bộ sưu tập ảnh trong mô hình dữ liệu của bạn và cách bộ sưu tập đó cung cấp ảnh cho phòng trưng bày của bạn.
zh_cn: 了解数据模型中的照片集，以及它如何为画廊提供照片。
zh_tw: 瞭解資料模型中的照片集，以及它如何為你的圖庫提供照片。

source: Your data model has a `photoCollection` property that can represent any collection of items in your photo library. This could be your entire photo library, or just one album, or even the results from a search.
de: Das Datenmodell besitzt die Eigenschaft `photoCollection` (Fotosammlung), die jede Sammlung von Objekten in deiner Fotomediathek repräsentieren kann. Das könnte deine gesamte Fotomediathek sein, nur ein Album oder nur die Treffer einer Suche.
es: Tu modelo de datos tiene una propiedad `photoCollection` que puede representar cualquier colección de ítems de tu fototeca. Puede ser toda tu fototeca, solo un álbum, o incluso los resultados de una búsqueda.
es_419: Tu modelo de datos tiene una propiedad `photoCollection` que puede representar cualquier colección de elementos en tu fototeca; esta puede ser tu fototeca entera, sólo un álbum, o incluso los resultados de una búsqueda.
fr: Ton modèle de données possède une propriété `photoCollection` qui peut représenter n’importe quel ensemble d’éléments dans ta photothèque. Il peut s’agir de l’ensemble de ta photothèque, un seul album ou même le résultat d’une recherche.
it: Il tuo modello di dati dispone di una proprietà `photoCollection` che rappresenta tutte le raccolte di elementi presenti nella tua libreria fotografica. Potrebbe corrispondere alla tua intera libreria oppure solo a un album o perfino ai risultati di una ricerca.
ja: データモデルには、フォトライブラリ内の項目のコレクションを表示できる`photoCollection`（フォトコレクション）プロパティがあります。フォトライブラリ全体を表示することも、1つのアルバムだけを表示することもできます。検索からの結果も表示できます。
ko: 데이터 모델에는 `photoCollection` 속성이 있어 사진 보관함에 있는 항목의 모음을 모두 나타낼 수 있습니다. 예를 들면, 사진 보관함 전체나 하나의 앨범, 심지어 검색 결과도 가능합니다.
nl: Je gegevensmodel heeft een `photoCollection`-eigenschap die elke verzameling van onderdelen uit je fotobibliotheek kan representeren. Dit kan je hele fotobibliotheek, alleen een album of het resultaat van een zoekopdracht zijn.
no: Datamodellen har en `photoCollection`-egenskap som kan representere enhver samling av objekter i bildebiblioteket. Det kan være hele bildebiblioteket, bare ett album eller til og med resultatene fra et søk.
pt: O modelo de dados tem uma propriedade `photoCollection` que pode representar qualquer coleção de itens na sua fototeca. Poderia ser toda a fototeca, apenas um álbum ou até mesmo os resultados de uma busca.
sv: Datamodellen har en `photoCollection`-egenskap som kan representera vilken samling som helst av objekt i bildbiblioteket. Det kan vara hela bildbiblioteket, bara ett album eller till och med träffarna från en sökning.
th: โมเดลข้อมูลของคุณมีคุณสมบัติ `photoCollection` ที่สามารถแสดงถึงคอลเลกชั่นของรายการต่างๆ ในคลังรูปภาพของคุณได้ โดยอาจเป็นคลังรูปภาพทั้งคลังของคุณ หรือเพียงอัลบั้มเดียว หรือแม้กระทั่งผลลัพธ์จากการค้นหา
tr: Veri modelinde, fotoğraf arşivindeki herhangi bir öğe koleksiyonunu temsil edebilecek bir `photoCollection` özelliği vardır. Bu tüm fotoğraf arşivin, yalnızca bir albüm ya da hatta bir aramanın sonuçları da olabilir.
vi: Mô hình dữ liệu của bạn có một thuộc tính `photoCollection` có thể biểu thị bất kỳ bộ sưu tập mục nào trong thư viện ảnh của bạn. Đây có thể là toàn bộ thư viện ảnh của bạn hay chỉ một album hoặc thậm chí là các kết quả từ một tìm kiếm.
zh_cn: 数据模型有一个 `photoCollection` 属性，可以代表照片图库中任何项目的集合。它可以是整个照片图库，或者只是一个相簿，甚至是一次搜索的结果。
zh_tw: 你的資料模型有一個 `photoCollection` 屬性，可以代表照片資料庫中任何項目的集合。這可能是你的整個照片資料庫，或者只是一本相簿，或甚至是搜尋的結果。

source: You can include all of your photos in your library by initializing `photoCollection` with a Smart Album `.smartAlbumUserLibrary`.
de: Du kannst alle Fotos deiner Mediathek einbeziehen, indem du `photoCollection` mit dem intelligenten Album `.smartAlbumUserLibrary` initialisierst.
es: Puedes incluir todas tus fotos en tu biblioteca inicializando `photoCollection` con un álbum inteligente `.smartAlbumUserLibrary`.
es_419: Puedes incluir todas tus fotos en tu fototeca; sólo tienes que inicializar `photoCollection` con un álbum inteligente, `.smartAlbumUserLibrary`.
fr: Tu peux ajouter toutes tes photos dans ta bibliothèque en initialisant `photoCollection` avec un Album intelligent `.SmartAlbumUserLibrary`.
it: Puoi includere tutte le foto presenti nella tua libreria inizializzando `photoCollection` con un album smart `.smartAlbumUserLibrary`.
ja: スマートアルバム`.smartAlbumUserLibrary`（スマートアルバムのユーザライブラリ）を使って`photoCollection`（フォトコレクション）を初期化することで、ライブラリ内のすべての写真を含めることができます。
ko: 스마트 앨범 `.smartAlbumUserLibrary`로 `photoCollection`을 초기화하여 보관함에 있는 사진을 모두 포함할 수 있습니다.
nl: Je kunt al je foto's aan je bibliotheek toevoegen door `photoCollection` te initialiseren met een slim album `.smartAlbumUserLibrary`.
no: Du kan inkludere alle bildene i biblioteket ved å initiere `photoCollection` med et smart album: `.smartAlbumUserLibrary`.
pt: Você pode incluir todas as fotos da fototeca ao inicializar `photoCollection` com um Álbum Inteligente `.smartAlbumUserLibrary`.
sv: Du kan inkludera alla bilderna i biblioteket genom att initiera `photoCollection` med ett smart album: `.smartAlbumUserLibrary`.
th: คุณสามารถรวมรูปภาพทั้งหมดของคุณไว้ในคลังได้โดยสร้างค่าเริ่มต้นของ `photoCollection` ด้วยอัลบั้มอัจฉริยะ `.smartAlbumUserLibrary`
tr: `photoCollection`’a bir `.smartAlbumUserLibrary` akıllı albümü ile ilk değer atayarak arşivindeki tüm fotoğrafları dahil edebilirsin.
vi: Bạn có thể bao gồm tất cả các ảnh trong thư viện của mình bằng cách khởi tạo `photoCollection` với một Album thông minh `.smartAlbumUserLibrary`.
zh_cn: 你可以使用智能相簿 `.smartAlbumUserLibrary`（智能相簿用户图库）初始化 `photoCollection`，来包括图库中的所有照片。
zh_tw: 你可以透過使用智慧型相簿 `.smartAlbumUserLibrary` 初始化 `photoCollection` 來包含資料庫中的所有照片。

source: Note that before accessing the photo library in your own project, you must add the Photo Library capability.
de: Du musst zuerst die Möglichkeit zum Verwenden der Fotomediathek hinzufügen, bevor du auf die Fotomediathek in deinem Projekt zugreifen kannst.
es: Ten en cuenta que antes de acceder a la fototeca en tu propio proyecto, debes añadir la funcionalidad de la app Cámara.
es_419: Toma en cuenta que antes de que puedas acceder a la fototeca en tu propio proyecto, debe agregar la funcionalidad de fototeca.
fr: Tu remarqueras quʼavant de pouvoir accéder à la photothèque de ton propre projet, tu dois ajouter la fonctionnalité Photothèque.
it: Tieni presente che per poter accedere alla tua libreria fotografica nel tuo progetto, devi prima aggiungere la funzionalità "Libreria di foto".
ja: 自分だけのプロジェクトで写真ライブラリにアクセスするには、“写真ライブラリ”機能を追加する必要があります。
ko: 나만의 프로젝트에서 사진 보관함에 접근하려면 먼저 사진 보관함 기능을 추가해야 합니다.
nl: Houd er rekening mee dat je de functionaliteit 'Fotobibliotheek' moet toevoegen voordat je de fotobibliotheek in je eigen project kunt gebruiken.
no: Du må legge til bildebibliotekegenskapen før du får tilgang til bildebiblioteket i prosjektet ditt.
pt: Note que antes de acessar a fototeca em um projeto, você deve adicionar a capacidade de Fototeca.
sv: Observera att du inte har tillgång till bildbiblioteket i ditt eget projekt förrän du har lagt till bildbiblioteksfunktionen.
th: โปรดทราบว่าก่อนจะเข้าถึงคลังรูปภาพในโปรเจ็กต์ของคุณเอง คุณจะต้องเพิ่มความสามารถคลังรูปภาพ
tr: Kendi projende fotoğraf arşivine erişmeden önce Fotoğraf Arşivi yeteneğini eklemen gerektiğini unutma.
vi: Lưu ý rằng trước khi truy cập thư viện ảnh trong dự án của riêng mình, bạn phải thêm khả năng Thư viện ảnh.
zh_cn: 注意，必须先添加“照片图库”功能，才能在自己的项目中访问照片图库。
zh_tw: 請注意，要在你自己的計畫案中取用照片圖庫前，你必須先加入「照片圖庫」功能。

source: Find out more more in [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
de: Weitere Infos findest du unter [Requesting access to capabilities for your project (Zugriff auf Fähigkeiten für dein Projekt anfordern)](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
es: Encuentra más información en [Solicitar acceso a las funcionalidades de tu proyecto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
es_419: Obtén detalles en [Solicitar acceso a las funcionalidades para un proyecto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
fr: Découvre davantage dʼinformations dans [Demander lʼaccès aux fonctionnalités pour ton projet](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
it: Per ulteriori informazioni, consulta [Richiedere accesso alle funzionalità per il progetto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
ja: 詳しくは、[Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)（英語）を確認してください。
ko: [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)에서 더 자세한 내용을 알아보세요.
nl: In [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) kun je meer informatie hierover vinden.
no: Du finner mer informasjon i [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
pt: Saiba mais em [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
sv: Du kan läsa mer i [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
th: ค้นหาเพิ่มเติมใน[การขอสิทธิ์เข้าถึงความสามารถต่างๆ สำหรับโปรเจ็กต์ของคุณ](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)
tr: [Projen için yeteneklere erişim isteme](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) bölümünde daha fazla bilgi edinebilirsin.
vi: Tìm hiểu thêm trong [Yêu cầu quyền truy cập vào các khả năng cho dự án của bạn](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
zh_cn: 在[为项目请求访问功能](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)中进一步了解更多。
zh_tw: 請在 [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) 中瞭解更多資訊。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..TaskphotoAssets..title
source: Fetching the Photo Assets
de: Fotodateien abrufen
es: Obtener los activos de fotos
es_419: Obtener los activos fotográficos
fr: Récupérer les ressources photographiques
it: Recuperare le risorse fotografiche
ja: フォト素材を取得する
ko: 사진 항목 가져오기
nl: De fotobestanden ophalen
no: Hente bilderessursene
pt: Obtendo os Recursos de Foto
sv: Hämta bildresurserna
th: การดึงข้อมูลแอสเซทรูปภาพ
tr: Fotoğraf Öğelerini Alma
vi: Tìm nạp tài sản ảnh
zh_cn: 获取照片资源
zh_tw: 取得照片內容

source: Each item in your photo collection is known as a photo [asset](glossary://asset). Find out how to fetch those assets.
de: Jedes Objekt in deiner Fotosammlung wird als Foto-[Asset](glossary://asset) bezeichnet. Jetzt erfährst du, wie du diese Assets abrufst.
es: Cada ítem de tu colección de fotos se conoce como [activo](glossary://asset) de foto. Averigua cómo obtener esos activos.
es_419: A cada elemento en tu colección de fotos se le conoce como un [componente](glossary://asset) fotográfico. Descubre cómo obtener estos componentes.
fr: Chaque élément de ta collection de photos est une [ressource](glossary://asset) photographique. Découvre comment récupérer ces ressources.
it: Ogni elemento della tua raccolta di foto è una [risorsa](glossary://asset) di tipo fotografico. Scopri come recuperarle.
ja: フォトコレクション内のそれぞれの項目をフォト[素材](glossary://asset)といいます。これらの素材を取得する方法を学びましょう。
ko: 사진 모음에 있는 각각의 항목은 사진 [항목](glossary://asset)으로 알려져 있습니다. 해당 항목을 가져오는 방법을 알아보세요.
nl: De onderdelen in je fotoverzameling worden fotobestanden of foto[bronbestanden](glossary://asset) genoemd. Ontdek hoe je deze fotobestanden kunt ophalen.
no: Hvert objekt i bildesamlingen kalles en bilde[ressurs](glossary://asset). Finn ut hvordan du henter disse ressursene.
pt: Cada item na sua coleção de fotos é conhecido como um [material](glossary://asset) de foto. Descubra como obter esses recursos.
sv: Varje objekt i bildsamlingen kallas för en bild[resurs](glossary://asset). Ta reda på hur du hämtar de resurserna.
th: แต่ละรายการในคอลเลกชั่นรูปภาพของคุณจะเรียกว่า[แอสเซท](glossary://asset)รูปภาพ ดูวิธีดึงข้อมูลแอสเซทเหล่านั้น
tr: Fotoğraf koleksiyonundaki her öğe bir fotoğraf [öğesi](glossary://asset) olarak bilinir. Bu öğelerin nasıl alınacağını öğren.
vi: Mỗi mục trong bộ sưu tập ảnh của bạn được gọi là một [tài sản](glossary://asset) ảnh. Tìm hiểu cách tìm nạp những tài sản đó.
zh_cn: 照片集中的每一项称为一个照片[资源](glossary://asset)。探索如何获取这些资源吧。
zh_tw: 照片集中的每個項目都稱為照片[內容](glossary://asset)。瞭解如何取得這些內容。

source: Your data model’s `photoCollection` has a `photoAssets` property that enables use of the photo assets collection just like you would an array.
de: Die `photoCollection` (Fotosammlung) deines Datenmodells verfügt über die Eigenschaft `photoAssets` (Foto-Assets), mit der die Foto-Asset-Sammlung genauso verwendet werden kann wie ein Array.
es: La colección de fotos (`photoCollection`) de tu modelo de datos tiene una propiedad `photoAssets` que permite usar la colección de activos de fotos como si fuera un vector.
es_419: La propiedad `photoCollection` de tu modelo de datos tiene una propiedad `photoAssets` que permite usar la colección de activos fotográficos de la misma manera que un arreglo.
fr: La valeur `photoCollection` de ton modèle de données possède une propriété `photoAssets` qui permet d’utiliser la collection de ressources photographiques comme tu le ferais avec un tableau.
it: `photoCollection` del tuo modello di dati ha una proprietà `photoAssets` che consente di usare la raccolta di risorse fotografiche proprio come faresti con un array.
ja: データモデルの`photoCollection`（フォトコレクション）には、配列のようにフォト素材のコレクションを使用できる`photoAssets`（フォト素材）プロパティがあります。
ko: 데이터 모델의 `photoCollection`에는 `photoAssets` 속성이 있어 배열을 사용할 때와 마찬가지로 사진 항목 모음을 사용할 수 있습니다.
nl: De `photoCollection` van je gegevensmodel heeft een `photoAssets`-eigenschap waarmee je de verzameling met fotobestanden op dezelfde manier kunt gebruiken als een array.
no: Datamodellens `photoCollection` har en `photoAssets`-egenskap som gjør at du kan bruke bilderessurssamlingen på samme måte som en matrise.
pt: A `photoCollection` do modelo de dados tem uma propriedade `photoAssets` que permite usar a coleção de materiais de foto da mesma forma como você usa um vetor.
sv: Datamodellens `photoCollection` har en `photoAssets`-egenskap som gör att du kan använda bildresurssamlingen precis som en array.
th: `photoCollection` ของโมเดลข้อมูลของคุณมีคุณสมบัติ `photoAssets` ที่ช่วยให้สามารถใช้คอลเลกชั่นแอสเซทรูปภาพได้เหมือนกับที่คุณใช้อาร์เรย์
tr: Veri modelinin `photoCollection`’ında tıpkı bir dizide yapacağın gibi fotoğraf öğeleri koleksiyonunun kullanılmasına izin veren bir `photoAssets` özelliği bulunur.
vi: `photoCollection` của mô hình dữ liệu có một thuộc tính `photoAssets` cho phép sử dụng bộ sưu tập tài sản ảnh giống như cách bạn thực hiện với một dãy.
zh_cn: 数据模型的 `photoCollection` 有一个 `photoAssets`（照片资源）属性，可让你像使用数组一样使用照片资源集。
zh_tw: 資料模型的 `photoCollection` 有一個 `photoAssets` 屬性，可讓你像使用陣列一樣使用照片集的內容。

source: For example, you can fetch a photo asset using its index:
de: Du kannst z. B. eine Fotodatei über ihren Index abrufen:
es: Por ejemplo, puedes obtener un activo de foto usando su índice:
es_419: Por ejemplo, puedes obtener un activo fotográfico utilizando su índice:
fr: Par exemple, tu peux récupérer une ressource photographique à l’aide de son index :
it: Ad esempio, puoi recuperare una risorsa fotografica usando il rispettivo indice:
ja: 例えば、インデックスを使って写真を取得することができます:
ko: 예를 들어, 다음과 같이 해당 인덱스를 사용하여 사진 항목을 가져올 수 있습니다.
nl: Je kunt bijvoorbeeld een fotobestand ophalen via de bijbehorende index:
no: Du kan for eksempel hente en bilderessurs ved hjelp av ressursens indeks:
pt: Por exemplo, você pode obter um recurso de foto usando seu respectivo índice:
sv: Du kan till exempel hämta en bildresurs med hjälp av dess index:
th: ตัวอย่างเช่น คุณสามารถดึงข้อมูลแอสเซทรูปภาพได้โดยใช้ดัชนี:
tr: Örneğin, bir fotoğraf öğesini indeksini kullanarak alabilirsin:
vi: Ví dụ như bạn có thể tìm nạp tài sản ảnh bằng cách sử dụng chỉ mục:
zh_cn: 例如，你可以使用照片资源的索引来获取它：
zh_tw: 例如，你可以使用它的索引來取得照片內容：

source: Or count all of the photos in your collection:
de: Oder alle Fotos in deiner Sammlung zählen:
es: O contar todas las fotos de tu colección:
es_419: También puedes contar todas las fotos en tu colección:
fr: Ou compter toutes les photos de ta collection :
it: Oppure, contare tutte le foto nella tua raccolta:
ja: コレクション内のすべての写真の枚数を数えることもできます:
ko: 또는 모음에 있는 모든 사진을 다음과 같이 계산합니다.
nl: Of alle foto's in je verzameling tellen:
no: Eller telle alle bildene i samlingen din:
pt: Ou contar todas as fotos na sua coleção:
sv: Eller räkna alla bilderna i samlingen:
th: หรือนับจำนวนรูปภาพทั้งหมดในคอลเลกชั่นของคุณ:
tr: Koleksiyonundaki tüm fotoğrafları da sayabilirsin:
vi: Hoặc đếm tất cả ảnh trong bộ sưu tập của bạn:
zh_cn: 或者为照片集中的所有照片计数：
zh_tw: 或是計算集合中的所有照片數量：

source: You can also [iterate over](glossary://iteration) the assets in `photoAssets` using a loop. You’ll find this incredibly useful for building your gallery.
de: Du kannst auch mit einer Schleife über die Fotodateien in `photoAssets` [iterieren](glossary://iteration). Das ist für den Aufbau der Galerie unglaublich hilfreich.
es: También puedes [iterar sobre](glossary://iteration) los activos en `photoAssets` usando un bucle. Te resultará increíblemente útil para crear tu galería.
es_419: También puedes usar un ciclo para [iterar](glossary://iteration) por los activos en `"photoAssets"`. Descubrirás que esta es una manera muy útil de crear tu galería.
fr: Tu peux également utiliser une boucle pour [effectuer une itération](glossary://iteration) sur les ressources dans `photoAssets`. Tu trouveras ça très utile quand tu devras créer ta galerie.
it: Puoi anche effettuare un’[iterazione](glossary://iteration) sulle risorse in `photoAssets` utilizzando un ciclo. Questa operazione ti risulterà molto utile per costruire la tua galleria.
ja: ループを使って、`photoAssets`（フォト素材）の素材を[反復処理](glossary://iteration)することもできます。これは、ギャラリーをバインドするときにものすごく便利です。
ko: 또한 루프를 사용해 `photoAssets`의 항목을 [반복](glossary://iteration)할 수 있습니다. 갤러리를 만드는 데에 이 방법이 무척 유용함을 알게 될 것입니다.
nl: Je kunt ook door de bronbestanden in `photoAssets` [itereren](glossary://iteration) met behulp van een lus. Je zult ontdekken dat dit erg handig is voor het bouwen van de galerie.
no: Du kan også [iterere over](glossary://iteration) ressursene i `photoAssets` ved hjelp av en løkke. Dette er veldig nyttig når du lager galleriet ditt.
pt: Você também pode [iterar sobre](glossary://iteration) os recursos em `photoAssets` usando um loop. Você vai achar isso muito útil para construir sua galeria.
sv: Du kan också [iterera över](glossary://iteration) resurserna i `photoAssets` med en loop. Det är otroligt praktiskt när du bygger galleriet.
th: คุณยังสามารถ[ทำซ้ำ](glossary://iteration)แอสเซทใน `photoAssets` โดยใช้ loop ได้อีกด้วย คุณจะพบว่าการทำเช่นนี้มีประโยชน์อย่างเหลือเชื่อในการสร้างแกลเลอรี่ของคุณ
tr: Ayrıca, bir Döngü kullanarak `photoAssets`’teki öğelerin [üzerinden tekrarlayabilirsin](glossary://iteration). Bu, galerini oluşturman için son derece yararlı olacak.
vi: Bạn cũng có thể [lặp lại](glossary://iteration) trên các tài sản trong `photoAssets` bằng một vòng lặp. Bạn sẽ thấy cách này vô cùng hữu ích trong việc xây dựng phòng trưng bày của mình.
zh_cn: 你还可以使用循环[迭代](glossary://iteration) `photoAssets` 中的资源。你会发现这个功能对于构建画廊非常有用。
zh_tw: 你還可以使用迴圈[反覆運算](glossary://iteration) `photoAssets` 中的內容。你會發現這對於建構你的圖庫非常有用。
