Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Your result closure receives one or more calls from the cache. If the cache already contains the image you requested, it immediately calls your closure with the image in its `result`.
de: Der Funktionsabschluss für den Treffer wird vom Cache einmal oder mehrmals aufgerufen. Wenn der Cache bereits das von dir angeforderte Bild enthält, wird der Funktionsabschluss mit dem Bild in `result` umgehend aufgerufen.
es: La clausura de tu resultado recibe una o varias llamadas de la caché. Si la caché ya contiene la imagen que has solicitado, llama inmediatamente a tu clausura con la imagen en su resultado (`result`).
es_419: Tu clausura de resultado recibe una o más llamadas de la caché. Si la caché ya contiene la imagen que solicitaste, llamará inmediatamente a tu clausura con la imagen en su resultado.
fr: La clôture de ton résultat reçoit un ou plusieurs appels du cache. Si celui-ci contient déjà l’image que tu as demandée, il appelle immédiatement ta clôture avec l’image dans son `result`.
it: La tua chiusura viene richiamata una o più volte dalla cache. Se la cache contiene già l’immagine che hai richiesto, tra i suoi `result`, richiamerà immediatamente la chiusura con l’immagine.
ja: result（結果）クロージャは、キャッシュから1件以上の呼び出しを受け取ります。リクエストしたイメージがすでにキャッシュに格納されている場合は、すぐに`result`内のイメージと共にクロージャが呼び出されます。
ko: 결과 클로저는 캐시에서 하나 이상의 호출을 받습니다. 캐시에 이미 사용자가 요청한 이미지가 있으면 캐시는 곧바로 `result`에 이미지가 있는 상태에서 클로저를 호출합니다.
nl: De `result`-closure ontvangt één of meer aanroepen van de cache. Als de cache de aangevraagde foto al bevat, wordt de closure onmiddellijk aangeroepen en bevindt de afbeelding zich in het `result`.
no: Closure-blokken for resultatet mottar ett eller flere kall fra bufferen. Hvis bufferen allerede inneholder bildet du ba om, kaller den umiddelbart closure-blokken med bildet i `result`.
pt: O encerramento do resultado recebe uma ou mais chamadas do cache. Se o cache já contiver a imagem que você solicitou, ele chamará imediatamente o encerramento com a imagem em seu `result`.
sv: Din resultatstängning tar emot ett eller flera anrop från cachen. Om cachen redan innehåller bilden du begärde anropar den omedelbart stängningen med bilden i dess `result`.
th: การปิดผลลัพธ์ของคุณได้รับการเรียกใช้อย่างน้อยหนึ่งครั้งจากแคช ถ้าแคชมีภาพที่คุณร้องขออยู่แล้ว แคชจะเรียกใช้การปิดของคุณในทันทีพร้อมรูปภาพใน `result`
tr: Sonuç kapaman, önbellekten bir veya birden fazla çağrı alır. Önbellek istediğin görüntüyü zaten içeriyorsa sonucundaki (`result`) görüntü ile hemen kapamanı çağırır.
vi: Bao đóng kết quả của bạn nhận được một hoặc nhiều lệnh gọi từ bộ nhớ đệm. Nếu bộ nhớ đệm đã chứa hình ảnh mà bạn yêu cầu thì bộ nhớ đệm gọi ngay lập tức bao đóng của bạn với hình ảnh trong `result`.
zh_cn: 结果闭包会收到来自缓存的一次或多次调用。如果缓存中已经包含你请求的图像，它会立即将图像放入 `result`，并调用闭包。
zh_tw: 你的結果閉包會從快取中接收一或多個呼叫。如果快取已經包含你要求的影像，它會立即呼叫你的閉包以及其 `result` 中包含的影像。

source: If the cache doesn’t have the requested image, then it loads the image from the photo asset and caches it. While loading the image, the cache may first call your closure with a low-resolution image, before finally delivering the high-resolution image in the `result`.
de: Wenn der Cache das angeforderte Bild nicht enthält, wird das Bild von dem Foto-Asset geladen und im Cache gespeichert. Während dieses Ladevorgangs kann es sein, dass der Cache den Funktionsabschluss erst mit einem geringauflösenden Bild aufruft, bevor das hochauflösende Bild an `result` (Ergebnis) übergeben wird.
es: Si la caché no tiene la imagen, entonces carga la imagen desde los activos de fotos y la guarda en la caché. Mientras carga la imagen, la caché puede llamar primero a tu clausura con una imagen de baja resolución, antes de entregar finalmente la imagen de alta resolución en el resultado (`result`).
es_419: Si la caché no tiene la imagen solicitada, entonces la carga desde los activos fotográficos y la pone en caché. Mientras se carga la imagen, la caché podría primero llamar a tu clausura con una imagen de baja resolución antes de entregar la imagen de alta resolución en el resultado (`result`).
fr: Si le cache n’a pas l’image demandée, il charge alors l’image à partir de la ressource photo et la met en cache. Pendant le chargement de lʼimage, il peut d’abord appeler ta clôture avec une image en basse résolution, avant de finalement fournir l’image en haute résolution dans le `result`.
it: Se l’immagine richiesta non è presente, allora la cache inizia a caricare l’immagine dalle risorse fotografiche e la salva. Mentre carica l’immagine, prima di fornire l’immagine ad alta risoluzione finale in `result`, la cache può richiamare la chiusura con un’immagine a bassa risoluzione.
ja: キャッシュにリクエストしたイメージがない場合は、フォト素材からイメージが読み込まれ、キャッシュに入れられます。イメージの読み込み中は、キャッシュで最初に低解像度イメージと共にクロージャが呼び出されてから、最終的に`result`（結果）の高解像度イメージが配信されます。
ko: 캐시에 요청된 이미지가 없으면 캐시는 사진 항목에서 이미지를 로드하고 캐시합니다. 이미지를 로드하는 동안 캐시는 먼저 저해상도 이미지로 클로저를 호출한 다음에 고해상도 이미지를 결과에 최종적으로 전달할 수도 있습니다.
nl: Als de cache de gevraagde afbeelding niet heeft, wordt de afbeelding uit het fotobestand geladen en in de cache bewaard. Tijdens het laden van de afbeelding is het mogelijk dat de cache eerst de closure aanroept met een afbeelding met een lage resolutie, voordat de afbeelding met de hoge resolutie in het `result` wordt afgeleverd.
no: Hvis bufferen ikke har bildet du ber om, later den inn bildet fra bilderessursene og legger det i bufferen. Når bildet lastes inn, kan bufferen først kalle closure-blokken med et lavoppløst bilde, før den leverer det høyoppløste bildet i `result`.
pt: Se o cache não contiver a imagem solicitada, ele carregará a imagem do material de foto e a armazenará no cache. Enquanto carrega a imagem, o cache pode chamar o encerramento com uma imagem em baixa resolução primeiro, antes de finalmente entregar a imagem em alta resolução em `result`.
sv: Om cachen inte har den begärda bilden läser den in bilden från bildresursen och cachar den. Medan den läser in bilden kanske cachen först anropar stängningen med en lågupplöst bild innan den slutligen levererar den högupplösta bilden i `result`.
th: ถ้าแคชไม่มีภาพที่ร้องขอ ก็จะโหลดภาพจากแอสเซทรูปภาพแล้วแคช ขณะที่โหลดภาพ แคชอาจเรียกใช้การปิดของภาพความละเอียดต่ำ ก่อนที่ในท้ายที่สุดจะส่งภาพความละเอียดสูงใน `result`
tr: İstenen görüntü önbellekte yoksa fotoğraf öğesinden yüklenip önbelleğe alınır. Görüntü yüklenirken önbellek önce düşük çözünürlüklü bir görüntüye sahip kapamanı çağırıp ondan sonra yüksek çözünürlüklü görüntüyü sonuç (`result`) olarak sunabilir.
vi: Nếu bộ nhớ đệm không có hình ảnh đã yêu cầu thì bộ nhớ đệm tải hình ảnh từ tài sản ảnh và lưu vào bộ nhớ đệm. Trong khi tải hình ảnh, trước tiên bộ nhớ đệm có thể gọi bao đóng của bạn với một hình ảnh có độ phân giải thấp, trước khi cung cấp hình ảnh có độ phân giải cao cuối cùng trong `result`.
zh_cn: 如果缓存中没有请求的图像，则会从照片资源载入图像并进行缓存。载入图像时，缓存可能会先通过低分辨率图像调用闭包，最后才将高分辨率图像放入 `result` 中发送。
zh_tw: 如果快取沒有要求的影像，那麼它會從照片內容載入影像並進行快取。在載入影像時，快取可能首先使用低解析度影像呼叫你的閉包，最後在 `result` 中提供高解析度影像。

source: Your result closure looks for an image in the result. If it finds one, it updates your `image` property.
de: Der Funktionsabschluss für den Treffer sucht dort nach einem Bild. Wenn ein Bild gefunden wurde, wird die Eigenschaft `image` aktualisiert.
es: La clausura de tu resultado busca una imagen en el resultado. Si encuentra una, actualiza su propiedad `image`.
es_419: Tu clausura de resultado busca una imagen en el resultado. Si la encuentra, actualiza tu propiedad `"image"`.
fr: La clôture de ton résultat recherche une image dans le résultat. Si elle en trouve une, elle met à jour ta propriété `image`.
it: La tua chiusura cerca un’immagine all’interno del risultato. Se non la trova, aggiorna la proprietà `image`.
ja: result（結果）クロージャは、result内でイメージを探します。見つかった場合は、`image`（イメージ）プロパティがアップデートされます。
ko: 결과 클로저는 결과에서 이미지를 찾습니다. 이미지를 찾으면 결과 클로저는 `image` 속성을 업데이트합니다.
nl: De `result`-closure zoekt naar een afbeelding in het resultaat. Als de closure een afbeelding vindt, wordt de eigenschap `image` bijgewerkt.
no: Closure-blokken for resultatet ser etter et bilde i resultatet. Hvis den finner det, oppdaterer den `image`-egenskapen.
pt: O encerramento de resultado procura uma imagem no resultado. Se ele encontrar uma, ele atualizará a sua propriedade `image`.
sv: Resultatstängningen letar efter en bild i resultatet. Om den hittar en uppdaterar den `image`-egenskapen.
th: การปิดผลลัพธ์จะค้นหาภาพในผลลัพธ์ ถ้าพบภาพ ก็จะอัปเดตคุณสมบัติ `image` ของคุณ
tr: Sonuç kapaman, sonuçta bir görüntü arar. Bulursa, `image` özelliğini günceller.
vi: Bao đóng kết quả của bạn tìm kiếm một hình ảnh trong kết quả. Nếu tìm thấy một kết quả thì bao đóng cập nhật thuộc tính `image` của bạn.
zh_cn: 结果闭包会在结果中查找图像。如果找到，它会更新 `image` 属性。
zh_tw: 你的結果閉包會在結果中尋找影像。如果它找到影像，它會更新你的 `image` 屬性。

source: Because you’ve made `image` a state property, SwiftUI updates your view when its value changes.
de: Da du aus `image` eine Statuseigenschaft gemacht hast, aktualisiert SwiftUI die Ansicht, sobald sich ihr Wert ändert.
es: Dado que has hecho de `image` una propiedad de estado, SwiftUI actualiza tu vista cuando su valor cambia.
es_419: Dado que convertiste a `image` en una propiedad de estado, SwiftUI actualiza tu visualización cuando su valor cambia.
fr: Puisque tu as défini `image` comme propriété d’état, SwiftUI met à jour ta vue lorsque sa valeur change.
it: Poiché hai reso `image` una proprietà di stato, SwiftUI aggiorna la tua vista quando il suo valore cambia.
ja: `image`（イメージ）状態プロパティを作成しているため、値が変わるとSwiftUIによってビューがアップデートされます。
ko: `image` 상태 속성을 만들었으므로 SwiftUI는 해당 값이 변경되면 보기를 업데이트합니다.
nl: Omdat je van `image` een statuseigenschap hebt gemaakt, werkt SwiftUI de weergave bij wanneer de waarde van `image` verandert.
no: Siden du gjorde `image` til en statusegenskap, oppdaterer SwiftUI visningen din når verdien endres.
pt: Como você fez de `image` uma propriedade de estado, a SwiftUI atualiza a visualização quando seu valor muda.
sv: Eftersom du gjorde `image` till en statusegenskap uppdaterar SwiftUI vyn när dess värde ändras.
th: เนื่องจากคุณได้ทำให้ `image` เป็นคุณสมบัติสถานะ ดังนั้น SwiftUI จะอัปเดตมุมมองของคุณเมื่อค่าเปลี่ยนแปลง
tr: `image`’ı bir durum özelliği yaptığın için değeri değiştiğinde SwiftUI görüntünü günceller.
vi: Vì bạn đã biến `image` thành một thuộc tính trạng thái nên SwiftUI cập nhật chế độ xem của bạn khi giá trị thay đổi.
zh_cn: 由于你已将 `image` 设为状态属性，SwiftUI 会在它的值更改时更新视图。
zh_tw: 因為你已將 `image` 設定為狀態屬性，所以 SwiftUI 會在它的值改變時更新你的顯示區。

source: If `image` contains a value, you [unwrap](glossary://unwrap) the image and display it in your view.
de: Wenn `image` einen Wert hat, [entpackst](glossary://unwrap) du das Bild und zeigst es in deiner Ansicht an.
es: Si `image` contiene un valor, se [extrae](glossary://unwrap) la imagen y se muestra en tu vista.
es_419: Si `image` contiene un valor, debes [desenvolver](glossary://unwrap) la imagen para mostrarla en tu visualización.
fr: Si `image` contient une valeur, tu [n’enveloppes plus](glossary://unwrap) l’image et tu l’affiches dans ta vue.
it: Se `image` contiene un valore, puoi [rivelare](glossary://unwrap) l’immagine e mostrarla nella vista.
ja: `image`（イメージ）に値が格納されている場合は、そのイメージを[ラップ解除](glossary://unwrap)して、ビューに表示します。
ko: `image`가 값을 포함하면 해당 이미지를 [래핑 해제](glossary://unwrap)하고 보기에 표시합니다.
nl: Als `image` een waarde bevat, kun je de afbeelding [uitpakken](glossary://unwrap) en in de weergave tonen.
no: Hvis `image` inneholder en verdi, kan du [pakke ut](glossary://unwrap) bildet og vise det i visningen din.
pt: Se `image` contiver um valor, você [desempacota](glossary://unwrap) a imagem e a mostra na visualização.
sv: Om `image` innehåller ett värde kan du [packa upp](glossary://unwrap) bilden och visa den i vyn.
th: ถ้า `image` มีค่า ให้คุณ[คลาย](glossary://unwrap)ภาพนั้นแล้วแสดงในมุมมองของคุณ
tr: `image` bir değer içeriyorsa resmi [aç](glossary://unwrap) ve görüntünde göster.
vi: Nếu `image` chứa một giá trị thì bạn nên [mở gói](glossary://unwrap) hình ảnh và hiển thị hình ảnh trong chế độ xem của bạn.
zh_cn: 如果 `image` 包含值，你将对图像进行[解包](glossary://unwrap)，并将它显示在视图中。
zh_tw: 如果 `image` 包含一個值，你會[解開](glossary://unwrap)影像並且在顯示區中展示它。

source: However, if `image` doesn’t have a value, you use a [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) to display a spinner as a [placeholder](glossary://placeholder%20view).
de: Wenn `image` jedoch keinen Wert hat, verwendest du eine [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview)-Instanz, um ein Statusrad als [Platzhalter](glossary://placeholder%20view) anzuzeigen.
es: Sin embargo, si `image` no tiene un valor, usa una vista de progreso [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) para mostrar un icono giratorio a modo de [marcador de posición](glossary://placeholder%20view).
es_419: Sin embargo, si `image` no tiene un valor, puedes usar una visualización de progreso ([ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview)) para mostrar un ícono giratorio como su [marcador de posición](glossary://placeholder%20view).
fr: Toutefois, si `image` ne possède aucune valeur, tu utilises une [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) pour afficher une roue comme [paramètre fictif](glossary://placeholder%20view).
it: Se invece `image` non presenta nessun valore, puoi usare una vista [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) per mostrare una rotella che ruota su se stessa come [segnaposto](glossary://placeholder%20view).
ja: ただし、`image`（イメージ）に値がない場合は、[ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview)（進行状況ビュー）を使用して、Spinnerを[プレースホルダ](glossary://placeholder%20view)として表示します。
ko: 하지만 `image`에 값이 없는 경우 [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview)를 사용하여 바람개비를 [위치 지정자](glossary://placeholder%20view)로 표시할 수 있습니다.
nl: Als `image` echter geen waarde heeft, gebruik je een [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) om een spinner weer te geven als een [plaatsaanduiding](glossary://placeholder%20view).
no: Men hvis `image` ikke har en verdi, bruker du en [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) til å vise et snurrende symbol som [plassholder](glossary://placeholder%20view).
pt: No entanto, se `image` não tiver um valor, você usa uma [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) para mostrar um indicador giratório como [marcador de posição](glossary://placeholder%20view).
sv: Om `image` saknar ett värde använder du däremot en [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) till att visa en snurrande symbol som [platshållare](glossary://placeholder%20view).
th: อย่างไรก็ตาม ถ้า `image` ไม่มีค่า ให้คุณใช้ [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) เพื่อแสดงตัวสปินเนอร์เป็น[ที่พัก](glossary://placeholder%20view)
tr: Ancak `image`’de bir değer yoksa [yer tutucu](glossary://placeholder%20view) olarak dönen daire görüntülemek için bir [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) kullanırsın.
vi: Tuy nhiên, nếu `image` không có giá trị thì bạn sử dụng một [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) để hiển thị một con quay dưới dạng một [trình giữ chỗ](glossary://placeholder%20view).
zh_cn: 但如果 `image` 不包含值，你可以使用 [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview)（进度视图）将旋转图标显示为[占位符](glossary://placeholder%20view)。
zh_tw: 但如果 `image` 沒有值，你可使用 [ProgressView](doc://com.apple.documentation/documentation/swiftui/progressview) 將微調器顯示為 [暫存區](glossary://placeholder%20view）。

source: Look very carefully, and you might just see this spinner when your view first loads, before the cache has a chance to load an image from the photo asset.
de: Sieh genau hin, dann siehst du das Rad vielleicht beim ersten Laden der Ansicht, bis der Cache eine Chance hatte, ein Bild aus der Fotodatei zu laden.
es: Fíjate bien, y puede que veas este icono giratorio cuando tu vista se cargue por primera vez, antes de que la caché tenga la oportunidad de cargar una imagen del activo de foto.
es_419: Fíjate bien, y puede que alcances a ver este ícono giratorio cuando cargues tu visualización por primera vez, antes de que la caché tenga la oportunidad de cargar una imagen del activo fotográfico.
fr: Regarde bien attentivement, et tu verras peut-être cette roue la première fois que ta vue charge, avant que le cache ait une chance de charger une image à partir de la ressource photo.
it: Osserva molto attentamente, poiché potresti vedere questa rotella quando la vista si carica per la prima volta, prima che la cache riesca a caricare un’immagine dalla risorsa fotografica.
ja: よく見てください。この待機カーソルは、ビューが最初に読み込みを行ったとき（まだキャッシュがフォト素材からイメージを読み込んでいないとき）のみ表示されますよね。
ko: 아주 자세히 보세요. 캐시가 사진 항목에서 이미지를 로드하기 전, 보기가 처음 로드될 때 바람개비를 볼 수도 있습니다.
nl: Kijk goed, want het kan zijn dat je deze spinner alleen ziet wanneer de weergave voor het eerst wordt geladen en de cache nog geen afbeelding uit het fotobestand heeft kunnen laden.
no: Hvis du ser godt etter, kan du se dette snurrende symbolet før bufferen rekker å laste inn et bilde fra bilderessursene når visningen lastes inn for første gang.
pt: Observe cuidadosamente e talvez você verá este indicador giratório quando sua visualização for carregada pela primeira vez, antes que o cache tenha tempo de carregar uma imagem a partir do recurso de foto.
sv: Om du tittar noga kanske du ser den här snurrande symbolen när vyn blir inläst första gången innan cachen har hunnit läsa in en bild från bildresursen.
th: ดูด้วยความระมัดระวังเป็นอย่างยิ่ง และคุณอาจเพิ่งเห็นตัวสปินเนอร์นี้เมื่อมุมมองของคุณโหลดในครั้งแรก ก่อนที่แคชจะมีโอกาสโหลดภาพจากแอสเซทรูปภาพ
tr: Çok dikkatli bak, önbelleğin fotoğraf öğesinden görüntüyü yüklemeye fırsatı olmadan, görüntün ilk yüklendiğinde bu dönen daireyi görebilirsin.
vi: Hãy quan sát thật cẩn thận và có thể bạn chỉ nhìn thấy con quay này khi chế độ xem tải lần đầu tiên, trước khi bộ nhớ đệm có cơ hội tải hình ảnh từ tài sản ảnh.
zh_cn: 仔细查看，你可能只会在视图首次载入时看到这个旋转图标，这时缓存还没有机会从照片资源载入图像。
zh_tw: 仔細看，當你的顯示區第一次載入時，在快取有機會從照片內容中載入影像之前，你可能會看到這個微調器。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..TaskfixedGrid..title
source: Use a Fixed Grid
de: Festes Raster verwenden
es: Usar una cuadrícula fija
es_419: Usar una cuadrícula de tamaño fijo
fr: Utiliser une grille fixe
it: Utilizzare una griglia fissa
ja: 固定グリッドを使う
ko: 고정 격자 사용하기
nl: Een vast raster gebruiken
no: Bruk et fast rutenett
pt: Use uma Grade Fixa
sv: Använd ett fast rutnät
th: ใช้ตารางแบบขนาดคงที่
tr: Sabit Kareli Alan Kullanma
vi: Sử dụng lưới cố định
zh_cn: 使用固定网格
zh_tw: 使用固定網格

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..TaskfixedGrid..Paragraph163
source: Experiment with alternative grid styles in your photo gallery.
de: Experimentiere in deiner Fotogalerie mit verschiedenen Rasterstilen.
es: Experimenta con estilos de cuadrícula alternativos en tu galería de fotos.
es_419: Experimenta con otros estilos de cuadrícula en tu galería de fotos.
fr: Expérimente avec d’autres styles de grille dans ta galerie de photos.
it: Prova a sperimentare stili di griglia diversi nella tua galleria di foto.
ja: フォトギャラリーで別のグリッドスタイルを試してみましょう。
ko: 사진 갤러리에 다른 격자 스타일을 실험하세요.
nl: Experimenteer met alternatieve rasterstijlen in je fotogalerie.
no: Eksperimenter med alternative rutenettstiler i bildegalleriet.
pt: Experimente estilos de grade alternativos na sua galeria de fotos.
sv: Experimentera med alternativa rutnätsstilar i bildgalleriet.
th: ทดลองใช้ตารางลักษณะอื่นในแกลเลอรี่รูปภาพของคุณ
tr: Fotoğraf galerindeki alternatif kareli alan stilleriyle deneme yap.
vi: Thử nghiệm với các kiểu lưới thay thế trong phòng trưng bày ảnh của bạn.
zh_cn: 在照片画廊中尝试其他网格样式。
zh_tw: 在你的照片圖庫中體驗替代的網格樣式。

source: Your gallery displays photos in a grid, with each photo in a fixed-size square.
de: Deine Galerie zeigt Fotos in einem Raster an. Jedes Foto befindet sich in einem Quadrat mit fester Größe.
es: Tu galería muestra las fotos en una cuadrícula, y cada foto en un cuadrado de tamaño fijo.
es_419: Tu galería muestra fotos en una cuadrícula, y cada foto ocupa un cuadro de tamaño fijo.
fr: Ta galerie affiche les photos dans une grille, avec chaque photo dans un carré de taille fixe.
it: La tua galleria mostra le foto in una griglia, ciascuna foto a forma di un rettangolo di dimensioni fisse.
ja: ギャラリーでは写真がグリッドに表示され、それぞれの写真は固定サイズの正方形に収まっています。
ko: 갤러리는 사진을 격자로 표시하며 각각의 사진은 고정된 크기의 정사각형으로 나타납니다.
nl: De foto's in de galerie worden in een raster weergegeven waarbij elke foto zich in een vierkant met een vaste grootte bevindt.
no: Galleriet viser bilder i et rutenett der hvert bilde vises som et kvadrat med fast størrelse.
pt: A sua galeria mostra fotos em uma grade, com cada foto em um quadrado de tamanho fixo.
sv: Galleriet visar bilder i ett rutnät där varje bild finns i en kvadrat med fast storlek.
th: แกลเลอรี่ของคุณจะแสดงรูปภาพในรูปแบบตาราง โดยรูปภาพแต่ละรูปอยู่ในสี่เหลี่ยมขนาดคงที่
tr: Galerin, her fotoğrafın sabit büyüklükte bir karede olduğu kareli alandaki fotoğrafları görüntüler.
vi: Phòng trưng bày của bạn hiển thị các ảnh trong một lưới, với mỗi ảnh trong một hình vuông có kích cỡ cố định.
zh_cn: 画廊以网格形式显示照片，每张照片都位于大小固定的方块中。
zh_tw: 你的圖庫會以網格展示照片，每張照片都放在大小固定的方型內。
