Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: You define this arrangement using the `columns` property which returns an array of [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Using a single [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) grid item means that your `LazyVGrid` adapts to the available width, fitting in as many columns as it can.
de: Du definierst diese Anordnung mit der Eigenschaft `columns` (Spalten), die ein Array mit [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) (Rasterobjekt) zurückgibt. Durch die Verwendung eines Rasterobjekts mit [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) erreichst du, dass sich `LazyVGrid` an die verfügbare Breite anpasst und so viele Spalten wie möglich einfügt.
es: Esta disposición se define usando la propiedad `columns` que devuelve un vector de [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Si usas un único elemento de cuadrícula [adaptable(mínimo:máximo:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)), tu `LazyVGrid` se adapta a la anchura disponible, encajando todas las columnas que pueda.
es_419: Para definir este arreglo, usa la propiedad `columns`, la cual devuelve un arreglo de [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Usar un solo elemento de cuadrícula [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) significa que tu cuadrícula `LazyVGrid` se adapta al ancho disponible para ajustar y contener todas las columnas posibles.
fr: Tu définis cet arrangement à l’aide de la propriété `columns`, qui renvoie un tableau de [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Si tu utilises un élément de grille [adaptatif(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)), ta valeur `LazyVGrid` s’adapte à la largeur disponible et inclut autant de colonnes qu’il lui est possible.
it: Puoi definire questa disposizione utilizzando la proprietà `columns` che restituisce un array di [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). L’utilizzo di un singolo elemento griglia [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) significa che la tua `LazyVGrid` si adatta alla larghezza disponibile, inserendo quante più colonne possibili.
ja: この並び方は、[GridItem](doc://com.apple.documentation/documentation/swiftui/griditem)（グリッド項目）の配列を返す`columns`（列）プロパティを使って定義します。1つの[adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:))（可変）グリッド項目を使うと、可能な幅が`LazyVGrid`（ゆるやかな縦方向のグリッド）に適用されるので、できるだけ多くの列を表示することが可能です。
ko: [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) 배열을 반환하는 `columns` 속성을 사용해 이러한 배열을 정의합니다. 단일한 [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) 격자 항목을 사용하면 `LazyVGrid`가 사용 가능한 너비에 맞춰 가능한 한 많은 열을 집어넣는 것입니다.
nl: Je definieert deze rangschikking met de eigenschap `columns` die een array van [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) retourneert. Als je een afzonderlijk [adaptief(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) rasteronderdeel gebruikt, past `LazyVGrid` zich aan de beschikbare breedte aan en worden zoveel mogelijk kolommen ingepast.
no: Du definerer utseendet ved hjelp av `columns`-egenskapen som returnerer en matrise med [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Ved å bruke ett [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:))-rutenettobjekt tilpasses `LazyVGrid` til den tilgjengelige bredden for å gjøre plass til så mange kolonner som mulig.
pt: Defina este arranjo usando a propriedade `columns`, que retorna um vetor de [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Usar um único item de grade [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) significa que o `LazyVGrid` se adapta à largura disponível, ocupando quantas colunas puder.
sv: Du definierar den här ordningen med egenskapen `columns` som returnerar en array med [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Genom att använda ett enda [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:))-rutnätsobjekt anpassas `LazyVGrid` till den tillgängliga bredden och passar in så många kolumner som ryms.
th: คุณกำหนดการจัดเรียงนี้โดยใช้คุณสมบัติ `columns` ซึ่งจะคืนค่าอาร์เรย์ของ [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) การใช้รายการตาราง [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) รายการเดียวหมายความว่า `LazyVGrid` ของคุณจะปรับตามความกว้างที่มีให้พอดีกับจำนวนคอลัมน์มากที่สุด
tr: [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) dizisini döndüren `columns` özelliğini kullanarak bu yerleşimi tanımlarsın. Tek bir [uyarlanabilir(minimum:maksimum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) ızgara öğesi kullanmak, `LazyVGrid`’inin uygun genişliğe uyum sağlayarak olabildiğince çok sayıda sütun sığdıracağı anlamına gelir.
vi: Bạn định nghĩa cách sắp xếp này bằng thuộc tính `columns` trả về một dãy [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem). Sử dụng một lưới [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) đơn nhất nghĩa là `LazyVGrid` của bạn điều chỉnh theo chiều rộng khả dụng, đưa vào số lượng cột nhiều nhất có thể.
zh_cn: 使用 `columns` 属性定义这种排列方式，这个属性会返回一个 [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) 数组。使用单个 [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) 网格项意味着 `LazyVGrid` 会适应可用宽度，并放入尽可能多的列。
zh_tw: 你可以使用 `columns` 屬性來定義此排列，它會傳回 [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) 陣列。使用單一 [adaptive(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/adaptive(minimum:maximum:)) 網格項目表示你的 `LazyVGrid` 能適應可用的寬度，儘可能地容納多個直欄。

source: But say you wanted a fixed number of columns instead, with each photo taking up as much space as possible?
de: Gehen wir aber mal davon aus, dass du stattdessen eine feste Spaltenanzahl möchtest und jedes Foto so viel Platz wie möglich nutzen darf.
es: Pero supongamos que en lugar de eso quieres un número fijo de columnas, en las que cada foto ocupe todo el espacio posible.
es_419: Ahora digamos que quieres un número fijo de columnas y que cada foto ocupe todo el espacio posible.
fr: Mais imaginons que tu veuilles plutôt avoir un nombre de colonnes fixe, avec chaque photo prenant le plus de place possible.
it: E se invece preferissi avere un numero fisso di colonne con ciascuna foto che occupa quanto più spazio possibile?
ja: でも、代わりに列数を固定して、それぞれの写真が可能な限り広い領域に表示されるようにしたいとしたらどうでしょう?
ko: 하지만 그 대신에, 각각의 사진이 가능한 한 많은 공간을 차지하도록 하면서 정해진 개수의 열을 넣는다고 해 봅시다.
nl: Maar stel dat je in plaats daarvan een vast aantal kolommen wilt gebruiken, waarbij elke foto zoveel mogelijk ruimte in beslag neemt.
no: Men hva hvis du vil ha et fast antall kolonner i stedet, der hvert bilde bruker så mye plass som mulig?
pt: Mas, digamos que você queira um número fixo de colunas, onde cada foto ocupe o máximo de espaço possível?
sv: Du kanske istället vill ha ett fast antal kolumner där varje bild tar upp så mycket utrymme som möjligt?
th: แต่สมมติว่าคุณต้องการจำนวนคอลัมน์ที่แน่นอนแทน โดยให้รูปภาพแต่ละรูปใช้พื้นที่มากที่สุดเท่าที่จะเป็นไปได้
tr: Ancak bunun yerine, her fotoğrafın mümkün olabildiğince fazla yer kapladığı, sabit sayıda sütun istediğini varsayalım.
vi: Nhưng giả sử bạn muốn có số lượng cột cố định thay thế, với mỗi ảnh chiếm hữu khoảng không gian nhiều nhất có thể?
zh_cn: 但如果你想要的是固定列数布局，其中每张照片占据尽可能多的空间呢？
zh_tw: 但假設你想要固定數量的直欄，每張照片能夠佔用盡可能多的空間嗎？

source: To do this, your `columns` array should instead contain a [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) grid item for each column that you want.
de: Dafür muss das Array `columns` stattdessen ein [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) Rasterobjekt für jede gewünschte Spalte enthalten.
es: Para ello, tu vector `columns` debe contener un elemento de cuadrícula [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) para cada columna que quieras.
es_419: Entonces, para hacer esto, tu arreglo `columns` debería contener un elemento de cuadrícula [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) para cada columna que quieras.
fr: Pour ce faire, ton tableau `columns` doit plutôt contenir un élément de grille [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) pour chaque colonne que tu veux.
it: Per farlo, il tuo array `columns` dovrebbe contenere un elemento griglia [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) per ciascuna colonna che vuoi ottenere.
ja: そのためには、`columns`（列）配列に、希望するそれぞれの列の[flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:))（柔軟性の高い）グリッド項目を含める必要があります。
ko: 이를 수행하려면 사용자가 원하는 각각의 열에서 `columns` 배열이 [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) 격자 항목을 포함해야 합니다.
nl: Om dit te doen, moet je array `columns` een [flexibel(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) rasteronderdeel voor elke gewenste kolom bevatten.
no: For å gjøre dette må `columns`-matrisen i stedet inneholde et [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:))-rutenettobjekt for hver kolonne du vil ha.
pt: Para conseguir isso, o vetor `columns` precisa conter um item de grade [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) para cada coluna desejada.
sv: För att göra detta ska arrayen `columns` istället innehålla ett [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:))-rutnätsobjekt för varje kolumn som du vill ha.
th: ในการทำเช่นนี้ อาร์เรย์ `columns` ของคุณควรมีรายการตาราง [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) สำหรับแต่ละคอลัมน์ที่คุณต้องการแทน
tr: Bunu yapmak için `columns` dizisinin istediğin her bir sütun için [esnek(minimum:maksimum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) bir ızgara öğesi içermesi gerekir.
vi: Để thực hiện việc này, thay vào đó dãy `columns` của bạn phải chứa một mục lưới [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) cho từng cột mà bạn muốn.
zh_cn: 若要实现，`columns` 数组中想要的每一列应改为包含 [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) 网格项。
zh_tw: 為此，你的 `columns` 陣列應該包含你要的每個直欄的 [flexible(minimum:maximum:)](doc://com.apple.documentation/documentation/swiftui/griditem/size-swift.enum/flexible(minimum:maximum:)) 網格項目。

source: Below `columns`, define a `fixedColumns` property that returns an array of `flexible` grid items, one for each column:
de: Definiere unter `columns` die Eigenschaft `fixedColumns` (feste Spaltenanzahl), die ein Array mit `flexible` Rasterobjekten zurückgibt – eines für jede Spalte:
es: Debajo de `columns` (columnas), define una propiedad `fixedColumns` que devuelva un vector de elementos de cuadrícula `flexible`, uno por cada columna:
es_419: Debajo de `columns`, define una propiedad `fixedColumns` que devuelva un arreglo de elementos de cuadrícula `flexible`, uno para cada columna:
fr: Sous `columns`, définis une propriété `fixedColumns` qui renvoie un tableau d’éléments de grille `flexible`, un pour chaque colonne :
it: Sotto `columns`, definisci una proprietà `fixedColumns` che restituisce un array di elementi griglia `flexible`, uno per ogni colonna:
ja: `columns`（列）の下で、それぞれの列に1つずつ、`flexible`グリッド項目の配列を返す`fixedColumns`（固定列）プロパティを定義します:
ko: `columns` 아래에서 `flexible` 격자 항목을 반환하는 `fixedColumns` 속성을 다음과 같이 정의하세요. 각 열당 하나씩 정의합니다.
nl: Definieer onder `columns` een `fixedColumns`-eigenschap die een array met `flexible`-rasteronderdelen retourneert, één voor elke kolom:
no: Under `columns` definerer du en `fixedColumns`-egenskap som returnerer en matrise av `flexible`-rutenettobjekter, ett for hver kolonne:
pt: Abaixo de `columns`, defina uma propriedade `fixedColumns` que retorne um vetor de itens de grade `flexible`, um para cada coluna:
sv: Nedanför `columns` definierar du en `fixedColumns`-egenskap som returnerar en array med ett `flexible`-rutnätsobjekt för varje kolumn:
th: ด้านล่าง `columns` ให้กำหนดคุณสมบัติ `fixedColumns` ที่คืนค่าอาร์เรย์ของรายการตาราง `flexible` ในรูปแบบหนึ่งรายการต่อหนึ่งคอลัมน์:
tr: `columns`’ın altında, her bir sütun için bir tane olacak şekilde `flexible` kareli alan öğeleri dizisini döndüren bir `fixedColumns` özelliğini tanımla:
vi: Bên dưới `columns`, hãy xác định một thuộc tính `fixedColumns` trả về một dãy gồm các mục lưới `flexible`, một mục cho mỗi cột:
zh_cn: 在 `columns` 下方，定义一个 `fixedColumns`（固定列）属性，让它为每一列返回一个 `flexible` 网格项数组：
zh_tw: 在 `columns` 下方定義一個 `fixedColumns` 屬性，它會傳回一個 `flexible` 網格項目的陣列，每個直欄一個：

source: And, instead of `columns`, pass `fixedColumns` to your lazy grid like this:
de: Übergib `columns` statt `fixedColumns` an dein faules Raster, ungefähr so:
es: Y, en lugar de `columns`, pasa `fixedColumns` (columnas fijas) a tu cuadrícula diferida de esta manera:
es_419: Y, en lugar de `columns`, pasa `fixedColumns` a tu cuadrícula con la propidad `lazy` como se indica a continuación:
fr: Aussi, au lieu de `columns`, transmets `fixedColumns` à ta fainéante de grille, comme ceci :
it: Invece di `columns`, trasmetti `fixedColumns` alla tua `LazyVGrid`, come mostrato di seguito:
ja: また、`columns`（列）の代わりに、このようにしてゆるやかなグリッドに`fixedColumns`（固定列）を渡します:
ko: 그런 다음, 게으른(lazy) 격자에 `columns` 대신`fixedColumns`를 다음과 같이 전달하세요.
nl: En geef in plaats van `columns` de eigenschap `fixedColumns` door aan je `LazyVGrid`. Je doet dit als volgt:
no: I stedet for `columns` overfører du `fixedColumns` til det forsinkede rutenettet på følgende måte:
pt: E, em vez de `columns`, passe `fixedColumns` para a sua grade preguiçosa, assim:
sv: Och istället för `columns` överför du `fixedColumns` till ditt lata rutnät så här:
th: และแทนที่จะส่งผ่าน `columns` ให้ส่งผ่าน `fixedColumns` ไปยังตารางแบบยืดหยุ่นของคุณดังนี้:
tr: `columns` yerine ise, `fixedColumns` öğesini tembel kareli alanına şu şekilde geçir:
vi: Và thay vì là `columns`, hãy chuyển `fixedColumns` vào lưới lazy của bạn giống như thế này:
zh_cn: 将 `fixedColumns`（而非 `columns`）传入惰性网格，就像这样：
zh_tw: 並且不是 `columns`，而是將 `fixedColumns` 傳送給你的惰性網格，像這樣：

source: Now browse to your photo gallery and see what difference this makes, especially when you resize the view.
de: Navigiere jetzt zu deiner Fotogalerie und sieh dir den Unterschied an, insbesondere, wenn du die Größe der Ansicht änderst.
es: Ahora ve a tu galería de fotos y comprueba la diferencia, especialmente cuando cambias el tamaño de la vista.
es_419: Ahora ve a tu galería de fotos y busca la diferencia, especialmente cuando redimensionas la visualización.
fr: Maintenant, accède à ta galerie de photos et vois la différence que cela produit, notamment lorsque tu redimensionnes la vue.
it: Ora prova a sfogliare la galleria fotografica e a notare la differenza, in particolare quando ridimensioni la vista.
ja: では、フォトギャラリーをブラウズして、特にビューのサイズを変更したときに、どんな違いがあるか見てみましょう。
ko: 이제 사진 갤러리를 둘러보세요. 특히 보기의 크기를 조절할 때 어떤 차이가 생기는지 알아보세요.
nl: Ga nu naar je fotogalerie en kijk welk verschil dit maakt, met name als je de grootte van de weergave wijzigt.
no: Bla til bildegalleriet og se hvilken forskjell dette gjør, spesielt når du endrer størrelsen på visningen.
pt: Agora, explore a sua galeria de fotos e veja a diferença que isso faz, especialmente quando você redimensiona a visualização.
sv: Bläddra nu till bildgalleriet och se vilken skillnad det här gör, särskilt när du ändrar storlek på vyn.
th: ในตอนนี้ให้เลือกดูแกลเลอรี่รูปภาพของคุณ แล้วดูว่ามีความแตกต่างกันอย่างไร โดยเฉพาะอย่างยิ่งเมื่อคุณปรับขนาดมุมมอง
tr: Şimdi, fotoğraf galerine göz at ve özellikle görüntünün büyüklüğünü değiştirdiğinde bunun nasıl bir fark yarattığını gör.
vi: Bây giờ, hãy duyệt đến phòng trưng bày ảnh của bạn và xem sự khác biệt mà việc này tạo ra, đặc biệt là khi bạn định cỡ lại chế độ xem.
zh_cn: 现在浏览你的照片画廊，看看这一步带来了什么不同，尤其是在调整视图大小的时候。
zh_tw: 現在瀏覽到你的照片圖庫，看看這會有什麼不同，尤其是在你調整顯示區的大小時。

source: You’ll notice that there are now two columns as you expect, but the photos are still the original size.
de: Es sind nun, wie erwartet, zwei Spalten sichtbar, aber die Fotos haben noch die Originalgröße.
es: Verás que ahora hay dos columnas, como es de esperar, pero las fotos siguen teniendo el tamaño original.
es_419: Verás que, efectivamente, ahora hay dos columnas, pero las fotos aún conservan su tamaño orignal.
fr: Tu remarqueras qu’il existe désormais deux colonnes, comme prévu, mais les photos, elles, sont toujours de leur taille d’origine.
it: Vedrai che adesso ci sono due colonne, come previsto, ma le foto mantengono le dimensioni originali.
ja: 期待通りに2列になりましたね? でも、写真はまだ元のサイズのままです。
ko: 예상대로 이제 두 개의 열이 있는 것을 확인할 수 있지만, 사진은 여전히 실제 크기입니다.
nl: Zoals je zou verwachten, zijn er nu twee kolommen, maar de foto's hebben nog steeds de oorspronkelijke grootte.
no: Nå ser du to kolonner, slik du forventer, men bildene har fortsatt sin opprinnelige størrelse.
pt: Você notará que, conforme o esperado, agora há duas colunas, mas as fotos ainda têm seu tamanho original.
sv: Nu finns det två kolumner, som du förväntar dig, men bilderna har fortfarande sin ursprungliga storlek.
th: คุณจะสังเกตเห็นว่าในตอนนี้มีสองคอลัมน์ตามที่คุณคาดไว้ แต่รูปภาพจะยังคงเป็นขนาดดั้งเดิม
tr: Artık beklediğin gibi iki sütun olduğunu fark edeceksin ama fotoğraflar hâlâ özgün büyüklüklerinde.
vi: Bạn sẽ nhận thấy rằng bây giờ có hai cột như dự kiến, nhưng các ảnh vẫn có kích cỡ nguyên bản.
zh_cn: 你会注意到现在显示的是两列，和你预期的一样，但照片仍然是原始大小。
zh_tw: 你會看到現在有兩個直欄，如你所預期的那樣，但照片還是原來的大小。

source: You’ve one more thing to take care of…
de: Um eine Sache musst du dich noch kümmern …
es: Tienes una cosa más de la que ocuparte…
es_419: Aún falta una cosa más…
fr: Tu dois encore t’occuper d’une dernière chose…
it: C’è ancora una cosa da fare…
ja: やらなければいけないことがもう1つあります…
ko: 신경 쓸 일이 한 가지 더 있답니다…
nl: Er is nog iets dat je moet doen…
no: Du må gjøre én ting til …
pt: Você ainda tem mais uma coisa por fazer…
sv: En sak till att ta hand om…
th: คุณมีอีกสิ่งหนึ่งที่ต้องระมัดระวัง…
tr: Bir şeyle daha ilgilenmen gerekiyor…
vi: Còn một điều mà bạn cần quan tâm…
zh_cn: 还有另一件事需要你处理…
zh_tw: 你還有一件事要處理⋯

source: Look at this line of code in the function that builds your photo item view. Take a moment to think about what the problem might be?
de: Schau dir diese Codezeile in der Funktion an, die das Fotoansichtsobjekt erstellt. Nimm dir kurz Zeit und überlege, was das Problem sein könnte.
es: Fíjate en esta línea de código en la función que genera la vista de tu foto. Piensa un poco en cuál puede ser el problema.
es_419: Revisa esta línea de código en la función que crea tu visualización de activos fotográficos. Tómate un momento para pensar qué podría estar ocasionando el problema.
fr: Dans la fonction, observe cette ligne de code qui crée la vue de ton élément de photo. Prends une minute pour essayer d’identifier le problème.
it: Dai un’occhiata a questa linea di codice nella funzione che costruisce la tua vista degli elementi foto. Prenditi alcuni minuti per pensare a quale potrebbe essere il problema.
ja: 写真項目のビューを作成する、関数内のこのコードを見てください。何が問題なのか、ちょっと考えてみましょう。
ko: 사진 항목 보기를 만드는 함수의 이 코드 라인을 보세요. 잠시 시간을 가지고 어떤 문제가 있을지 생각해 보세요.
nl: Bekijk deze regel code in de functie waarmee de weergave voor de foto-onderdelen wordt gebouwd. Wat denk je dat het probleem zou kunnen zijn?
no: Ta en titt på denne kodelinjen i funksjonen som bygger bildeobjektvisningen. Bruk litt tid på å prøve å finne ut hva som forårsaker problemet.
pt: Veja esta linha de código na função que cria a sua visualização de item de fotos. Reflita por um momento, o poderia estar causando o problema?
sv: Ta en titt på den här kodraden i funktionen som bygger din bildobjektvy. Ägna en stund åt att fundera på vad som kan orsaka problemet.
th: ดูโค้ดบรรทัดนี้ในฟังก์ชั่นที่สร้างมุมมองรายการรูปภาพของคุณ ใช้เวลาสักครู่เพื่อพิจารณาดูว่าปัญหานั้นคืออะไร
tr: Fotoğraf öğesi görüntünü oluşturan fonksiyondaki bu kod satırına bak. Biraz dur ve sorunun ne olabileceğini düşün.
vi: Nhìn vào dòng mã này trong hàm có chức năng xây dựng chế độ xem mục ảnh của bạn. Hãy dành giây lát để suy nghĩ xem vấn đề đó có thể là gì?
zh_cn: 看看构建照片项视图的函数中的这一行代码。思考片刻，问题可能出在哪里？
zh_tw: 在建構照片項目顯示區的函數中看一下這行程式碼。花點時間思考問題可能是什麼？
