Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Tip: Do you sometimes wonder what’s really going on in your code, especially if it isn’t doing what you expect?
de: Tipp: Fragst du dich manchmal, was in deinem Code tatsächlich passiert, insbesondere dann, wenn er nicht das macht, was du von ihm erwartest?
es: Consejo: ¿A veces te preguntas qué ocurre realmente en tu código, sobre todo si no hace lo que esperas?
es_419: Consejo: ¿A veces te preguntas qué pasa en tu código, especialmente cuando no ocurre lo que esperabas?
fr: Astuce : ne te demandes-tu pas, parfois, ce qui se passe vraiment dans ton code, en particulier quand il ne donne pas le résultat prévu ?
it: Suggerimento: ti è mai successo di chiederti che cosa accada davvero all’interno del tuo codice, specialmente quando non si comporta come ti aspetteresti?
ja: ヒント: コード内で実際に何が起こっているのか気になることがありませんか? 期待通りに動いていない場合は、特にそうですよね?
ko: 팁: 때로는 코드가 어떻게 된 것인지 궁금하지 않으신가요? 특히 코드가 예상대로 작동하지 않을 때 말입니다.
nl: Tip: vraag je je soms ook af wat er echt in je code gebeurt, met name als de code niet doet wat je verwacht?
no: Tips: Lurer du av og til på hva som egentlig skjer i koden din, spesielt hvis den ikke gjør det du forventer at den skal gjøre?
pt: Dica: às vezes você se pergunta o que está acontecendo no código, especialmente quando ele não faz o que você esperava?
sv: Tips: Undrar du ibland vad som egentligen händer i koden, särskilt om den inte gör det du förväntar dig?
th: เคล็ดลับ: บางครั้งคุณสงสัยหรือไม่ว่าเกิดอะไรขึ้นกันแน่ในโค้ดของคุณ โดยเฉพาะอย่างยิ่งหากโค้ดนั้นไม่เป็นไปตามที่คุณคาดไว้
tr: İpucu: Bazen kodunda gerçekte neler olduğunu merak ediyor musun, özellikle de beklediklerini yapmıyorsa?
vi: Mẹo: Đôi khi bạn có thắc mắc điều gì thực sự đang diễn ra trong mã của mình không, đặc biệt là nếu mã không thực hiện những gì mà bạn dự kiến?
zh_cn: 提示：有时候，尤其是代码未按你的预期执行的时候，你会不会想，代码中究竟发生了什么？
zh_tw: 提示：你是否有時想知道你的程式碼中到底發生了什麼，尤其是如果它沒有按照你預期的執行？

source: You can add a `print` statement to have your code tell you exactly what it’s doing by writing useful information to the [console](glossary://console).
de: Du kannst die Anweisung `print` (Ausgabe) hinzufügen, damit der Code dir mitteilt, was er gerade macht, und nützliche Informationen in die [Konsole](glossary://console) schreibt.
es: Puedes añadir una sentencia `print` para que tu código te diga exactamente lo que está haciendo escribiendo información útil en la [consola](glossary://console).
es_419: Puedes agregar una declaración `"print"` para que el código escriba en la [consola](glossary://console) exactamente lo que está haciendo.
fr: Tu peux ajouter une instruction `print` pour que ton code t’indique précisément ce qu’il fait en écrivant des informations utiles dans la [console](glossary://console).
it: Puoi aggiungere un’istruzione `print` affinché il codice ti spieghi esattamente cosa sta facendo, scrivendo informazioni utili nella [console](glossary://console).
ja: `print`（プリント）文を追加すると、役立つ情報を[コンソール](glossary://console)に出力することによって、コードで何が行われているかが分かるようにできます。
ko: `print` 구문을 추가하면 코드가 [콘솔](glossary://console)에 유용한 정보를 작성하여 정확히 무엇을 하는지 사용자에게 알려줄 수 있습니다.
nl: Je kunt een `print`-instructie toevoegen zodat je code precies laat zien wat er gebeurt door nuttige informatie naar de [console](glossary://console) te schrijven.
no: Du kan legge til et `print`-uttrykk for å få koden til å fortelle deg nøyaktig hva den gjør ved å skrive nyttig informasjon til [konsollen](glossary://console).
pt: Para que o seu código lhe diga exatamente o que está fazendo, você pode adicionar uma instrução `print` e escrever informações úteis no [console](glossary://console).
sv: Du kan lägga till ett `print`-uttryck så att koden talar om för dig exakt vad den gör genom att skriva användbar information i [konsolen](glossary://console).
th: คุณสามารถเพิ่มชุดคำสั่ง `print` เพื่อให้โค้ดของคุณบอกคุณได้อย่างชัดเจนว่ากำลังทำอะไรอยู่โดยการเขียนข้อมูลที่เป็นประโยชน์ลงบน[จอคอนโซล](glossary://console)
tr: Kodun yararlı bilgileri [konsola](glossary://console) yazarak yaptıklarını sana tam olarak söylemesini sağlamak için bir `print` ifadesi ekleyebilirsin.
vi: Bạn có thể thêm một câu lệnh `print` để yêu cầu mã cho bạn biết chính xác những gì mã đó đang làm bằng cách ghi thông tin hữu ích vào [bảng điều khiển](glossary://console).
zh_cn: 你可以添加 `print`（打印）语句，让代码将有用的信息写入[控制台](glossary://console)来告诉你它究竟执行了什么操作。
zh_tw: 你可以加入一個 `print` 語句，將有用的資訊寫入[主控台](glossary://console)，讓你的程式碼明確地告訴你它在做什麼。

source: Try adding this line inside your timer closure:
de: Füge diese Zeile in den Timer-Funktionsabschluss ein:
es: Prueba a añadir esta línea dentro de la clausura de tu temporizador:
es_419: Intenta agregar esta línea dentro de la clausura del temporizador:
fr: Essaie d’ajouter cette ligne dans la clôture de ton minuteur :
it: Prova ad aggiungere questa linea di codice all’interno della chiusura del timer:
ja: このコードをtimer（タイマー）クロージャの中に追加してみましょう:
ko: 다음과 같은 라인을 타이머 클로저 안에 추가해 보세요.
nl: Voeg deze regel toe in je timerclosure:
no: Prøv å legge til denne linjen i closure-blokken for nedtellingen:
pt: Experimente adicionar esta linha dentro do encerramento do timer:
sv: Prova att lägga till den här raden inuti timerstängningen:
th: ลองเพิ่มบรรทัดนี้ภายในการปิดนาฬิกานับถอยหลังของคุณ:
tr: Sayaç kapamanın içine bu satırı eklemeyi dene:
vi: Thử thêm dòng này bên trong bao đóng hẹn giờ của bạn:
zh_cn: 试试将这一行添加到计时器闭包内：
zh_tw: 嘗試在你的計時器閉包中內加入這一行：

source: print("Timer \(delayCount) \(Date.now)")
es: print("Temporizador \(delayCount) \(Date.now)")

source: Open the console, and then tap or click the shutter button to take a delayed photo.
de: Öffne die Konsole und tippe oder klicke dann auf die Taste für den Auslöser, um ein Foto mit Verzögerung aufzunehmen.
es: Abre la consola y, a continuación, toca o haz clic en el botón del obturador para hacer una foto con retardo.
es_419: Abre la consola y luego toca o presiona el botón de obturador para tomar una foto con un retraso.
fr: Ouvre la console, puis touche sur le bouton d’obturateur ou clique dessus pour prendre une photo retardée.
it: Apri la console, quindi seleziona il pulsante di scatto per acquisire una foto con ritardo.
ja: コンソールを開いてからシャッターボタンをタップまたはクリックして、少し遅らせて写真を撮影しましょう。
ko: 콘솔을 열고 셔터 버튼을 탭 또는 클릭하여 지연 모드로 사진을 찍으세요.
nl: Open de console en tik of klik vervolgens op de sluiterknop om een uitgestelde foto te maken.
no: Åpne konsollen, og trykk eller klikk deretter på utløserknappen for å ta et bilde med forsinkelse.
pt: Abra o console e toque ou clique no botão obturador para tirar uma foto com atraso.
sv: Öppna konsolen och tryck eller klicka sedan på slutarknappen för att ta en fördröjd bild.
th: เปิดจอคอนโซล จากนั้นแตะหรือคลิกปุ่มชัตเตอร์เพื่อถ่ายรูปแบบหน่วงเวลา
tr: Konsolu aç, sonra gecikmeli bir fotoğraf çekmek için deklanşör düğmesine dokun veya tıkla.
vi: Mở bảng điều khiển và sau đó chạm hoặc bấm nút chụp để chụp một ảnh được trì hoãn.
zh_cn: 打开控制台，然后轻点或点按快门按钮来拍一张有延迟的照片。
zh_tw: 打開主控台，然後點按快門按鈕來拍攝延遲照片。

source: Aren’t you so delighted with your delayed shutter button? Well, why not add a little polish! ✨ You could have the countdown displayed right there in the button!
de: Bist du nicht überglücklich über deine Taste für den verzögerten Auslöser? Wie wäre es, wenn wir das Ganze noch etwas verfeinern? ✨ Du könntest beispielsweise den Countdown direkt in der Taste anzeigen!
es: ¿No te encanta tu botón del obturador con retardo? Pues bien, ¡por qué no le añadimos un poco de brillo! ✨ Podrías hacer que la cuenta atrás se mostrara ahí mismo, en el botón.
es_419: ¿No te encanta tu botón de obturador con retraso? Bueno, ¡y si le agregas un poco de brillo! ✨ ¡Podrías hacer que la cuenta regresiva se muestre en el botón!
fr: Ton bouton d’obturateur retardé ne te convient pas ? Essaie donc de le rendre un peu plus élégant ! ✨ Tu peux afficher le décompte directement dans le bouton !
it: Non pensi di aver fatto un ottimo lavoro aggiungendo questo ritardo al pulsante di scatto? A questo punto, perché non aggiungere un altro tocco da maestro? ✨ Potresti fare in modo che il conto alla rovescia venga mostrato direttamente all’interno del pulsante!
ja: 少し遅れて作動するシャッターボタンに満足しましたか? では、もう少し磨きをかけてみましょう! ✨ ボタンのところにカウントダウンが表示されるといいですよね!
ko: 지연 모드 셔터 버튼이 정말 마음에 들지 않나요? 자, 조금 더 멋지게 만들어 보면 어떨까요? ✨ 버튼 안에 카운트다운을 표시할 수도 있습니다!
nl: Ben je nog niet helemaal tevreden met de vertraagde sluiterknop? Waarom voeg je niet wat extra's toe! ✨ Je kunt het aftellen in de knop zelf weergeven!
no: Er du ikke helt fornøyd med utløserknappen? Du kan gjøre den litt mer elegant ved å vise nedtellingen i knappen! ✨
pt: Você não está contente com o seu botão obturador atrasado? Que tal acrescentar um brilho? ✨ É possível mostrar a contagem regressiva ali mesmo no botão!
sv: Är du inte helnöjd med slutarknappen? Du kan ge den lite extra polityr! ✨ Du kan låta nedräkningen visas direkt i knappen!
th: คุณพอใจกับปุ่มชัตเตอร์แบบหน่วงเวลามากเลยใช่ไหมล่ะ งั้นลองเพิ่มความสวยงามเข้าไปอีกสักนิดสิ! ✨ คุณสามารถทำให้การนับถอยหลังแสดงอยู่ในปุ่มได้เลยด้วย!
tr: Gecikmeli deklanşör düğmenden çok memnunsun, değil mi? Peki, biraz süsleyelim o zaman! ✨ Geri sayımın tam düğmede görüntülenmesini sağlayabilirsin!
vi: Bạn có hài lòng với nút chụp được trì hoãn không? Chà, sao không trau chuốt thêm một chút nhỉ! ✨ Bạn có thể làm cho mục đếm ngược hiển thị ngay bên trong nút!
zh_cn: 对有延迟的快门按钮不太满意吗？不妨加入一点装饰！✨ 你可以让倒计时直接显示在按钮中！
zh_tw: 你對延遲快門按鈕不是很滿意嗎？好吧，為什麼稍微修飾一下呢！✨ 你可以在按鈕中顯示倒數計時！

source: Find the icon for the shutter button: a [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) with its two [Circle](doc://com.apple.documentation/documentation/swiftui/circle) views. Inside the [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), and after the second [Circle](doc://com.apple.documentation/documentation/swiftui/circle), add this code:
de: Suche das Symbol für die Auslösertaste: ein [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) mit den zwei [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-Ansichten. Füge innerhalb des [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) und nach dem zweiten [Circle](doc://com.apple.documentation/documentation/swiftui/circle) diesen Code ein:
es: Busca el icono del botón del obturador: una vista [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) con sus dos vistas de [círculo](doc://com.apple.documentation/documentation/swiftui/circle). Dentro de [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), y después del segundo [círculo](doc://com.apple.documentation/documentation/swiftui/circle), añade este código:
es_419: Encuentra el ícono del botón de obturador: una visualización [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) con sus dos visualizaciones [Circle](doc://com.apple.documentation/documentation/swiftui/circle). Dentro de [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), y después de la segunda visualización [Circle](doc://com.apple.documentation/documentation/swiftui/circle), agrega este código:
fr: Cherche l’icône du bouton d’obturateur : une pile [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) avec ses deux vues [Cercle](doc://com.apple.documentation/documentation/swiftui/circle). Dans la pile [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) et après le deuxième [Cercle](doc://com.apple.documentation/documentation/swiftui/circle), ajoute ce code :
it: Trova l’icona per il pulsante di scatto: una vista [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) con due viste [Circle](doc://com.apple.documentation/documentation/swiftui/circle). All’interno di [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) e dopo il secondo [Circle](doc://com.apple.documentation/documentation/swiftui/circle), aggiungi il codice di seguito:
ja: シャッターボタン用のアイコンを見つけましょう。2つの[Circle](doc://com.apple.documentation/documentation/swiftui/circle)（円）ビューが含まれた[ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)です。[ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)の中の2番目の[Circle](doc://com.apple.documentation/documentation/swiftui/circle)のあとに、このコードを追加します:
ko: 두 개의 [Circle](doc://com.apple.documentation/documentation/swiftui/circle) 보기가 있는 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 셔터 버튼 아이콘을 찾으세요. 이 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)의 내부와 두 번째 [Circle](doc://com.apple.documentation/documentation/swiftui/circle) 뒤에 다음과 같은 코드를 추가합니다.
nl: Ga naar het symbool voor de sluiterknop. Dit is een [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) met twee [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-weergaven. Voeg deze code toe in de [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), na de tweede [Circle](doc://com.apple.documentation/documentation/swiftui/circle):
no: Finn symbolet for utløserknappen: En [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) med to [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-visninger. Legg til denne koden i [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), etter den andre [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-visningen:
pt: Encontre o ícone do botão obturador: um [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) com suas duas visualizações [Circle](doc://com.apple.documentation/documentation/swiftui/circle). Dentro de [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) e depois do segundo [Circle](doc://com.apple.documentation/documentation/swiftui/circle), adicione este código:
sv: Leta rätt på symbolen för slutarknappen: en [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) med sina två [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-vyer. Inuti [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack), och efter den andra [Circle](doc://com.apple.documentation/documentation/swiftui/circle)-vyn, lägger du till den här koden:
th: ค้นหาไอคอนสำหรับปุ่มชัตเตอร์ ซึ่งคือ [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) ที่มีมุมมอง[วงกลม](doc://com.apple.documentation/documentation/swiftui/circle)สองมุมมอง ภายใน [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) และต่อจาก[วงกลม](doc://com.apple.documentation/documentation/swiftui/circle)อันที่สอง ให้ใส่โค้ดนี้:
tr: Deklanşör düğmesinin simgesini bul: iki [Daire](doc://com.apple.documentation/documentation/swiftui/circle) görüntüsü ile bir [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack). [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)’in içinde ve ikinci [Daire](doc://com.apple.documentation/documentation/swiftui/circle)’den sonra şu kodu ekle:
vi: Tìm biểu tượng cho nút chụp: một [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) với hai chế độ xem [Hình tròn](doc://com.apple.documentation/documentation/swiftui/circle). Bên trong [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) và phía sau [Hình tròn](doc://com.apple.documentation/documentation/swiftui/circle) thứ hai, hãy thêm mã này:
zh_cn: 找到快门按钮的图标：带有两个 [Circle](doc://com.apple.documentation/documentation/swiftui/circle)（圆形）视图的 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)（Z 轴堆栈）。在这个 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 内的第二个 [Circle](doc://com.apple.documentation/documentation/swiftui/circle) 之后，添加这些代码：
zh_tw: 找到快門按鈕的圖像：一個 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 和它的兩個 [Circle](doc://com.apple.documentation/documentation/swiftui/circle) 顯示區。在 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 內的第二個 [Circle](doc://com.apple.documentation/documentation/swiftui/circle) 後面加入這段程式碼：

source: Now tap or click the shutter button. Watch it count down the seconds before taking the photo.
de: Tippe oder klicke jetzt auf die Taste für den Auslöser. Beobachte, wie die Sekunden heruntergezählt werden, bis das Foto aufgenommen wird.
es: Ahora toca o haz clic en el botón del obturador. Mira cómo inicia la cuenta atrás de los segundos antes de hacer la foto.
es_419: Ahora toca o presiona el botón de obturador, y observa la cuenta regresiva antes de que se tome la foto.
fr: Touche maintenant sur le bouton d’obturateur ou clique dessus. Observe le décompte des secondes avant que la photo soit prise.
it: Seleziona il pulsante di scatto e osserva il conto alla rovescia dei secondi prima che la foto venga scattata.
ja: では、シャッターボタンをタップまたはクリックしましょう。数秒間カウントダウンしてから写真が撮影されますね?
ko: 이제 셔터 버튼을 탭 또는 클릭하세요. 사진을 촬영하기 전에 초가 카운트다운되는 것을 보세요.
nl: Tik of klik nu op de sluiterknop. Zie je hoe de seconden worden afgeteld voordat de foto wordt gemaakt?
no: Trykk eller klikk på utløserknappen, og se hvordan den teller ned sekundene før bildet tas.
pt: Agora, toque ou clique no botão obturador. Veja como ele conta os segundos regressivamente antes de tirar a foto.
sv: Nu trycker eller klickar du på slutarknappen. Se hur den räknar ned sekunderna innan bilden tas.
th: ตอนนี้ให้แตะหรือคลิกปุ่มชัตเตอร์ แล้วดูนาฬิกานับถอยหลังเป็นวินาทีก่อนที่จะถ่ายรูป
tr: Şimdi, deklanşör düğmesine dokun veya tıkla. Fotoğraf çekilmeden önce saniyelerin geri sayımını izle.
vi: Bây giờ, hãy chạm hoặc bấm nút chụp. Xem nút đếm ngược số giây trước khi chụp ảnh.
zh_cn: 现在轻点或点按快门按钮。看看拍摄照片前所等待秒数的倒计时过程。
zh_tw: 現在點按快門按鈕。在拍照前觀看它倒數計秒。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..title
source: Browsing Your Photos
de: Fotos durchsuchen
es: Explorar las fotos
es_419: Explorar tus fotos
fr: Parcourir des photos
it: Sfogliare le tue foto
ja: 写真をブラウズする
ko: 사진 둘러보기
nl: Door je foto's bladeren
no: Bla i bildene dine
pt: Explorando Suas Fotos
sv: Bläddra bland bilder
th: การเลือกหารูปภาพของคุณ
tr: Fotoğraflarına Göz Atma
vi: Duyệt ảnh của bạn
zh_cn: 浏览照片
zh_tw: 瀏覽照片

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..Paragraph109
source: Enjoy taking photos? Most of us do, and it’s easy to end up with hundreds or thousands of photos in your library. 🏞
de: Du machst gerne Fotos? Wir auch – und es kann leicht passieren, dass wir am Schluss Hunderte oder Tausende Fotos in unserer Mediathek haben. 🏞
es: ¿Te gusta hacer fotos? Es algo que nos gusta a la mayoría, y es fácil acabar teniendo cientos (o incluso miles) de fotos en la fototeca. 🏞
es_419: ¿Te gusta tomar fotos? A la mayoría nos encanta, y por eso es muy fácil terminar con cientos o miles de fotos en nuestras fototecas. 🏞
fr: Tu aimes prendre des photos ? C’est le cas pour la plupart d’entre nous et on se retrouve vite avec des centaines, voire des milliers, de photos dans notre bibliothèque. 🏞
it: Ti diverti a scattare foto? Piace praticamente a tutti e spesso ci ritroviamo con migliaia di foto nella libreria. 🏞
ja: 写真撮影を楽しんでいますか? ほとんどの人がそうかと思いますが、何百枚、何千枚もの写真がライブラリに溜まってしまいがちですよね。🏞
ko: 사진 찍기를 즐기시나요? 우리 대부분이 그렇죠. 그러다가 보관함에 수백 장 혹은 수천 장의 사진이 쌓이게 됩니다. 🏞
nl: Vind je het leuk om foto's te maken? Veel mensen doen dit graag en hebben vaak een bibliotheek met honderden of duizenden foto's. 🏞
no: Er du glad i å ta bilder? Det er de fleste av oss, og det er fort gjort å fylle biblioteket med hundrevis eller kanskje til og med tusenvis av bilder. 🏞
pt: Você curte tirar fotos? A maioria de nós curte, e é fácil acabar tendo centenas ou milhares de fotos na fototeca. 🏞
sv: Gillar du att fota? Många av oss gör det och har till slut hundratals, eller kanske tusentals, bilder i våra bibliotek. 🏞
th: ชอบถ่ายรูปใช่ไหม พวกเราส่วนใหญ่ชอบ และลงเอยด้วยการมีรูปภาพเป็นร้อยๆ หรือเป็นพันๆ รูปในคลังของคุณได้ง่ายๆ 🏞
tr: Fotoğraf çekmeyi sever misin? Çoğumuz severiz ve bir bakmışsın arşivinde yüzlerce veya binlerce fotoğraf birikmiş. 🏞
vi: Bạn có thích chụp ảnh không? Hầu hết chúng ta đều thích và rất dễ đưa tới kết quả là có hàng trăm hay hàng nghìn bức ảnh trong thư viện. 🏞
zh_cn: 喜欢拍照吗？大多数人都喜欢，而且一不小心图库中就可能有成百上千张照片。🏞
zh_tw: 喜歡拍照嗎？我們大多數人都喜歡，並且很容易地會在圖庫中收藏成千上百張的照片。🏞

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..Paragraph110
source: Follow your photos as they’re retrieved from your photo library and displayed in a scrolling gallery you can browse.
de: Verfolge deine Fotos auf ihrem Weg von deiner Fotomediathek, aus der sie abgerufen werden, in eine scrollbare Galerie, in der du sie durchsuchen kannst.
es: Sigue tus fotos a medida que se recuperan de tu fototeca y se muestran en una galería que puedes explorar desplazándote por ella.
es_419: Sigue la ruta de tus fotos conforme se obtienen de tu fototeca y se muestran en una galería desplazable que te permite explorarlas.
fr: Suis tes photos lorsqu’elles sont récupérées dans ta photothèque et affichées dans une galerie défilante que tu peux parcourir.
it: Segui il viaggio delle tue foto da quando vengono recuperate dalla tua libreria fino a quando vengono visualizzate in una galleria che puoi far scorrere per consultarla.
ja: フォトライブラリから取り出される都度、写真をフォローし、ブラウズできる、スクロールするギャラリーに表示しましょう。
ko: 사진을 사진 보관함에서 불러오고, 스크롤 갤러리에서 둘러볼 수 있도록 표시하는 과정을 따라 사진을 살펴보세요.
nl: Volg je foto's terwijl ze uit je fotobibliotheek worden opgehaald en in een galerie worden weergegeven waar je doorheen kunt scrollen.
no: Følg bildene dine når de hentes fra bildebiblioteket og vises i et rullende galleri som du kan bla gjennom.
pt: Siga suas fotos conforme elas são obtidas da fototeca e mostradas em uma galeria rolável que você pode explorar.
sv: Följ dina bilder när de hämtas från bildbiblioteket och visas i ett rullande galleri där du kan bläddra bland dem.
th: ติดตามรูปภาพของคุณในขณะที่ถูกดึงข้อมูลมาจากคลังรูปภาพและแสดงในแกลเลอรี่แบบเลื่อนไปมาที่คุณสามารถเลือกดูได้
tr: Fotoğraflarını, fotoğraf arşivinden alınıp göz atabileceğin bir kaydırılan galeride görüntülenene kadar izle.
vi: Theo dõi ảnh của bạn khi chúng được truy xuất từ thư viện ảnh và hiển thị trong một phòng trưng bày dạng cuộn mà bạn có thể duyệt.
zh_cn: 跟踪从照片图库中取出并显示在滚动的可浏览画廊中的照片。
zh_tw: 從照片資料庫擷取照片並顯示在捲動式圖庫中供你瀏覽時，追蹤你的照片。

source: Using the Photo Collection
de: Fotosammlung verwenden
es: Usar la colección de fotos
es_419: Usar la colección de fotos
fr: Utiliser la collection de photos
it: Utilizzare la raccolta di foto
ja: フォトコレクションを使う
ko: 사진 모음 사용하기
nl: De fotoverzameling gebruiken
no: Bruke bildesamlingen
pt: Usando a Coleção de Fotos
sv: Använda bildsamlingen
th: การใช้คอลเลกชั่นรูปภาพ
tr: Fotoğraf Koleksiyonunu Kullanma
vi: Sử dụng bộ sưu tập ảnh
zh_cn: 使用照片集
zh_tw: 使用照片集
