Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Now that you’ve got the captured photo, you add it into the camera’s photo stream. It’s then available to any object in your app waiting for a photo, like the data model.
de: Jetzt musst du das aufgenommene Foto zum Fotostream der Kamera hinzufügen. Danach ist es für jedes Objekt in deiner App verfügbar, das auf Fotos wartet, wie das Datenmodell.
es: Ahora que tienes la foto capturada, se añade a la secuencia de fotos de la cámara. A partir de ese momento, estará disponible para cualquier objeto de tu app que esté esperando una foto, como el modelo de datos.
es_419: Ahora que tienes la foto capturada, debes agregarla al flujo de fotos de la cámara. Luego, estará disponible para cualquier objeto en tu app que esté esperando una foto, como tu modelo de datos.
fr: Maintenant que tu as la photo qui a été prise en ta possession, tu peux l’ajouter au flux de photos de ton appareil photo. Elle sera ensuite disponible pour n’importe quel objet de ton app qui attend une photo, comme le modèle de données.
it: Adesso che hai acquisito una foto, puoi aggiungerla al flusso della fotocamera, in modo che poi sia disponibile per qualsiasi oggetto nella tua app in attesa di una foto, come il modello di dati.
ja: これで写真が取り込まれたので、それをカメラのフォトストリームに追加しましょう。そうすると、データモデルなど、写真を待っているApp内のすべてのオブジェクトで使用できるようになります。
ko: 이제 사진이 캡처되었으므로 카메라의 사진 스트림에 추가합니다. 이렇게 하면 데이터 모델과 같이 사진을 기다리는 앱의 모든 객체에서 사용할 수 있습니다.
nl: Nu je de vastgelegde foto hebt, ga je deze toevoegen aan de fotostream van de camera. De foto is dan beschikbaar voor elk object in de app dat wacht op een foto uit de stream, zoals het gegevensmodel.
no: Nå som du har bildet som ble tatt, legger du det til i kameraets bildestrøm. Deretter blir det tilgjengelig for alle objekter i appen som venter på et bilde, for eksempel datamodellen.
pt: Agora que você capturou a foto, adicione‑a ao fluxo de fotos da câmera. Ela estará disponível para qualquer objeto no app que esteja esperando uma foto, como o modelo de dados.
sv: Nu när du har den tagna bilden kan du lägga till den i kamerans bildström. Sedan är den tillgänglig för alla objekt i appen som väntar på en bild, exempelvis datamodellen.
th: ตอนนี้คุณมีรูปภาพที่ถ่ายแล้ว ให้คุณเพิ่มรูปภาพนั้นลงในสตรีมรูปภาพของกล้อง จากนั้นรูปภาพนั้นจะพร้อมใช้งานสำหรับวัตถุใดๆ ในแอปของคุณที่กำลังรอรูปภาพ เช่น โมเดลข้อมูล
tr: Yakalanan fotoğraf artık elinde olduğuna göre bunu kameranın fotoğraf yayınına ekle. Böylece, uygulamanda fotoğraf bekleyen tüm nesneler (veri modeli gibi) tarafından kullanılabilir.
vi: Bây giờ, bạn đã có ảnh được ghi, bạn thêm ảnh đó vào luồng ảnh của camera. Sau đó, ảnh khả dụng đối với bất kỳ đối tượng nào trong ứng dụng của bạn đang chờ ảnh, như mô hình dữ liệu.
zh_cn: 现在你有了捕捉到的照片，可将它添加到相机的照片流中。然后 App 中等待照片的任何对象（如数据模型）都可以使用它了。
zh_tw: 現在你已經得到了拍攝的照片，你可以將它加入相機的照片串流中。然後，它就可以提供給 App 中任何等待照片的物件使用，如你的資料模型。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..TaskprocessPhoto..title
source: Processing and Saving a Photo
de: Foto verarbeiten und sichern
es: Procesar y guardar una foto
es_419: Procesar y guardar una foto
fr: Traiter et enregistrer une photo
it: Elaborare e salvare una foto
ja: 写真を処理して保存する
ko: 사진 처리하기 및 저장하기
nl: Een foto verwerken en bewaren
no: Behandle og arkivere et bilde
pt: Processando e Salvando uma Foto
sv: Bearbeta och spara en bild
th: การประมวลผลและบันทึกรูปภาพ
tr: Fotoğrafı İşleme ve Kaydetme
vi: Xử lý và lưu ảnh
zh_cn: 处理和存储照片
zh_tw: 處理和儲存照片

source: Discover how to unpack a captured photo and save it to your photo library.
de: Erfahre, wie du ein aufgenommenes Foto entpackst und es in deiner Fotomediathek sicherst.
es: Descubre cómo desempaquetar una foto capturada y guardarla en tu fototeca.
es_419: Descubre cómo desempacar una foto capturada y guardarla en tu fototeca.
fr: Découvre comment décompresser une photo prise et l’enregistrer dans ta photothèque.
it: Scopri come decomprimere una foto che hai acquisito e salvarla nella libreria di foto.
ja: 取り込んだ写真を展開する方法、およびそれをフォトライブラリに保存する方法を学びましょう。
ko: 캡처한 사진을 압축 해제하는 방법을 알아보고 사진 보관함에 저장하세요.
nl: Ontdek hoe je een vastgelegde foto uitpakt en deze in je fotobibliotheek bewaart.
no: Finn ut hvordan du pakker opp et bilde du har tatt, og arkiverer det i bildebiblioteket.
pt: Descubra como desempacotar uma foto capturada e salvá‑la na fototeca.
sv: Upptäck hur du packar upp en tagen bild och sparar den i bildbiblioteket.
th: ค้นหาวิธีถอดแพ็คเกจรูปภาพที่ถ่าย แล้วบันทึกลงในคลังรูปภาพของคุณ
tr: Yakalanan bir fotoğrafı nasıl açacağını ve fotoğraf arşivine kaydedeceğini keşfet.
vi: Khám phá cách giải nén một hình ảnh đã ghi lại và lưu vào thư viện ảnh của bạn.
zh_cn: 探索如何对捕捉到的照片进行拆包，并将它存储到照片图库中。
zh_tw: 瞭解如何解開擷取的照片並將其儲存到你的照片圖庫。

source: Your data model is patiently awaiting newly-captured photos.
de: Dein Datenmodell wartet ungeduldig auf neu aufgenommene Fotos.
es: Tu modelo de datos está esperando pacientemente las fotos recién capturadas.
es_419: Tu modelo de datos está esperando pacientemente las fotos recién capturadas.
fr: Ton modèle de données attend patiemment de nouvelles photos.
it: Il tuo modello di dati è in attesa delle nuove foto che hai acquisito.
ja: データモデルは、新しく取り込まれた写真を辛抱強く待っています。
ko: 데이터 모델은 새로 캡처한 사진을 위해 대기하고 있습니다.
nl: Je gegevensmodel wacht geduldig op zojuist vastgelegde foto's.
no: Datamodellen venter tålmodig på nye bilder.
pt: O seu modelo de dados está aguardando pacientemente por fotos recém‑capturadas.
sv: Datamodellen väntar tålmodigt på nytagna bilder.
th: โมเดลข้อมูลของคุณกำลังรอคอยรูปภาพที่ถ่ายใหม่อย่างใจเย็น
tr: Veri modelin yeni yakalanan fotoğrafları sabırla bekliyor.
vi: Mô hình dữ liệu của bạn đang kiên nhẫn đợi ảnh được ghi mới.
zh_cn: 你的数据模型正在耐心等待新捕捉的照片。
zh_tw: 你的資料模型正在耐心等待擷取的新照片。

source: Just as for preview images, it has a dedicated [task](glossary://task) for handling the captured photo stream from the camera, using its `handleCameraPhotos` method.
de: Wie bei Vorschaubildern hat es die Spezial[aufgabe](glossary://task), den Stream mit aufgenommenen Fotos von der Kamera mit der Methode `handleCameraPhotos` zu verarbeiten.
es: Al igual que para las imágenes de previsualización, tiene una [tarea](glossary://task) dedicada para gestionar la secuencia de fotos capturadas desde la cámara, mediante su método `handleCameraPhotos`.
es_419: Al igual que con las imágenes de vista previa, tu modelo de datos tiene una [tarea](glossary://task) dedicada para controlar el flujo de fotos capturadas de la cámara usando su método `handleCameraPhotos`.
fr: Tout comme les images d’aperçu, il possède une [tâche](glossary://task) pour gérer le flux de photos prises à partir de l’appareil photo, à l’aide de sa méthode `handleCameraPhotos`.
it: Proprio come avviene per le immagini di anteprima, c’è un’[attività](glossary://task) dedicata per gestire il flusso di immagini acquisite dalla fotocamera, utilizzando il metodo `handleCameraPhotos`.
ja: プレビューイメージと同じように、カメラから取り込んだフォトストリームを`handleCameraPhotos`（カメラの写真を処理）メソッドを使って処理するための専用[タスク](glossary://task)があります。
ko: 미리보기 이미지의 경우와 마찬가지로, 데이터 모델에는 카메라에서 캡처한 사진 스트림을 처리하는 전용 [작업](glossary://task)이 있으며, `handleCameraPhotos` 메소드가 사용됩니다.
nl: Net als bij voorvertoningsbeelden heeft het gegevensmodel een speciale [taak](glossary://task) om de vastgelegde fotostream van de camera te verwerken met de methode `handleCameraPhotos`.
no: Akkurat som for forhåndsvisningsbilder har den en egen [oppgave](glossary://task) for å håndtere håndtere bildestrømmen fra kameraet ved hjelp av `handleCameraPhotos`-metoden.
pt: Assim como nas imagens de pré‑visualização, ele tem uma [tarefa](glossary://task) dedicada a controlar o fluxo de fotos capturadas da câmera, usando o método `handleCameraPhotos`.
sv: Precis som för förhandsvisningsbilder har den en dedikerad [åtgärd](glossary://task) för att hantera bildströmmen med tagningar från kameran genom att använda metoden `handleCameraPhotos`.
th: เช่นเดียวกับภาพการแสดงตัวอย่าง มี[งาน](glossary://task)เฉพาะสำหรับจัดการสตรีมของรูปภาพที่ถ่ายจากกล้องโดยใช้วิธีการ `handleCameraPhotos`
tr: Tıpkı önizleme görüntülerinde olduğu gibi, `handleCameraPhotos` metodunu kullanarak kameradan yakalanan fotoğraf yayınını işlemeye adanmış bir [görevi](glossary://task) vardır.
vi: Cũng giống như đối với các hình ảnh xem trước, phần này có một [tác vụ](glossary://task) chuyên biệt để xử lý luồng ảnh đã ghi từ camera, sử dụng phương thức `handleCameraPhotos`.
zh_cn: 和预览图像一样，数据模型还有另一个专用[任务](glossary://task)，可通过它的 `handleCameraPhotos`（处理相机照片）方法处理来自相机的已捕捉照片流。
zh_tw: 就像預覽影像一樣，它有一個專用的[任務](glossary://task)，會使用它的 `handleCameraPhotos` 方法來處理從相機擷取的照片串流。

source: You can learn more about [tasks](doc://com.apple.documentation/documentation/swift/task) in the Swift standard library.
de: In der Swift-Standardmediathek erfährst du mehr über [Aufgaben](doc://com.apple.documentation/documentation/swift/task).
es: Puedes obtener más información sobre las [tareas](doc://com.apple.documentation/documentation/swift/task) en la biblioteca estándar de Swift.
es_419: Puedes obtener detalles sobre las [tareas](doc://com.apple.documentation/documentation/swift/task) en la biblioteca estándar de Swift.
fr: Obtiens davantage d’informations sur les [tâches](doc://com.apple.documentation/documentation/swift/task) dans la bibliothèque standard de Swift.
it: Puoi scoprire di più sulle [attività](doc://com.apple.documentation/documentation/swift/task) nella libreria standard di Swift.
ja: [tasks](doc://com.apple.documentation/documentation/swift/task)（タスク）について詳しくは、Swift標準ライブラリをご覧ください。
ko: Swift 표준 라이브러리에서 [tasks](doc://com.apple.documentation/documentation/swift/task)에 관해 더 알아볼 수 있습니다.
nl: Meer informatie over [taken](doc://com.apple.documentation/documentation/swift/task) vind je in de Swift-standaardbibliotheek.
no: Du kan lese mer om [oppgaver](doc://com.apple.documentation/documentation/swift/task) i Swift-standardbiblioteket.
pt: Sabia mais sobre [tasks](doc://com.apple.documentation/documentation/swift/task) na biblioteca padrão de Swift.
sv: Du kan läsa mer om [åtgärder](doc://com.apple.documentation/documentation/swift/task) i Swift-standardbiblioteket.
th: คุณสามารถเรียนรู้เพิ่มเติมเกี่ยวกับ[งาน](doc://com.apple.documentation/documentation/swift/task)ในคลังมาตรฐาน Swift ได้
tr: Swift’in standart kitaplığında [görevler](doc://com.apple.documentation/documentation/swift/task) hakkında daha fazla bilgi edinebilirsin.
vi: Bạn có thể tìm hiểu thêm về [tác vụ](doc://com.apple.documentation/documentation/swift/task) trong thư viện Swift tiêu chuẩn.
zh_cn: 你可以在 Swift 标准库中进一步了解[任务](doc://com.apple.documentation/documentation/swift/task)。
zh_tw: 你可以在 Swift 標準資料庫中進一步瞭解[任務](doc://com.apple.documentation/documentation/swift/task)。

source: Each [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) element in the camera’s `photoStream` may contain several images at different resolutions, as well as other [metadata](glossary://metadata) about the image, such as its size and the date and time the image was captured. You have to unpack it to get the images and metadata that you want.
de: Jedes [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-Element im `photoStream` der Kamera kann mehrere Bilder in verschiedenen Auflösungen und auch andere [Metadaten](glossary://metadata) über das Bild enthalten, z. B. Größe sowie Datum und Uhrzeit der Aufnahme. Du musst sie nur entpacken, um die gewünschten Bilder und Metadaten zu erhalten.
es: Cada elemento [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) de la galería (`photoStream`) de la cámara puede contener varias imágenes a diferentes resoluciones, así como otros [metadatos](glossary://metadata) sobre la imagen, como su tamaño y la fecha y hora en que se capturó la imagen. Se tiene que desempaquetar para obtener las imágenes y los metadatos que quieres.
es_419: Cada elemento [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) en el flujo `photoStream` de la cámara puede contener varias imágenes de diferentes resoluciones, así como otros [metadatos](glossary://metadata) sobre la imagen, como su tamaño y la fecha y hora de captura. Para obtener las imágenes y los metadatos que quieres, debes desempacarlo.
fr: Chaque élément [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) dans le flux `photoStream` de l’appareil photo peut contenir plusieurs images de résolutions différentes, ainsi que d’autres [métadonnées](glossary://metadata) relatives à l’image, comme sa taille et la date et l’heure de la capture de l’image. Tu dois le décompresser pour obtenir les images et les métadonnées de ton choix.
it: Ogni elemento [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) nel flusso `photoStream` della fotocamera può contenere varie immagini con risoluzioni differenti, così come altri [metadati](glossary://metadata), come, per esempio, la data e l’ora in cui la foto è stata scattata e le sue dimensioni. Per ottenere le immagini e i metadati che ti interessano, prima devi decomprimerli.
ja: カメラの`photoStream`（写真ストリーム）内のそれぞれの[AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)要素には、解像度が異なる複数のイメージと、イメージに関するその他の[メタデータ](glossary://metadata)（イメージのサイズやイメージが取り込まれた日時など）が含まれています。これを展開して、必要なイメージとメタデータを取得する必要があります。
ko: 카메라의 `photoStream`에 있는 각각의 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 요소는 해상도가 다양한 여러 이미지를 비롯해 이미지와 관련된 기타 [메타데이터](glossary://metadata)(예: 이미지의 크기, 이미지가 캡처된 날짜 및 시간)를 포함할 수 있습니다. 원하는 이미지 및 메타데이터를 얻으려면 사용자는 이를 압축 해제해야 합니다.
nl: Elk [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-element in de `photoStream` van de camera kan meerdere afbeeldingen met verschillende resoluties bevatten, plus andere [metadata](glossary://metadata) over de afbeelding, zoals de grootte en de datum en tijd waarop de afbeelding is vastgelegd. Je moet deze uitpakken om de gewenste afbeeldingen en metadata te verkrijgen.
no: Hvert [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-element i kameraets `photoStream` kan inneholde flere bilder med forskjellige oppløsninger og andre [metadata](glossary://metadata) om bildet, for eksempel bildets størrelse og datoen og klokkeslettet da det ble tatt. Du må pakke det opp for å få bildene og metadataene du vil ha.
pt: Cada elemento [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) no `photoStream` da câmera pode conter várias imagens com resoluções diferentes, bem como outros [metadados](glossary://metadata) sobre a imagem, como o tamanho, e a data e a hora em que a imagem foi capturada. Você precisa desempacotá‑lo para obter as imagens e os metadados desejados.
sv: Vartenda [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-element i kamerans `photoStream` kan innehålla flera bilder med olika upplösningar liksom andra [metadata](glossary://metadata) om bilden, exempelvis dess storlek och datum och tid då bilden togs. Du måste packa upp det för att komma åt de bilder och metadata som du vill ha.
th: องค์ประกอบ [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) แต่ละองค์ประกอบใน `photoStream` ของกล้องอาจมีหลากหลายภาพในความละเอียดที่ต่างกัน รวมทั้งมี[เมตาดาต้า](glossary://metadata)อื่นเกี่ยวกับภาพ เช่น ขนาดของภาพและวันที่และเวลาที่ถ่ายภาพ คุณต้องถอดแพ็คเกจเพื่อรับภาพและเมตาดาต้าที่คุณต้องการ
tr: Kameranın `photoStream`’indeki her [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) öğesi farklı çözünürlüklerde pek çok görüntünün yanı sıra görüntüyle ilgili büyüklüğü ve görüntünün çekildiği tarih ve saat gibi diğer [üst verileri](glossary://metadata) içerir. İstediğin görüntüleri ve üst verileri almak için bunu açman gerekir.
vi: Mỗi phần tử [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) trong `photoStream` của camera có thể chứa một số hình ảnh có độ phân giải khác nhau, cũng như các [siêu dữ liệu](glossary://metadata) khác về hình ảnh, ví dụ như kích cỡ cùng với ngày và giờ mà hình ảnh được ghi. Bạn phải giải nén để lấy các hình ảnh và siêu dữ liệu mong muốn.
zh_cn: 相机 `photoStream`（照片流）中的每个 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 元素都可能包含不同分辨率的多张图像，以及关于该图像的其他[元数据](glossary://metadata)，如图像的大小和图像捕捉的日期及时间。你必须对 `photoStream` 进行拆包，才能获得想要的图像和元数据。
zh_tw: 相機的 `photoStream` 中的每個 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 元件可能包含數個不同解析度的影像，以及其他與影像有關的[後設資料](glossary://metadata )，例如影像的大小和擷取影像的日期和時間。你必須解開它來得到你要的影像和後設資料。

source: The first thing you do in `handleCameraPhotos` is to convert `photoStream` into a more useful `unpackedPhotoStream`, in which each element is an instance of the `PhotoData` structure that contains the data you want.
de: Konvertiere zunächst in `handleCameraPhotos` den `photoStream` in einen praktischeren `unpackedPhotoStream` (entpackten Fotostream), in dem jedes Element eine Instanz der `PhotoData`-Struktur ist, die die gewünschten Daten enthält.
es: Lo primero que se hace en `handleCameraPhotos` es convertir `photoStream` en una galería desempaquetada (`unpackedPhotoStream`) más útil, en la que cada elemento es una instancia de la estructura `PhotoData` que contiene los datos que quieres.
es_419: Lo primero que tienes que hacer en `handleCameraPhotos` es convertir el flujo `photoStream` en un flujo `unpackedPhotoStream` más útil, donde cada elemento es una instancia de la estructura `PhotoData` que contiene los datos que quieres.
fr: La première chose que tu dois faire dans `handleCameraPhotos`, c’est convertir `photoStream` en flux `unpackedPhotoStream`, qui est plus pratique et dans lequel chaque élément est une instance de la structure `PhotoData` qui contient les données que tu veux.
it: La prima cosa da fare in `handleCameraPhotos` è convertire `photoStream` in un molto più utile `unpackedPhotoStream`, in cui ciascun elemento è un’istanza della struttura `PhotoData` contenente i dati che desideri.
ja: `handleCameraPhotos`（カメラの写真を処理）で最初に行うのは、`photoStream`（写真ストリーム）をもっと便利な`unpackedPhotoStream`（展開後の写真ストリーム）に変換することです。`unpackedPhotoStream`内のそれぞれの要素は、あなたが必要とするデータを含んだ`PhotoData`（写真データ）構造体のインスタンスです。
ko: `handleCameraPhotos`에서 먼저 수행하는 작업은 `photoStream`을 더욱 유용한 `unpackedPhotoStream`으로 변환하는 것입니다. `unpackedPhotoStream`에서 각각의 요소는 사용자가 원하는 데이터를 포함하는 `PhotoData` 데이터 구조의 인스턴스입니다.
nl: Het eerste wat je doet in `handleCameraPhotos` is om `photoStream` om te zetten in een nuttigere `unpackedPhotoStream`, waarin elk element een instantie van de `PhotoData`-structuur is met de gewenste gegevens.
no: Det første du gjør i `handleCameraPhotos` er å konvertere `photoStream` til en mer nyttig `unpackedPhotoStream` der hvert element er en instans av `PhotoData`-strukturen som inneholder dataene du vil ha.
pt: A primeira coisa que você deve fazer em `handleCameraPhotos` é converter `photoStream` em um `unpackedPhotoStream` mais útil, onde cada elemento seja uma instância da estrutura `PhotoData` que contém os dados que você quer.
sv: Det första du gör i `handleCameraPhotos` är att konvertera `photoStream` till en mer användbar `unpackedPhotoStream` där varje element är en instans av `PhotoData`-strukturen som innehåller de data du vill ha.
th: สิ่งแรกที่คุณจะทำใน `handleCameraPhotos` คือแปลง `photoStream` ให้เป็น `unpackedPhotoStream` ที่มีประโยชน์มากขึ้น โดยแต่ละองค์ประกอบเป็นชื่อแทนประเภทของโครงสร้าง `PhotoData` ที่มีข้อมูลที่คุณต้องการ
tr: `handleCameraPhotos`’da yapacağın ilk şey `photoStream`’i, içindeki her öğenin istediğin verileri içeren `PhotoData` yapısının bir örneği olduğu daha yararlı bir `unpackedPhotoStream`’e dönüştürmektir.
vi: Việc đầu tiên mà bạn thực hiện trong `handleCameraPhotos` là chuyển đổi `photoStream` thành một `unpackedPhotoStream` hữu ích hơn, trong đó mỗi phần tử là một thể hiện của cấu trúc `PhotoData` chứa dữ liệu mà bạn muốn.
zh_cn: 在 `handleCameraPhotos` 中要做的第一件事是将 `photoStream` 转换为更加有用的 `unpackedPhotoStream`（已拆包照片流），其中每个元素都是包含所需数据的 `PhotoData`（照片数据）结构的一个实例。
zh_tw: 你在 `handleCameraPhotos` 中做的第一件事是將 `photoStream` 轉換成一個更有用的 `unpackedPhotoStream`，其中每個元素都是 `PhotoData` 結構的一個實例，包含你想要的資料。

source: To unpack the `photoStream`, you’ll use the `unpackPhoto(_:)` function, which takes a captured photo and returns a `PhotoData` instance that contains:
de: Um `photoStream` zu entpacken, verwendest du die Funktion `unpackPhoto(_:)` (Foto entpacken). Sie erzeugt aus einem aufgenommenen Foto eine `PhotoData`-Instanz, die Folgendes enthält:
es: Para desempaquetar `photoStream`, usarás la función `unpackPhoto(_:)`, que toma una foto capturada y devuelve una instancia de `PhotoData` que contiene:
es_419: Para desempacar `photoStream`, debes usar la función `unpackPhoto(_:)`, la cual toma una foto capturada y devuelve una instancia de `PhotoData` que contiene:
fr: Pour décompresser `photoStream`, tu utiliseras la fonction `unpackPhoto(_:)`, qui prend une photo prise et renvoie une instance `PhotoData` qui contient :
it: Per decomprimere il `photoStream`, devi usare la funzione `unpackPhoto(_:)`, la quale prende una foto scattata e restituisce un’istanza `PhotoData` che contiene:
ja: `photoStream`（写真ストリーム）を展開するには、`unpackPhoto(_:)`（写真を展開）関数を使用します。この関数は、取り込まれた写真を取得し、含まれている`PhotoData`（写真データ）インスタンスを返します:
ko: `photoStream`을 압축 해제하려면 `unpackPhoto(_:)` 함수를 사용합니다. 이 함수는 캡처된 사진을 가져와 다음을 포함하는 `PhotoData` 인스턴스를 반환합니다.
nl: Om de `photoStream` uit te pakken, gebruik je die functie `unpackPhoto(_:)`, die een vastgelegde foto ontvangt en een `PhotoData`-instantie retourneert die het volgende bevat:
no: For å pakke opp `photoStream` bruker du `unpackPhoto(_:)`-funksjonen som tar et bilde som har blitt tatt, og returnerer en `PhotoData`-instans som inneholder:
pt: Para desempacotar `photoStream`, você usará a função `unpackPhoto(_:)`, que usa uma foto capturada e retorna uma instância de `PhotoData` que contém:
sv: När du packar upp `photoStream` använder du funktionen `unpackPhoto(_:)` som tar en tagen bild och returnerar en instans av `PhotoData` som innehåller:
th: ในการถอดแพ็คเกจ `photoStream` คุณจะต้องใช้ฟังก์ชั่น `unpackPhoto(_:)` ซึ่งถ่ายรูปและคืนค่าชื่อแทนประเภท `PhotoData` ที่มีสิ่งต่างๆ ต่อไปนี้:
tr: `photoStream` paketini açmak için çekilen bir fotoğrafı alıp şunları içeren bir `PhotoData` örneği döndüren `unpackPhoto(_:)` fonksiyonunu kullanacaksın:
vi: Để giải nén `photoStream`, bạn sẽ sử dụng hàm `unpackPhoto(_:)`, lấy một ảnh được ghi và trả về một thể hiện `PhotoData` chứa:
zh_cn: 将 `photoStream` 拆包将需要使用 `unpackPhoto(_:)` 函数，它会接收已捕捉的照片，并返回包含以下内容的 `PhotoData` 实例：
zh_tw: 若要解開 `photoStream`，你要使用 `unpackPhoto(_:)` 函數，它會採用擷取的照片並傳回一個包含下列內容的 `PhotoData` 實例：
