Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: You’ll notice that `photoAssets` is a [published](glossary://published%20value) property of `PhotoCollection`, which is an [observable object](glossary://observable%20object). This means that you can respond to changes in the photo assets, such as when photos are added or deleted.
de: Du wirst feststellen, dass `photoAssets` eine [veröffentlichte](glossary://published%20value) Eigenschaft von `PhotoCollection` ist. Und das ist wiederum ein [beobachtbares Objekt](glossary://observable%20object). Das bedeutet, dass du auf Änderungen an Fotodateien reagieren kannst, z. B. wenn Fotos hinzugefügt oder gelöscht werden.
es: Verás que `photoAssets` es una propiedad [publicada](glossary://published%20value) de `PhotoCollection`, que es un [objeto observable](glossary://observable%20object). Esto significa que puedes responder a los cambios en los activos de fotos, como cuando se añaden o eliminan fotos.
es_419: Notarás que `"photoAssets"` es una propiedad [publicada](glossary://published%20value) de la propiedad `"PhotoCollection"`, la cual es un [objeto observable](glossary://observable%20object); esto significa que puede responder a los cambios en los activos fotográficos, como cuando se agrega o elimina una foto.
fr: Tu remarqueras que `photoAssets` est une propriété [publiée](glossary://published%20value) de `PhotoCollection`, qui est un [objet observable](glossary://observable%20object). Cela signifie que tu peux répondre aux modifications apportées aux ressources photographiques, comme le moment où des photos sont ajoutées ou supprimées.
it: Noterai che `photoAssets` è una proprietà [pubblicata](glossary://published%20value) di `PhotoCollection`, che a sua volta è un [oggetto osservabile](glossary://observable%20object). Questo significa che puoi rispondere ai cambiamenti che avvengono nelle risorse fotografiche, ad esempio se vengono aggiunte o cancellate foto.
ja: `photoAssets`（フォト素材）は、[オブザーバブルオブジェクト](glossary://observable%20object)である`PhotoCollection`（フォトコレクション）の[公開](glossary://published%20value)プロパティです。つまり、写真が追加されたり削除された場合などのフォト素材の変化に対応することができます。
ko: `photoAssets`는 `PhotoCollection`의 [게시](glossary://published%20value)된 속성으로, [관찰 가능한 객체](glossary://observable%20object)임을 확인할 수 있습니다. 즉, 사진이 추가되거나 삭제되었을 때와 같은 사진 항목의 변화에 반응할 수 있다는 것입니다.
nl: `photoAssets` is een [gepubliceerde](glossary://published%20value) eigenschap van het [observeerbare object](glossary://observable%20object) `PhotoCollection`. Dit betekent dat je kunt reageren op wijzigingen in de fotobestanden, bijvoorbeeld als foto's worden toegevoegd of verwijderd.
no: Du ser at `photoAssets` er en [publisert](glossary://published%20value) egenskap for `PhotoCollection`, som er et [observerbart objekt](glossary://observable%20object). Det betyr at du kan reagere på endringer i bilderessursene, for eksempel når bilder legges til eller slettes.
pt: Você perceberá que `photoAssets` é uma propriedade [publicada](glossary://published%20value) de `PhotoCollection`, que é um [objeto observável](glossary://observable%20object). Isso significa que você pode responder a mudanças nos recursos de foto, como quando fotos são adicionadas ou apagadas.
sv: Du kan se att `photoAssets` är en [publicerad](glossary://published%20value) egenskap hos `PhotoCollection` som är ett [observerbart objekt](glossary://observable%20object). Det innebär att du kan reagera på förändringar i bildresurserna, till exempel när bilder läggs till eller raderas.
th: คุณจะสังเกตเห็นว่า `photoAssets` เป็นคุณสมบัติ[ที่ถูกเผยแพร่](glossary://published%20value)ของ `PhotoCollection` ซึ่งเป็น[วัตถุที่สังเกตเห็นได้](glossary://observable%20object) นั่นหมายความว่าคุณสามารถตอบรับกับการเปลี่ยนแปลงในแอสเซทรูปภาพได้ เช่น เมื่อมีการเพิ่มหรือลบรูปภาพ
tr: `photoAssets`'in [gözlemlenebilir nesne](glossary://observable%20object) olan `PhotoCollection`’ın [yayımlanan](glossary://published%20value) özelliği olduğunu fark edeceksin. Bu, örneğin fotoğraf eklendiğinde veya silindiğinde, fotoğraf öğelerindeki değişikliklere yanıt verebileceğin anlamına gelir.
vi: Bạn sẽ nhận thấy rằng `photoAssets` là một thuộc tính [đã đăng](glossary://published%20value) của `PhotoCollection`, là một [đối tượng có thể quan sát](glossary://observable%20object). Điều này nghĩa là bạn có thể phản hồi các thay đổi trong tài sản ảnh, ví dụ như khi ảnh được thêm hoặc xóa.
zh_cn: 你会注意到，`photoAssets` 是 `PhotoCollection` 的[已发布](glossary://published%20value)属性，而 `PhotoCollection` 是一个[可观测对象](glossary://observable%20object)。这意味着你可以响应照片资源中的更改，如添加或删除照片。
zh_tw: 你會注意到 `photoAssets` 是 `PhotoCollection` 的一個[發佈](glossary://published%20value)屬性，它是一個[可觀察的物件](glossary://observable%20object)。這表示你可以回應照片內容中的更動，例如加入或刪除照片的時間。

source: Navigating to the Photo Gallery
de: Zur Fotogalerie navigieren
es: Navegar hasta la galería de fotos
es_419: Navegar a la galería de fotos
fr: Accéder à la galerie de photos
it: Andare alla galleria fotografica
ja: フォトギャラリーに移動する
ko: 사진 갤러리로 이동하기
nl: Naar de fotogalerie navigeren
no: Navigere til bildegalleriet
pt: Navegando para a Galeria de Fotos
sv: Navigera till bildgalleriet
th: การนำทางไปยังแกลเลอรี่รูปภาพ
tr: Fotoğraf Galerisi’ne Gitme
vi: Điều hướng đến phòng trưng bày ảnh
zh_cn: 导航到照片画廊
zh_tw: 導覽至照片圖庫

source: Find out how to navigate to the photo gallery and connect it to your photo library.
de: Finde heraus, wie du zur Fotogalerie navigierst und sie mit deiner Fotomediathek verbindest.
es: Descubre cómo navegar hasta la galería de fotos y conéctala a tu fototeca.
es_419: Descubre cómo navegar a la galería de fotos, y conectarla a tu fototeca.
fr: Découvre comment accéder à la galerie de photos et la connecter à ta photothèque.
it: Scopri come accedere alla galleria fotografica e connetterla alla tua libreria di foto.
ja: フォトギャラリーに移動する方法、およびフォトギャラリーをフォトライブラリに接続する方法を理解しましょう。
ko: 사진 갤러리로 이동하는 방법을 알아보고 사진 보관함과 갤러리를 연결하세요.
nl: Ontdek hoe je naar de fotogalerie navigeert en hoe je deze aan je fotobibliotheek koppelt.
no: Finn ut hvordan du navigerer til bildegalleriet og kobler det til bildebiblioteket.
pt: Descubra como navegar para a galeria de fotos e conectá‑la à fototeca.
sv: Ta reda på hur du navigerar till bildgalleriet och anslut det till bildbiblioteket.
th: ดูวิธีนำทางไปยังแกลเลอรี่รูปภาพและเชื่อมต่อกับคลังรูปภาพของคุณ
tr: Fotoğraf galerisine nasıl gideceğini ve onu fotoğraf arşivine bağlayacağını öğren.
vi: Tìm hiểu cách điều hướng đến phòng trưng bày ảnh và kết nối với thư viện ảnh của bạn.
zh_cn: 探索如何导航到照片画廊，以及如何将它连接到照片图库。
zh_tw: 瞭解如何導覽至照片圖庫並將它連接到照片圖庫。

source: In your camera view, use a [navigation link](glossary://navigation%20link) to take you to your photo gallery.
de: Verwende in der Kameraansicht einen [Navigations-Link](glossary://navigation%20link), um zu deiner Fotogalerie zu gelangen.
es: En la vista de cámara, usa un [enlace de navegación](glossary://navigation%20link) para que te lleve a tu galería de fotos.
es_419: En tu visualización de cámara, usa un [enlace de navegación](glossary://navigation%20link) para ir a la galería de fotos.
fr: Dans la vue de ton appareil photo, utilise un [lien de navigation](glossary://navigation%20link) pour te rendre dans ta galerie de photos.
it: Nella tua vista Fotocamera, utilizza un [link di navigazione](glossary://navigation%20link) per accedere alla galleria fotografica.
ja: フォトギャラリーに移動するには、カメラビューで[ナビゲーションリンク](glossary://navigation%20link)を使います。
ko: 카메라 보기에서 [탐색 링크](glossary://navigation%20link)를 사용해 사진 갤러리로 이동합니다.
nl: Gebruik in de cameraweergave een [navigatielink](glossary://navigation%20link) om naar de fotogalerie te gaan.
no: Bruk en [navigeringslenke](glossary://navigation%20link) i kameravisningen for å ta deg til bildegalleriet.
pt: Na visualização da câmera, use um [link de navegação](glossary://navigation%20link) para levar você à galeria de fotos.
sv: I kameravyn använder du en [navigeringslänk](glossary://navigation%20link) för att ta dig till bildgalleriet.
th: ในมุมมองกล้องของคุณ ให้ใช้[ลิงก์การนำทาง](glossary://navigation%20link)เพื่อนำคุณไปยังแกลเลอรี่รูปภาพของคุณ
tr: Kamera görüntünde, fotoğraf galerine gitmek için bir [dolaşma bağlantısı](glossary://navigation%20link) kullan.
vi: Trong chế độ xem camera của bạn, sử dụng một [liên kết điều hướng](glossary://navigation%20link) để đưa bạn tới phòng trưng bày ảnh của mình.
zh_cn: 在相机视图中，使用[导航链接](glossary://navigation%20link)前往照片画廊。
zh_tw: 在相機顯示區中使用 [navigation link](glossary://navigation%20link) 來帶領你前往照片圖庫。

source: A navigation link is just like a button — you can even give it a label and an icon. You place this button to the left of the shutter button.
de: Ein Navigations-Link ist wie eine Taste – du kannst ihm sogar ein Etikett und Symbol geben. Die Taste platzierst du links neben die Taste für den Auslöser.
es: Un enlace de navegación es solo un botón, incluso puedes darle una etiqueta y un icono. Coloca este botón a la izquierda del botón del obturador.
es_419: Un enlace de navegación es como un botón, incluso puedes darle una etiqueta y un ícono. Coloca este botón a la izquierda del botón de obturador.
fr: Un lien de navigation consiste simplement en un bouton. Tu peux même lui attribuer une étiquette et une icône. Tu places ce bouton à gauche du bouton d’obturateur.
it: Il link di navigazione è simile a un pulsante, puoi anche assegnargli un’etichetta e un’icona. Puoi posizionarlo a sinistra del pulsante di scatto.
ja: ナビゲーションリンクはボタンのようなものです。ラベルやアイコンを付けることもできます。シャッターボタンの左側にこのボタンを配置しましょう。
ko: 탐색 링크는 버튼과 마찬가지라서 레이블과 아이콘도 부여할 수 있습니다. 이 버튼을 셔터 버튼 왼쪽에 배치합니다.
nl: Een navigatielink werkt net als een knop. Je kunt er zelfs een label en een symbool aan toekennen. Je plaatst deze knop links van de sluiterknop.
no: En navigeringslenke er akkurat som en knapp, og du kan til og med gi den en etikett og et symbol. Plasser denne knappen til venstre for utløserknappen.
pt: Um link de navegação é como um botão — você pode até mesmo atribuir uma etiqueta e um ícone a ele. Posicione esse botão à esquerda do botão obturador.
sv: En navigeringslänk är precis som en knapp, och du kan till och med ge den ett namn och en symbol. Du placerar den här knappen till vänster om slutarknappen.
th: ลิงก์การนำทางก็เหมือนกับปุ่ม ซึ่งคุณสามารถกำหนดป้ายและไอคอนให้กับลิงก์ได้ ให้คุณวางปุ่มนี้ไว้ทางด้านซ้ายของปุ่มชัตเตอร์
tr: Dolaşma bağlantısı tıpkı bir düğme gibidir, hatta ona bir etiket ve simge verebilirsin. Bu düğmeyi deklanşör düğmesinin soluna yerleştirebilirsin.
vi: Liên kết điều hướng chính xác là giống như một nút — bạn thậm chí có thể cung cấp nhãn và biểu tượng. Bạn đặt nút này ở bên trái của nút chụp.
zh_cn: 导航链接就像按钮一样，你甚至可以为它添加标签和图标。将这个按钮放在快门按钮的左侧。
zh_tw: 導覽連結就像一個按鈕，你甚至可以給它一個標籤和圖像。你要將此按鈕放在快門按鈕的左側。

source: When you tap or click a navigation link, SwiftUI takes you to another view — in this case, the photo collection view — that you use to display your photo gallery.
de: Wenn du auf einen Navigations-Link tippst oder klickst, führt dich SwiftUI zu einer anderen Ansicht. In diesem Fall ist das die Ansicht der Fotosammlung, die du zum Anzeigen deiner Fotogalerie verwendest.
es: Al tocar o hacer clic en un enlace de navegación, SwiftUI te lleva a otra vista (en este caso, la vista de la colección de fotos) que usas para mostrar tu galería de fotos.
es_419: Cuando tocas o haces clic en un enlace de navegación, SwiftUI te lleva a otra visualización para mostrar tu galería de fotos, en este caso te lleva a la visualización de la colección de fotos.
fr: Quand tu touches un lien de navigation ou que tu cliques dessus, SwiftUI te dirige vers une autre vue. Dans ce cas, la vue de la collection de photos que tu utilises pour afficher ta galerie de photos.
it: Quando selezioni un link di navigazione, SwiftUI apre un’altra vista, in questo caso, la vista della raccolta di foto che utilizzi per visualizzare la tua galleria fotografica.
ja: ナビゲーションリンクをタップまたはクリックすると、別のビューに移動できます。この場合は、フォトギャラリーを表示するために使用するフォトコレクションのビューに移動します。
ko: 탐색 링크를 탭 또는 클릭하면 SwiftUI를 통해 다른 보기로 이동합니다. 이 경우에는 사진 갤러리를 표시하는 데 사용하는 사진 모음 보기로 이동합니다.
nl: Wanneer je op een navigatielink tikt of klikt, opent SwiftUI een andere weergave. In dit geval is het de weergave met de fotoverzameling die je gebruikt om in je fotogalerie weer te geven.
no: Når du trykker eller klikker på en navigeringslenke, tar SwiftUI deg til en annen visning – i dette tilfellet bildesamlingsvisningen – som du bruker til å vise bildegalleriet.
pt: Quando você toca ou clica em um link de navegação, a SwiftUI leva você para outra visualização (neste caso, a visualização de coleção de fotos) que você usa para mostrar a galeria de fotos.
sv: När du trycker eller klickar på en navigeringslänk tar SwiftUI dig till en annan vy –i det här fallet bildsamlingsvyn – som du använder till att visa bildgalleriet.
th: เมื่อคุณแตะหรือคลิกลิงก์การนำทาง SwiftUI จะนำคุณไปยังมุมมองอื่น ในกรณีนี้คือมุมมองคอลเลกชั่นรูปภาพที่คุณใช้เพื่อแสดงแกลเลอรี่รูปภาพของคุณ
tr: Bir dolaşma bağlantısına dokunduğunda veya tıkladığında SwiftUI, seni fotoğraf galerini göstermek için kullandığın başka bir görüntüye götürür (bu durumda fotoğraf koleksiyonu görüntüsü).
vi: Khi bạn chạm hoặc bấm vào liên kết điều hướng, SwiftUI đưa bạn đến một chế độ xem khác — trong trường hợp này là chế độ xem bộ sưu tập ảnh — mà bạn sử dụng để hiển thị phòng trưng bày ảnh của mình.
zh_cn: 轻点或点按导航链接时，SwiftUI 会为你导航至另一个视图，在本例中是用于显示照片画廊的照片集视图。
zh_tw: 當你點按導覽連結時，SwiftUI 會帶你前往其他顯示區；在此例子中，是前往你用來展示照片圖庫的照片集顯示區。

source: If you use navigation links within a [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), SwiftUI manages the presentation of your views so you can easily navigate between them.
de: Wenn du in [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) Navigations-Links verwendest, verwaltet SwiftUI die Anzeige deiner Ansichten, damit du einfach zwischen ihnen navigieren kannst.
es: Si usas enlaces de navegación dentro de una pila de navegación [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), SwiftUI gestiona la presentación de tus vistas para que puedas navegar fácilmente entre ellas.
es_419: Si usas enlaces de navegación dentro de una pila de navegación ([NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)), SwiftUI administra la presentación de tus visualizaciones para que puedas navegar fácilmente entre ellas.
fr: Si tu utilises des liens de navigation dans une vue [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), SwiftUI gère la présentation de tes vues pour que tu puisses les parcourir simplement.
it: Se utilizzi i link di navigazione all’interno di una struttura [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), SwiftUI gestisce il modo in cui le viste si presentano, per facilitare la navigazione tra di loro.
ja: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)内でナビゲーションリンクを使うと、SwiftUIによってビューの表示が管理されるため、リンク間を簡単に移動できます。
ko: [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) 내의 탐색 링크를 사용하면 SwiftUI는 보기 표시를 관리하여 사용자가 여러 보기를 손쉽게 탐색할 수 있도록 합니다.
nl: Als je navigatielinks in een [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) gebruikt, beheert SwiftUI de presentatie van je weergaven, zodat je makkelijk van de ene naar de andere weergave kunt navigeren.
no: Hvis du bruker navigeringslenker inni en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), håndterer SwiftUI presentasjonen av visningene, slik at du enkelt kan navigere mellom dem.
pt: Se você usar links de navegação dentro de um [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), a SwiftUI gerenciará a apresentação das visualizações para que você possa navegar facilmente entre elas.
sv: Om du använder navigeringslänkar inuti en [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) hanterar SwiftUI presentationen av vyerna så att du enkelt kan navigera mellan dem.
th: ถ้าคุณใช้ลิงก์การนำทางภายใน [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) SwiftUI จะจัดการการนำเสนอมุมมองของคุณเพื่อให้คุณสามารถนำทางไปมาระหว่างมุมมองต่างๆ ได้อย่างง่ายดาย
tr: Bir [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) içinde dolaşma bağlantılarını kullanırsan SwiftUI, görüntülerinin gösterimini bunlar arasında kolayca dolaşabileceğin şekilde yönetir.
vi: Nếu bạn sử dụng liên kết điều hướng bên trong [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack), SwiftUI quản lý cách trình bày các chế độ xem sao cho bạn có thể dễ dàng điều hướng giữa chúng.
zh_cn: 如果在 [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack)（导航叠放）内使用导航链接，SwiftUI 会管理各视图的显示，让你轻松在其间导航。
zh_tw: 如果你在 [NavigationStack](doc://com.apple.documentation/documentation/swiftui/navigationstack) 中使用導覽連結，SwiftUI 會管理顯示區的呈現，以便你可以輕鬆地在它們之間導覽。

source: By passing your model’s `photoCollection` to the `PhotoCollectionView` when you initialize it, you provide the collection of photos that you want to display in your gallery.
de: Du stellst die Fotosammlung, die du in der Galerie anzeigen möchtest, bereit, indem du `photoCollection` des Modells an `PhotoCollectionView` übergibst, wenn du sie initialisierst.
es: Al pasar la colección de fotos (`photoCollection`) de tu modelo a la vista de la colección de fotos (`PhotoCollectionView`) al inicializarlo, proporcionas la colección de fotos que quieres mostrar en tu galería.
es_419: Al pasar la visualización `"photoCollection"` de tu modelo a la visualización `"PhotoCollectionView"` cuando la inicializas, proporcionas la colección de fotos que quieres mostrar en tu galería.
fr: En transmettant la `photoCollection` de ton modèle à la vue `PhotoCollectionView` en l’initialisant, tu fournis la collection de photos que tu veux afficher dans ta galerie.
it: Trasmettendo `photoCollection` del tuo modello di dati a `PhotoCollectionView` quando esegui l’inizializzazione, fornisci la raccolta di foto che vuoi visualizzare nella tua galleria.
ja: `PhotoCollectionView`（フォトコレクションビュー）を初期化するときにモデルの`photoCollection`（フォトコレクション）を渡すことによって、ギャラリーに表示したい写真のコレクションが用意されます。
ko: 모델을 초기화할 때 모델의 `photoCollection`을 `PhotoCollectionView`로 전달하여 갤러리에 표시하려는 사진 모음을 제공합니다.
nl: Door de `photoCollection` van je model aan de `PhotoCollectionView` door te geven tijdens de initialisatie, geef je de verzameling met foto's op die je in de galerie wilt weergeven.
no: Ved å overføre modellens `photoCollection` til `PhotoCollectionView` når du initierer den, angir du bildesamlingen du vil vise i galleriet.
pt: Ao passar a `photoCollection` do seu modelo para a `PhotoCollectionView` quando inicializá-la, você fornece a coleção de fotos que você deseja mostrar na sua galeria.
sv: Genom att överföra modellens `photoCollection` till vyn `PhotoCollectionView` när du initierar den kan du tillhandahålla samlingen med bilder som du vill visa i galleriet.
th: ให้คุณระบุคอลเลกชั่นรูปภาพที่คุณต้องการแสดงในแกลเลอรี่ของคุณ โดยการส่งผ่าน `photoCollection` ของโมเดลของคุณไปยัง `PhotoCollectionView` เมื่อคุณสร้างค่าเริ่มต้นของคอลเลกชั่นรูปภาพ
tr: Modelinin `photoCollection`’ını ilk değer atarken `PhotoCollectionView`’a geçirerek galerinde görüntülemek istediğin fotoğraf koleksiyonunu sağlarsın.
vi: Bằng việc chuyển `photoCollection` của mô hình vào `PhotoCollectionView` khi bạn khởi tạo, bạn cung cấp bộ sưu tập ảnh mà bạn muốn hiển thị trong phòng trưng bày của mình.
zh_cn: 初始化 `PhotoCollectionView`（照片集视图）时，通过将模型的 `photoCollection` 传递到 `PhotoCollectionView`，你可以提供想要在画廊中显示的照片集。
zh_tw: 藉由在初始化時將模型的 `photoCollection` 傳送給 `PhotoCollectionView`，你可以提供要顯示在圖庫中的照片集。

source: When you open the gallery, you’ll no longer see the viewfinder, so there’s no need to keep updating it. Instead, you’d rather concentrate the device’s performance on displaying your photos.
de: Wenn du die Galerie öffnest, wird der Sucher nicht mehr angezeigt. Du musst ihn also nicht mehr aktualisieren. Nutze die Leistung des Geräts stattdessen lieber für die Darstellung der Fotos.
es: Cuando abras la galería, ya no verás el visor, por lo que no es necesario que lo actualices. En su lugar, es mejor que concentres el rendimiento del dispositivo en la visualización de tus fotos.
es_419: Cuando abres la galería, ya no se ve el visor, de modo que no necesitas seguir actualizándolo. Es mejor enfocar el rendimiento del dispositivo en mostrar tus fotos.
fr: Lorsque tu ouvres la galerie, tu ne peux plus voir le viseur, tu n’as donc pas besoin de le mettre à jour. Tu devrais plutôt concentrer les performances de l’appareil sur l’affichage de tes photos.
it: Dopo aver aperto la galleria, non vedrai più il mirino, quindi non dovrai più aggiornarlo continuamente. Concentrati sulle prestazioni del dispositivo quando vengono visualizzate le foto.
ja: ギャラリーを開くとファインダーは表示されなくなるので、ファインダーのアップデートを続ける必要はありません。代わりに、デバイスのパフォーマンスを写真の表示に集中させます。
ko: 갤러리를 열면 뷰파인더가 더 이상 보이지 않으므로 계속 업데이트할 필요가 없습니다. 오히려 사진을 표시하는 기기 성능에 집중하는 것이 좋습니다.
nl: Wanneer je de galerie opent, is de zoeker niet meer zichtbaar. Je hoeft deze dus niet meer bij te werken. In plaats daarvan kun je de beschikbare bronnen van je apparaat beter gebruiken om je foto's weer te geven.
no: Når du åpner galleriet, ser du ikke lenger søkeren, og derfor trenger du ikke å oppdatere den. I stedet bør du fokusere på enhetens ytelse når bildene vises.
pt: Ao abrir a galeria, você não verá mais o visor, portanto, não há necessidade de continuar atualizando‑o. Em vez disso, você pode se concentrar no desempenho do dispositivo para exibir as fotos.
sv: När du öppnar galleriet ser du inte längre sökaren, så du behöver inte uppdatera den. Istället bör du fokusera på enhetens prestanda vid visning av bilderna.
th: เมื่อคุณเปิดแกลเลอรี่ คุณจะไม่เห็นช่องมองภาพอีกต่อไป ดังนั้นจึงไม่จำเป็นต้องอัปเดตช่องมองภาพต่อ คุณควรเน้นที่ประสิทธิภาพของอุปกรณ์ในการแสดงรูปภาพของคุณแทน
tr: Galeriyi açtığında artık vizörü görmezsin, bu nedenle güncellemeyi sürdürmeye gerek yok. Bunun yerine, aygıtın fotoğraflarını görüntüleme performansına yoğunlaşabilirsin.
vi: Khi mở phòng trưng bày, bạn sẽ không nhìn thấy kính ngắm nữa, do đó bạn không cần tiếp tục cập nhật. Thay vào đó, bạn nên tập trung vào hiệu năng của thiết bị trong việc hiển thị các ảnh của mình.
zh_cn: 打开画廊时，你将不会再看到取景器，因此没有必要继续对它进行更新。你更应该将设备的性能集中用于显示照片。
zh_tw: 當你打開圖庫時，不會再看到觀景窗，因此不需要繼續更新觀景窗。相反地，你寧可將裝置的效能集中在顯示照片上。
