Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: a low-resolution image thumbnail as an [Image](doc://com.apple.documentation/documentation/swiftui/image)
de: ein Miniaturbild in geringer Auflösung als [Bild](doc://com.apple.documentation/documentation/swiftui/image)
es: una imagen en miniatura de baja resolución como [imagen](doc://com.apple.documentation/documentation/swiftui/image)
es_419: una miniatura de imagen de baja resolución en una [Image](doc://com.apple.documentation/documentation/swiftui/image)
fr: une vignette d’image en faible résolution sous forme d’[image](doc://com.apple.documentation/documentation/swiftui/image)
it: una miniatura a bassa risoluzione sotto forma di un’[immagine](doc://com.apple.documentation/documentation/swiftui/image)
ja: [Image](doc://com.apple.documentation/documentation/swiftui/image)（イメージ）としての低解像度イメージのサムネール
ko: [Image](doc://com.apple.documentation/documentation/swiftui/image)로서의 저해상도 이미지 축소판
nl: een afbeeldingsminiatuur met een lage resolutie als een [Image](doc://com.apple.documentation/documentation/swiftui/image)
no: et lavoppløst miniatyrbilde som en [Image](doc://com.apple.documentation/documentation/swiftui/image)
pt: uma miniatura em baixa resolução da imagem como [Image](doc://com.apple.documentation/documentation/swiftui/image)
sv: En lågupplöst bildminiatyr som en [Image](doc://com.apple.documentation/documentation/swiftui/image).
th: รูปย่อภาพความละเอียดต่ำในรูปแบบ [Image](doc://com.apple.documentation/documentation/swiftui/image)
tr: [Görüntü](doc://com.apple.documentation/documentation/swiftui/image) olarak düşük çözünürlüklü bir görüntü küçük resmi
vi: một hình ảnh thu nhỏ có độ phân giải thấp dưới dạng một [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image)
zh_cn: 一张低分辨率的图像缩略图，作为 [Image](doc://com.apple.documentation/documentation/swiftui/image)
zh_tw: 低解析度影像縮覽圖作為[影像](doc://com.apple.documentation/documentation/swiftui/image)

source: the size of the image thumbnail
de: die Größe des Miniaturbilds
es: el tamaño de la imagen en miniatura
es_419: el tamaño de la miniatura de la imagen
fr: la taille de la vignette de l’image
it: le dimensioni della miniatura dell’immagine
ja: イメージサムネールのサイズ
ko: 이미지 축소판 크기
nl: de grootte van de afbeeldingsminiatuur
no: størrelsen på miniatyrbildet
pt: o tamanho da miniatura da imagem
sv: Storleken på bildminiatyren.
th: ขนาดของรูปย่อภาพ
tr: görüntü küçük resminin büyüklüğü
vi: kích cỡ của hình ảnh thu nhỏ
zh_cn: 图像缩略图的大小
zh_tw: 影像縮覽圖的大小

source: a high-resolution image as [Data](doc://com.apple.documentation/documentation/foundation/data)
de: ein Bild in hoher Auflösung als [Daten](doc://com.apple.documentation/documentation/foundation/data)
es: una imagen de alta resolución como [datos](doc://com.apple.documentation/documentation/foundation/data)
es_419: una imagen de alta definición en forma de [Data](doc://com.apple.documentation/documentation/foundation/data)
fr: une image en haute résolution sous forme de [données](doc://com.apple.documentation/documentation/foundation/data)
it: un’immagine ad alta risoluzione sotto forma di [dati](doc://com.apple.documentation/documentation/foundation/data)
ja: [Data](doc://com.apple.documentation/documentation/foundation/data)（データ）としての高解像度イメージ
ko: [Data](doc://com.apple.documentation/documentation/foundation/data)로서의 고해상도 이미지
nl: een afbeelding met een hoge resolutie als [Data](doc://com.apple.documentation/documentation/foundation/data)
no: et høyoppløst bilde som [Data](doc://com.apple.documentation/documentation/foundation/data)
pt: uma imagem em alta resolução como [Data](doc://com.apple.documentation/documentation/foundation/data)
sv: En högupplöst bild som [Data](doc://com.apple.documentation/documentation/foundation/data).
th: ภาพความละเอียดสูงในรูปแบบ[ข้อมูล](doc://com.apple.documentation/documentation/foundation/data)
tr: [Veri](doc://com.apple.documentation/documentation/foundation/data) olarak yüksek çözünürlüklü bir görüntü
vi: một hình ảnh có độ phân giải cao dưới dạng [Dữ liệu](doc://com.apple.documentation/documentation/foundation/data)
zh_cn: 一张高分辨率的图像，作为 [Data](doc://com.apple.documentation/documentation/foundation/data)
zh_tw: 高解析度影像作為[資料](doc://com.apple.documentation/documentation/foundation/data)

source: the size of the high-resolution image
de: die Größe des hochaufgelösten Bilds
es: el tamaño de la imagen de alta resolución
es_419: el tamaño de la imagen de alta resolución
fr: la taille de l’image en haute résolution
it: le dimensioni dell’immagine ad alta risoluzione
ja: 高解像度イメージのサイズ
ko: 고해상도 이미지 크기
nl: de grootte van de afbeelding met een hoge resolutie
no: størrelsen på det høyoppløste bildet
pt: o tamanho da imagem em alta resolução
sv: Storleken på den högupplösta bilden.
th: ขนาดของภาพความละอียดสูง
tr: yüksek çözünürlüklü görüntünün büyüklüğü
vi: kích cỡ của hình ảnh có độ phân giải cao
zh_cn: 高分辨率图像的大小
zh_tw: 高解析度影像的大小

source: You’ll recall that, as an [asynchronous stream](glossary://asynchronous%20stream), `photoStream` is very much like a [Sequence](doc://com.apple.documentation/documentation/swift/sequence).
de: Das dürftest du schon als [asynchronen Stream](glossary://asynchronous%20stream) kennen. `photoStream` ist so ähnlich wie eine [Sequenz](doc://com.apple.documentation/documentation/swift/sequence).
es: Recordarás que, como [secuencia asíncrona](glossary://asynchronous%20stream), `photoStream` es muy similar a una [secuencia](doc://com.apple.documentation/documentation/swift/sequence).
es_419: Como recordarás, `photoStream` es un [flujo asincrónico](glossary://asynchronous%20stream) muy parecido a una [secuencia](doc://com.apple.documentation/documentation/swift/sequence).
fr: Tu te souviens certainement qu’en tant que [flux asynchrone](glossary://asynchronous%20stream), `photoStream` ressemble beaucoup à une [séquence](doc://com.apple.documentation/documentation/swift/sequence).
it: Questo verrà richiamato come [flusso asincrono](glossary://asynchronous%20stream); `photoStream` è davvero molto simile a una [sequenza](doc://com.apple.documentation/documentation/swift/sequence).
ja: 前にも[非同期ストリーム](glossary://asynchronous%20stream)として説明しましたが、`photoStream`（写真ストリーム）は、[Sequence](doc://com.apple.documentation/documentation/swift/sequence)（シーケンス）にとてもよく似ています。
ko: [비동기 스트림](glossary://asynchronous%20stream)으로서 `photoStream`은 [Sequence](doc://com.apple.documentation/documentation/swift/sequence)와 매우 유사함을 기억하실 겁니다.
nl: Zoals je weet, is `photoStream` een [asynchrone stroom](glossary://asynchronous%20stream) en lijkt daarom erg op een [reeks](doc://com.apple.documentation/documentation/swift/sequence).
no: Som du husker er en [asynkron strøm](glossary://asynchronous%20stream) som `photoStream` veldig lik en [Sequence](doc://com.apple.documentation/documentation/swift/sequence).
pt: Lembre-se que, assim como um [fluxo assíncrono](glossary://asynchronous%20stream), `photoStream` se parece muito com uma [Sequence](doc://com.apple.documentation/documentation/swift/sequence).
sv: Som du nog kommer ihåg är en [asynkron ström](glossary://asynchronous%20stream), som `photoStream`, väldigt lik en [sekvens](doc://com.apple.documentation/documentation/swift/sequence).
th: คุณจะจำได้ว่า `photoStream` ในรูปแบบ[สตรีมแบบอะซิงโครนัส](glossary://asynchronous%20stream) เหมือนกับ[ลำดับ](doc://com.apple.documentation/documentation/swift/sequence)เป็นอย่างมาก
tr: [Eşzamansız yayın](glossary://asynchronous%20stream) olarak `photoStream`'in bir [Diziliş](doc://com.apple.documentation/documentation/swift/sequence) öğesine çok benzediğini anımsayacaksın.
vi: Bạn sẽ nhớ lại rằng, một [luồng không đồng bộ](glossary://asynchronous%20stream), `photoStream` rất giống với một [Trình tự](doc://com.apple.documentation/documentation/swift/sequence).
zh_cn: 你会回想起，`photoStream` 作为一个[异步流](glossary://asynchronous%20stream)，与 [Sequence](doc://com.apple.documentation/documentation/swift/sequence)（序列）非常相似。
zh_tw: 你會記得作為一個[非同步串流](glossary://asynchronous%20stream)，`photoStream` 非常像一個[序列](doc://com.apple.documentation/documentation/swift/sequence)。

source: You can use its [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) method to call `unpackPhoto(_:)` for each photo (`$0`) in the stream. This transforms the stream of [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) instances into a much more useful stream of `PhotoData` instances.
de: Du kannst die Methode [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) verwenden, um `unpackPhoto(_:)` für jedes Foto (`$0`) im Stream aufzurufen. Dadurch wird der Stream mit [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-Instanzen in einen nützlicheren Stream mit `PhotoData`-Instanzen verwandelt.
es: Puedes usar su método [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) para llamar a `unpackPhoto(_:)` para cada foto (`$0`) de la secuencia. Esto transforma la secuencia de instancias de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) en una secuencia de instancias de `PhotoData` mucho más útil.
es_419: Puedes usar su método [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) para llamar a la función `"unpackPhoto(_:)"` para cada foto (`"$0"`) en el flujo. Esto transforma el flujo de instancias de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) en un flujo mucho más útil de instancias de `"PhotoData"`.
fr: Tu peux utiliser sa méthode [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) pour appeler `unpackPhoto(_:)` pour chaque photo (`$0`) dans le flux. Ceci transforme le flux des instances [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) en flux d’instances `PhotoData`, bien plus utiles.
it: Puoi utilizzare il relativo metodo [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) per richiamare `unpackPhoto(_:)` per ciascuna foto (`$0`) inclusa nel flusso. Il metodo è in grado di trasformare il flusso di istanze di [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) in un flusso di istanze di `PhotoData`, che risulta molto più utile.
ja: [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap)メソッドを使って、ストリーム内のそれぞれの写真（`$0`）ごとに`unpackPhoto(_:)`（写真を展開）を呼び出すことができます。これにより、[AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)インスタンスのストリームが、さらに便利な`PhotoData`（写真データ）インスタンスのストリームに変換されます。
ko: [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) 메소드를 사용해 스트림에 있는 각각의 사진(`$0`)을 대상으로 `unpackPhoto(_:)`를 호출할 수 있습니다. 이렇게 하면 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 인스턴스의 스트림이 `PhotoData` 인스턴스의 스트림으로 훨씬 더 유용하게 변환됩니다.
nl: Je kunt de methode [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) van `photoStream` gebruiken om `unpackPhoto(_:)` aan te roepen voor elke (`$0`) in de stream. Hiermee transformeer je de stream met [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-instanties in een veel nuttigere stream met `PhotoData`-instanties.
no: Du kan bruke [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap)-metoden til å kalle `unpackPhoto(_:)` for hvert bilde (`$0`) i strømmen. Dette konverterer strømmen med [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-instanser til en mye mer nyttig strøm med `PhotoData`-instanser.
pt: Você pode usar o método [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) para chamar `unpackPhoto(_:)` para cada foto (`$0`) no fluxo. Isso transforma o fluxo de instâncias [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) em um fluxo muito mais útil de instâncias `PhotoData`.
sv: Du kan använda dess [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap)-metod till att anropa `unpackPhoto(_:)` för varje bild (`$0`) i strömmen. Det omvandlar strömmen med [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)-instanser till en mycket mer användbar ström med `PhotoData`-instanser.
th: คุณสามารถใช้วิธีการ [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) เพื่อเรียกใช้ `unpackPhoto(_:)` สำหรับรูปภาพแต่ละรูป (`$0`) ในสตรีมได้ การทำงานนี้จะแปลงสตรีมของชื่อแทนประเภท [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) เป็นสตรีมของชื่อแทนประเภท `PhotoData` ที่มีประโยชน์กว่ามาก
tr: Akıştaki her fotoğraf (`$0`) için `unpackPhoto(_:)`’yu çağırarak [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) metodunu kullanabilirsin. Bu, [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) örneklerinin akışını çok daha yararlı bir `PhotoData` örnekleri akışına dönüştürür.
vi: Bạn có thể sử dụng phương thức [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) để gọi `unpackPhoto(_:)` cho từng ảnh (`$0`) trong luồng. Việc này biến đổi luồng gồm các thể hiện [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) thành một luồng gồm các thể hiện `PhotoData` hữu ích hơn rất nhiều.
zh_cn: 你可以使用它的 [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap)（精简映射）方法，来为流中的每张照片 (`$0`) 调用 `unpackPhoto(_:)`。这个操作会将 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 实例流转换为更加有用的 `PhotoData` 实例流。
zh_tw: 你可以使用它的 [compactMap(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814567-compactmap) 方法為串流中的每張照片呼叫 `unpackPhoto(_:)` (`$0`)。這會將 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 實例串流轉換為更有用的 `PhotoData` 實例串流。

source: The `for`-`await` loop now waits for a `photoData` element to arrive in your unpacked stream before processing it.
de: Deine Schleife `for`-`await` (erwartend) wartet nun geduldig darauf, dass ein `photoData`-Element in deinem entpackten Stream eintrifft, bevor es verarbeitet wird.
es: El bucle `for`-`await` ahora espera a que llegue un elemento `fotoData` a su secuencia desempaquetada antes de procesarlo.
es_419: El ciclo `for`-`await` ahora espera a que un elemento `photoData` llegue en tu flujo desempacado antes de procesarlo.
fr: La boucle `for`-`await` attend maintenant qu’un élément `photoData` arrive dans ton flux décompressé, pour ensuite le traiter.
it: Il ciclo `for`-`await` adesso attenderà l’arrivo di un elemento `photoData` nel flusso decompresso prima di elaborarlo.
ja: 次に、`for`-`await`ループで、`photoData`（写真データ）要素が展開後のストリームで到着するまで待ってから、それを処理します。
ko: 이제 `for`-`await` 루프는 압축 해제된 스트림에 `photoData` 요소가 도달할 때까지 기다린 후, `photoData` 요소를 처리합니다.
nl: De `for`-`await`-lus wacht nu op een `photoData`-element dat in je uitgepakte stream aankomt, en verwerkt het vervolgens.
no: Nå venter `for`-`await`-løkken på at et `photoData`-element skal komme i den utpakkede strømmen før det behandles.
pt: Agora, o loop `for`-`await` está esperando que um elemento `photoData` chegue ao fluxo desempacotado antes de processá-lo.
sv: `for`-`await`-loopen väntar nu på att ett `photoData`-element ska anlända i den opackade strömmen innan det bearbetas.
th: ตอนนี้ `for`-`await` loop จะรอให้องค์ประกอบ `photoData` มาถึงในสตรีมที่ถอดแพ็คเกจแล้วของคุณก่อนที่จะประมวลผล
tr: `for`-`await` döngüsü artık bir `photoData` öğesini işlemeden önce öğenin açılmış yayına ulaşmasını bekler.
vi: Vòng lặp `for`-`await` bây giờ đợi một phần tử `photoData` xuất hiện trong luồng đã giải nén của bạn trước khi xử lý.
zh_cn: `for`-`await` 循环现在会等待已拆包流中的 `photoData` 元素到达，然后才对它进行处理。
zh_tw: `for`-`await` 迴圈現正等待一個 `photoData` 元件來到你解開的串流，然後進行處理。

source: You use the thumbnail image in `photoData` to update your model’s `thumbnailImage` property.
de: Du verwendest das Miniaturbild in `photoData`, um die Eigenschaft `thumbnailImage` (Miniaturbild) deines Modells zu aktualisieren.
es: Se utiliza la imagen en miniatura de `photoData` para actualizar la propiedad `thumbnailImage` de tu modelo.
es_419: Usa la imagen de miniatura en el flujo `photoData` para actualizar la propiedad `thumbnailImage` de tu modelo.
fr: Tu utilises l’image de vignette dans `photoData` pour mettre à jour la propriété `thumbnailImage` de ton modèle.
it: Utilizza la miniatura dell’immagine in `photoData` per aggiornare la proprietà `thumbnailImage` del tuo modello.
ja: `photoData`（写真データ）のサムネールイメージを使って、モデルの`thumbnailImage`（サムネールイメージ）プロパティをアップデートします。
ko: `photoData`의 축소판 이미지를 사용해 모델의 `thumbnailImage` 속성을 업데이트하세요.
nl: Je gebruikt de miniatuurafbeelding in `photoData` om de `thumbnailImage`-eigenschap van je model bij te werken.
no: Du bruker miniatyrbildet i `photoData` til å oppdatere modellens `thumbnailImage`-egenskap.
pt: Use a imagem de miniatura em `photoData` para atualizar a propriedade `thumbnailImage` do seu modelo.
sv: Du använder miniatyrbilden i `photoData` till att uppdatera modellens `thumbnailImage`-egenskap.
th: คุณจะใช้ภาพรูปย่อใน `photoData` เพื่ออัปเดตคุณสมบัติ `thumbnailImage` ของโมเดลของคุณ
tr: Modelinin `thumbnailImage` özelliğini güncellemek için `photoData`’daki küçük resim görüntüsünü kullanırsın.
vi: Bạn sử dụng hình ảnh thu nhỏ trong `photoData` để cập nhật thuộc tính `thumbnailImage` của mô hình.
zh_cn: 使用 `photoData` 中的缩略图图像更新模型的 `thumbnailImage`（缩略图图像）属性。
zh_tw: 你會使用 `photoData` 中的縮覽圖影像來更新模型的 `thumbnailImage` 屬性。

source: Call your model’s `savePhoto(imageData:)` method to save the image data from `photoData` as a new photo in your photo library.
de: Rufe die Methode `savePhoto(imageData:)` (Foto sichern) des Modells auf, um die Bilddaten von `photoData` als neues Foto in deiner Fotomediathek zu sichern.
es: Llama al método `savePhoto(imageData:)` de tu modelo para guardar los datos de la imagen de `photoData` como una nueva foto en tu fototeca.
es_419: Llama al método `savePhoto(imageData:)` de tu modelo para que guarde los datos de `photoData` como una foto nueva en tu fototeca.
fr: Appelle la méthode `savePhoto(imageData:)` de ton modèle pour enregistrer les données d’image de `photoData` en tant que nouvelle photo dans ta photothèque.
it: Richiama il metodo `savePhoto(imageData:)` del modello per salvare i dati dell’immagine da `photoData` come una nuova foto nella tua libreria.
ja: モデルの`savePhoto(imageData:)`（写真を保存）メソッドを呼び出して、`photoData`（写真データ）のイメージデータをフォトライブラリ内の新しい写真として保存します。
ko: 모델의 `savePhoto(imageData:)` 메소드를 호출해 `photoData`의 이미지 데이터를 사진 보관함의 새로운 사진으로 저장합니다.
nl: Roep de `savePhoto(imageData:)`-methode van je model aan om de afbeeldingsgegevens uit `photoData` als een nieuwe foto in je fotobibliotheek te bewaren.
no: Kall modellens `savePhoto(imageData:)`-metode for å arkivere bildedataene fra `photoData` som et nytt bilde i bildebiblioteket.
pt: Chame o método `savePhoto(imageData:)` do modelo para salvar os dados da imagem de `photoData` como uma foto nova na fototeca.
sv: Anropa modellens `savePhoto(imageData:)`-metod för att spara bilddata från `photoData` som en ny bild i bildbiblioteket.
th: เรียกใช้วิธีการ `savePhoto(imageData:)` ของโมเดลของคุณเพื่อบันทึกข้อมูลภาพจาก `photoData` เป็นรูปภาพใหม่ในคลังรูปภาพของคุณ
tr: `photoData`’daki görüntü verisini fotoğraf arşivine yeni bir fotoğraf olarak kaydetmek için modelinin `savePhoto(imageData:)` metodunu çağır.
vi: Gọi phương thức `savePhoto(imageData:)` của mô hình để lưu dữ liệu hình ảnh từ `photoData` dưới dạng một ảnh mới trong thư viện ảnh của bạn.
zh_cn: 调用模型的 `savePhoto(imageData:)` 方法，将来自 `photoData` 的图像数据存储为照片图库中的新照片。
zh_tw: 呼叫模型的 `savePhoto(imageData:)` 方法以儲存來自 `photoData` 的影像資料作為照片圖庫中的新照片。

source: The `savePhoto(imageData:)` method creates a [task](glossary://task) and passes on the real work of saving the photo data to the `photoCollection` object by calling its `addImage(_:)` method.
de: Die Methode `savePhoto(imageData:)` erstellt eine [Aufgabe](glossary://task) und übergibt die Arbeit, deine Fotodaten zu sichern, an das `photoCollection`-Objekt, indem es die Methode `addImage(_:)` (Bild hinzufügen) darin aufruft.
es: El método `savePhoto(imageData:)` crea una [tarea](glossary://task) y pasa el verdadero trabajo de guardar los datos de la foto al objeto `photoCollection`, llamando a su método `addImage(_:)`.
es_419: El método `savePhoto(imageData:)` crea una [tarea](glossary://task) y llama al método `addImage(_:)` para pasarle el trabajo real de guardar los datos de la foto en el objeto `photoCollection`.
fr: La méthode `savePhoto(imageData:)` crée seulement une [tâche](glossary://task) et transmet le vrai travail, l’enregistrement des données de la photo dans l’objet `photoCollection`, en appelant sa méthode `addImage(_:)`.
it: Il metodo `savePhoto(imageData:)` crea un’[attività](glossary://task) e successivamente trasferisce l’effettivo lavoro di salvare i dati della foto all’oggetto `photoCollection`, richiamando il relativo metodo `addImage(_:)`.
ja: `savePhoto(imageData:)`（写真を保存）メソッドは[タスク](glossary://task)の作成を行い、`addImage(_:)`（イメージを追加）メソッドを呼び出して、写真データを`photoCollection`（フォトコレクション）オブジェクトに保存するという実作業をまわします。
ko: `savePhoto(imageData:)` 메소드는 `addImage(_:)` 메소드를 호출해서 [작업](glossary://task)을 생성하고 `photoCollection` 객체에 사진 데이터를 저장하는 실제 작업에 들어갑니다.
nl: De `savePhoto(imageData:)`-methode maakt een [taak](glossary://task) aan en geeft het echte werk van het bewaren van de fotogegevens door aan het `photoCollection`-object door de `addImage(_:)`-methode ervan aan te roepen.
no: `savePhoto(imageData:)`-metoden oppretter en [oppgave](glossary://task) og overfører det virkelige arbeidet med å arkivere bildedataene til `photoCollection`-objektet ved å kalle dets `addImage(_:)`-metode.
pt: O método `savePhoto(imageData:)` cria uma [tarefa](glossary://task) e passa o trabalho de verdade de salvar os dados da foto para o objeto `photoCollection`, chamando o método `addImage(_:)`.
sv: `savePhoto(imageData:)`-metoden skapar endast en [åtgärd](glossary://task) och överför det verkliga arbetet med att spara bilddata i `photoCollection`-objektet genom att anropa dess `addImage(_:)`-metod.
th: วิธีการ `savePhoto(imageData:)` จะสร้าง[งาน](glossary://task)แล้วส่งต่องานจริงของการบันทึกข้อมูลรูปภาพไปยังวัตถุ `photoCollection` โดยเรียกใช้วิธีการ `addImage(_:)`
tr: `savePhoto(imageData:)` metodu bir [görev](glossary://task) yaratır ve asıl iş olan fotoğraf verilerini `photoCollection` nesnesine kaydetme işini `addImage(_:)` metodunu çağırarak ona iletir.
vi: Phương thức `savePhoto(imageData:)` tạo ra một [tác vụ](glossary://task) và chuyển sang công việc lưu dữ liệu ảnh thực sự vào đối tượng `photoCollection` bằng cách gọi phương thức `addImage(_:)`.
zh_cn: `savePhoto(imageData:)` 方法会创建一个[任务](glossary://task)，通过调用 `addImage(_:)`（添加图像）方法，把存储照片数据的实际工作传递给 `photoCollection`（照片集）对象。
zh_tw: `savePhoto(imageData:)` 方法會建立一個[任務](glossary://task)並透過呼叫它的 `addImage(_:)` 方法來將儲存照片資料的實際工作傳送給 `photoCollection` 物件。
