Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Learn how to process the preview stream so that it’s ready to display in the viewfinder.
de: Lerne, wie man den Vorschau-Stream verarbeitet, um ihn im Sucher anzuzeigen.
es: Aprende a procesar la secuencia de vista previa para que esté lista para mostrarse en el visor.
es_419: Descubre cómo procesar el flujo de vista previa para que esté listo para mostrarse en el visor.
fr: Découvre comment traiter le flux d’aperçu pour qu’il soit prêt à être affiché dans le viseur.
it: Scopri come elaborare il flusso di anteprime in modo che sia pronto per essere visualizzato nel mirino.
ja: プレビューストリームを処理して、ファインダーで表示できる状態にする方法を学びましょう。
ko: 뷰파인더에서 볼 수 있도록 미리보기 스트림을 처리하는 방법을 배워보세요.
nl: Leer hoe je de voorvertoningsstroom verwerkt zodat deze klaar is om te worden weergegeven in de zoeker.
no: Lær deg hvordan du behandler forhåndsvisningsstrømmen for å gjøre den klar til å vises i søkeren.
pt: Saiba como processar o fluxo de pré‑visualização para que ele esteja pronto para ser mostrado no visor.
sv: Lär dig hur du bearbetar förhandsvisningsströmmen så att den blir klar att visa i sökaren.
th: เรียนรู้วิธีประมวลผลสตรีมการแสดงตัวอย่างเพื่อให้พร้อมสำหรับแสดงผลในช่องมองภาพ
tr: Vizörde görüntülenmeye hazır olması için önizleme yayınını nasıl işleyeceğini öğren.
vi: Tìm hiểu cách xử lý luồng xem trước sao cho luồng đó sẵn sàng để hiển thị trong kính ngắm.
zh_cn: 了解如何处理预览流，让它准备好在取景器中显示。
zh_tw: 學習如何處理預覽串流，以便準備好在觀景窗中顯示。

source: Your [data model](glossary://data%20model) has a dedicated [task](glossary://task) to handle the [stream](glossary://asynchronous%20stream) of preview images from the camera, using its `handleCameraPreviews` function.
de: Dein [Datenmodell](glossary://data%20model) verfügt über eine eigens dafür bestimmte [Aufgabe](glossary://task), um auf den [Stream](glossary://asynchronous%20stream) aus Vorschaubildern der Kamera mit seiner Funktion `handleCameraPreviews` zu reagieren.
es: Tu [modelo de datos](glossary://data%20model) tiene una [tarea](glossary://task) dedicada para gestionar la [secuencia](glossary://asynchronous%20stream) de imágenes de previsualización de la cámara, mediante su función `handleCameraPreviews`.
es_419: Tu [modelo de datos](glossary://data%20model) tiene una [tarea](glossary://task) dedicada, llamada `"handleCameraPreviews"`, que administra el [flujo](glossary://asynchronous%20stream) de imágenes de vista previa generadas por la cámara.
fr: Ton [modèle de données](glossary://data%20model) possède une [tâche](glossary://task) dédiée pour gérer le [flux](glossary://asynchronous%20stream) d’images d’aperçu de l’appareil photo, à l’aide de sa fonction `handleCameraPreviews`.
it: Il tuo [modello di dati](glossary://data%20model) dispone di un’[attività](glossary://task) dedicata per gestire il [flusso](glossary://asynchronous%20stream) delle immagini di anteprima provenienti dalla fotocamera, utilizzando la funzione `handleCameraPreviews`.
ja: [データモデル](glossary://data%20model)には、カメラから送信されるプレビューイメージの[ストリーム](glossary://asynchronous%20stream)を`handleCameraPreviews`（カメラのプレビューを処理）関数を使って処理するための専用[タスク](glossary://task)があります。
ko: [데이터 모델](glossary://data%20model)에는 `handleCameraPreviews` 함수를 사용하여 카메라에서 미리보기 이미지의 [스트림](glossary://asynchronous%20stream)을 처리하는 전용 [작업](glossary://task)이 있습니다.
nl: Je [gegevensmodel](glossary://data%20model) heeft een speciale [taak](glossary://task) om de [stroom](glossary://asynchronous%20stream) met voorvertoningsbeelden van de camera te verwerken met de functie `handleCameraPreviews`.
no: [Datamodellen](glossary://data%20model) har en dedikert [oppgave](glossary://task) for å håndtere [strømmen](glossary://asynchronous%20stream) av forhåndsvisningsbilder fra kameraet ved hjelp av `handleCameraPreviews`-funksjonen.
pt: O seu [modelo de dados](glossary://data%20model) tem uma [tarefa](glossary://task) dedicada a controlar o [fluxo](glossary://asynchronous%20stream) de imagens de pré-visualização da câmera, usando a função `handleCameraPreviews`.
sv: [Datamodellen](glossary://data%20model) har en dedikerad [åtgärd](glossary://task) för att hantera [strömmen](glossary://asynchronous%20stream) med förhandsvisningsbilder från kameran genom att använda dess `handleCameraPreviews`-funktion.
th: [โมเดลข้อมูล](glossary://data%20model)ของคุณมี[งาน](glossary://task)เฉพาะสำหรับจัดการ[สตรีม](glossary://asynchronous%20stream)ของภาพการแสดงตัวอย่างจากกล้องโดยใช้ฟังก์ชั่น `handleCameraPreviews`
tr: [Veri modelinin](glossary://data%20model) `handleCameraPreviews` fonksiyonunu kullanarak kameradan önizleme görüntülerinin [yayınını](glossary://asynchronous%20stream) işlemeye adanmış bir [görevi](glossary://task).
vi: [Mô hình dữ liệu](glossary://data%20model) của bạn có một [tác vụ](glossary://task) chuyên biệt để xử lý [luồng](glossary://asynchronous%20stream) hình ảnh xem trước từ camera, sử dụng hàm `handleCameraPreviews`.
zh_cn: [数据模型](glossary://data%20model)有一个专用[任务](glossary://task)，可通过它的 `handleCameraPreviews`（处理相机预览）函数处理来自相机的预览图像[流](glossary://asynchronous%20stream)。
zh_tw: 你的[資料模型](glossary://data%20model)有一個專用的[任務](glossary://task)，使用它的 `handleCameraPreviews` 函數以處理來自相機的預覽影像[串流](glossary://asynchronous%20stream)。

source: You can learn more about [tasks](doc://com.apple.documentation/documentation/swift/task) in the Swift standard library.
de: In der Swift-Standardmediathek erfährst du mehr über [Aufgaben](doc://com.apple.documentation/documentation/swift/task).
es: Puedes obtener más información sobre las [tareas](doc://com.apple.documentation/documentation/swift/task) en la biblioteca estándar de Swift.
es_419: Puedes obtener detalles sobre las [tareas](doc://com.apple.documentation/documentation/swift/task) en la biblioteca estándar de Swift.
fr: Obtiens davantage d’informations sur les [tâches](doc://com.apple.documentation/documentation/swift/task) dans la bibliothèque standard de Swift.
it: Puoi scoprire di più sulle [attività](doc://com.apple.documentation/documentation/swift/task) nella libreria standard di Swift.
ja: [tasks](doc://com.apple.documentation/documentation/swift/task)（タスク）について詳しくは、Swift標準ライブラリをご覧ください。
ko: Swift 표준 라이브러리에서 [tasks](doc://com.apple.documentation/documentation/swift/task)에 관해 더 알아볼 수 있습니다.
nl: Meer informatie over [taken](doc://com.apple.documentation/documentation/swift/task) vind je in de Swift-standaardbibliotheek.
no: Du kan lese mer om [oppgaver](doc://com.apple.documentation/documentation/swift/task) i Swift-standardbiblioteket.
pt: Sabia mais sobre [tasks](doc://com.apple.documentation/documentation/swift/task) na biblioteca padrão de Swift.
sv: Du kan läsa mer om [åtgärder](doc://com.apple.documentation/documentation/swift/task) i Swift-standardbiblioteket.
th: คุณสามารถเรียนรู้เพิ่มเติมเกี่ยวกับ[งาน](doc://com.apple.documentation/documentation/swift/task)ในคลังมาตรฐาน Swift ได้
tr: Swift’in standart kitaplığında [görevler](doc://com.apple.documentation/documentation/swift/task) hakkında daha fazla bilgi edinebilirsin.
vi: Bạn có thể tìm hiểu thêm về [tác vụ](doc://com.apple.documentation/documentation/swift/task) trong thư viện Swift tiêu chuẩn.
zh_cn: 你可以在 Swift 标准库中进一步了解[任务](doc://com.apple.documentation/documentation/swift/task)。
zh_tw: 你可以在 Swift 標準資料庫中進一步瞭解[任務](doc://com.apple.documentation/documentation/swift/task)。

source: In `handleCameraPreviews`, turn the preview stream of [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) objects from the camera into a stream of [Image](doc://com.apple.documentation/documentation/swiftui/image) views, ready for display.
de: Wandle in `handleCameraPreviews` den Vorschau-Stream von [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-Objekten in einen Stream aus [Image](doc://com.apple.documentation/documentation/swiftui/image)-Ansichten um, der angezeigt werden kann.
es: En `handleCameraPreviews`, se convierte la secuencia de vista previa de los objetos de [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) de la cámara en una secuencia de vistas de [imagen](doc://com.apple.documentation/documentation/swiftui/image), listas para su visualización.
es_419: En `handleCameraPreviews`, convierte el flujo de la vista previa de objetos [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) de la cámara en un flujo de visualizaciones [Image](doc://com.apple.documentation/documentation/swiftui/image) listas para mostrarse.
fr: Dans `handleCameraPreviews`, transforme le flux d’aperçu d’objets [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) de l’appareil photo en flux de vues [Image](doc://com.apple.documentation/documentation/swiftui/image), prêts à être affichés.
it: In `handleCameraPreviews`, trasforma il flusso di anteprime di oggetti di [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) provenienti dalla fotocamera in un flusso di viste [Image](doc://com.apple.documentation/documentation/swiftui/image), pronte per essere visualizzate.
ja: `handleCameraPreviews`（カメラのプレビューを処理）で、カメラから送信される[CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)（コアイメージ）オブジェクトのプレビューストリームを、表示できる状態になった[Image](doc://com.apple.documentation/documentation/swiftui/image)（イメージ）ビューのストリームに変換することです。
ko: `handleCameraPreviews`에서, 카메라에서 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 객체의 미리보기 스트림을 표시할 준비가 된 [Image](doc://com.apple.documentation/documentation/swiftui/image) 보기 스트림으로 변환합니다.
nl: Zet in `handleCameraPreviews` de voorvertoningsstroom met [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-objecten van de camera om in een stroom met [Image](doc://com.apple.documentation/documentation/swiftui/image)-weergaven, klaar om te worden weergegeven.
no: I `handleCameraPreviews` gjøres forhåndsvisningsstrømmen med [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-objekter fra kameraet om til en strøm med [Image](doc://com.apple.documentation/documentation/swiftui/image)-visninger som er klare for visning.
pt: Em `handleCameraPreviews`, transforme o fluxo de pré‑visualizações de objetos [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) da câmera em um fluxo de visualizações [Image](doc://com.apple.documentation/documentation/swiftui/image), prontas para serem mostradas.
sv: I `handleCameraPreviews` omvandlas förhandsvisningsströmmen med [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-objekt från kameran till en ström med [Image](doc://com.apple.documentation/documentation/swiftui/image)-vyer som är klara för visning.
th: ใน `handleCameraPreviews` ให้เปลี่ยนสตรีมการแสดงตัวอย่างของวัตถุ [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) จากกล้องเป็นสตรีมของมุมมอง [Image](doc://com.apple.documentation/documentation/swiftui/image) ที่พร้อมแล้วสำหรับการแสดงผล
tr: `handleCameraPreviews`’da, [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) nesnelerinin önizleme yayınını kameradan görüntülenmeye hazır bir [Resim](doc://com.apple.documentation/documentation/swiftui/image) görüntüleri yayınına dönüştür.
vi: Trong `handleCameraPreviews`, biến luồng xem trước của các đối tượng [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) từ camera thành một luồng các chế độ xem [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image), sẵn sàng để hiển thị.
zh_cn: 在 `handleCameraPreviews` 中，将来自相机的 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 对象预览流变为 [Image](doc://com.apple.documentation/documentation/swiftui/image)（图像）视图流，以准备好进行显示。
zh_tw: 在 `handleCameraPreviews` 中將來自相機的 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 物件的預覽串流轉換為 [Image](doc://com.apple.documentation/documentation/swiftui/image) 顯示區，準備顯示出來。

source: An [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) is a stream of values that are produced at time intervals. The values form a [sequence](glossary://sequence), but with its values arriving asynchronously — an [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). You can do many of the same things you can do with any other sequence of values, such as with an [array](glossary://array).
de: Ein [asynchroner Stream](doc://com.apple.documentation/documentation/swift/asyncstream) ist ein Strom von Werten, die in zeitlichen Intervallen erzeugt werden. Diese Werte bilden eine [Sequenz](glossary://sequence), deren Werte jedoch asynchron eintreffen – eine [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Du kannst damit viele Dinge tun, die du auch mit anderen Sequenzen von Werten tun kannst, wie beispielsweise einem [Array](glossary://array).
es: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) es una secuencia de valores que se producen a intervalos de tiempo. Los valores forman una [secuencia](glossary://sequence), pero sus valores llegan de forma asíncrona: [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Puedes hacer muchas de las mismas cosas que puedes hacer con cualquier otra secuencia de valores, como con un [vector](glossary://array).
es_419: Un flujo [AsyncStream](doc://com.apple.documentation/swift/asyncstream) es una secuencia de valores que se producen a intervalos de tiempo. Los valores forman una [secuencia](glossary://sequence), pero con valores que llegan asincrónicamente ([AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence)). Puedes hacer muchas de las mismas cosas que puedes hacer con cualquier otra secuencia de valores, como con un [arreglo](glossary://array).
fr: Un flux [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) est un flux de valeurs produites à certains intervalles de temps. Les valeurs forment une [séquence](glossary://sequence), mais dont les valeurs arrivent de façon asynchrone. Il s’agit donc d’une séquence [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Tu peux faire beaucoup de choses comme avec n’importe quelle autre séquence de valeurs, comme avec une [matrice](glossary://array).
it: Un [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) corrisponde a un flusso di valori che sono prodotti a determinati intervalli di tempo. I valori formano una [sequenza](glossary://sequence), ma con valori che arrivano in modo asincrono, ovvero in una [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Puoi eseguire azioni molto simili a quelle che esegui con qualsiasi altra sequenza di valori, ad esempio, con un [array](glossary://array).
ja: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream)（非同期ストリーム）は、一定の間隔で生成される値のストリームです。値は[シーケンス](glossary://sequence)を形成しますが、その値が非同期的に届く[AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence)（非同期シーケンス）です。[配列](glossary://array)でできることなど、値のほかのシーケンスでできることの多くを行うことができます。
ko: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream)은 시간 간격을 두고 생성되는 값 스트림입니다. 해당 값은 [시퀀스](glossary://sequence)를 만들지만 비동기식으로 도착하는데, 이를 [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence)라고 합니다. [배열](glossary://array)과 같이 다른 값 시퀀스로 할 수 있는 많은 작업을 동일하게 수행할 수 있습니다.
nl: Een [asynchrone stroom](doc://com.apple.documentation/documentation/swift/asyncstream) is een stroom waarden die met bepaalde tijdsintervallen worden geproduceerd. De waarden vormen een [reeks](glossary://sequence), maar de waarden arriveren asynchroon, ze vormen een [asynchrone reeks](doc://com.apple.documentation/documentation/swift/asyncsequence). Je kunt er veel van dezelfde dingen mee doen als met andere waardenreeksen, zoals [arrays](glossary://array).
no: En [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) er en strøm med verdier som opprettes med tidsintervaller. Verdiene danner en [sekvens](glossary://sequence), men verdiene ankommer asynkront – en [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Du kan gjøre mange av de samme tingene som du kan gjøre med andre sekvenser av verdier, for eksempel med en [matrise](glossary://array).
pt: Um [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) é um fluxo de valores que são produzidos em intervalos de tempo. Os valores formam uma [sequência](glossary://sequence), mas seus valores chegam assincronamente, ou seja, uma [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). É possível fazer muitas das mesmas coisas que você faz com qualquer outra sequência de valores, como em um [vetor](glossary://array).
sv: En [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) är en ström med värden som skapas vid tidsintervall. Värdena bildar en [sekvens](glossary://sequence), men dess värden anländer asynkront – en [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Du kan göra många av sakerna du gör med andra värdesekvenser, exempelvis med en [array](glossary://array).
th: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) คือสตรีมของค่าที่ถูกสร้างขึ้นตามช่วงเวลา ค่าจะสร้าง[ลำดับ](glossary://sequence)ขึ้น แต่ค่าของลำดับจะมาถึงแบบอะซิงโครนัส หรือเรียกอีกอย่างว่า [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence) คุณสามารถทำสิ่งเดียวกันกับที่คุณทำกับลำดับอื่นๆ ของค่าได้มากมาย เช่น กับ[อาร์เรย์](glossary://array)
tr: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream), zaman aralıklarıyla üretilen değerler akışıdır. Bu değerler bir [diziliş](glossary://sequence) oluşturur ama diziliş değerleri eşzamansız olarak ulaşır ([AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Diğer değer dizilişleriyle (örneğin bir [dizi](glossary://array)) yapabildiklerinin pek çoğunu aynı şekilde yapabilirsin).
vi: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) là một luồng các giá trị được tạo ra vào các khoảng thời gian. Các giá trị tạo thành một [trình tự](glossary://sequence), nhưng với các giá trị xuất hiện không đồng bộ — một [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence). Bạn có thể thực hiện nhiều việc giống như những gì bạn có thể làm với bất kỳ trình tự giá trị nào, ví dụ như với một [dãy](glossary://array).
zh_cn: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream)（异步流）是指隔一段时间产生的数值流。这些值组成了一个[序列](glossary://sequence)，只是它的值为异步到达，也就是说，它是一个 [AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence)（异步序列）。你可以对它执行许多对任何其他值序列（如[数组](glossary://array)）执行的相同操作。
zh_tw: [AsyncStream](doc://com.apple.documentation/documentation/swift/asyncstream) 是一個按照時間間隔產生的數值串流。來自[序列](glossary://sequence)的值，但它的值是非同步到達的[AsyncSequence](doc://com.apple.documentation/documentation/swift/asyncsequence)。你可以對任何其他值序列執行許多相同的操作，例如使用[陣列](glossary://array)。
