Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Make your grid scrollable by placing it inside a [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). This makes it so your grid can have as many rows as it needs, and you’ll be able to scroll up and down through your photos.
de: Du kannst dein Raster scrollbar machen, indem du es in [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) platzierst. Auf diese Weise kann das Raster dann so viele Zeilen haben, wie es braucht, und du kannst durch deine Fotos scrollen.
es: Haz que tu cuadrícula se pueda desplazar colocándola dentro de una vista [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). De este modo, la cuadrícula puede tener tantas filas como necesite, y podrás desplazarte hacia arriba y hacia abajo por tus fotos.
es_419: Para poder desplazarte en tu cuadrícla, colócala dentro de una visualización desplazable, [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). Esto hace que la cuadrícula pueda tener tantas filas como necesite, y podrás desplazarte hacia arriba y hacia abajo para explorar tus fotos.
fr: Fais en sorte que les utilisateurs puissent faire défiler ta grille en la plaçant à l’intérieur d’une [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). En conséquence, la grille peut contenir autant de rangs que nécessaire et les utilisateurs pourront faire défiler les photos vers le haut et vers le bas.
it: Rendi scorrevole la tua griglia posizionandola all’interno della vista [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). In questo modo la griglia potrà avere tutte le righe che vuoi e potrai scorrere le tue foto verso o l’alto o verso il basso.
ja: なので、グリッドを[ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview)（スクロールビュー）の中に配置して、スクロールできるようにしましょう。そうすれば、グリッドに必要な数の行ができ、写真を上下にスクロールできるようになります。
ko: 격자를 [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) 내부에 배치해 스크롤할 수 있도록 하세요. 그러면 격자에 필요한 만큼 많은 행이 생기며, 사진을 위아래로 스크롤할 수 있습니다.
nl: Maak het raster scrolbaar door het in een [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) te plaatsen. Hierdoor kan het raster zoveel rijen bevatten als nodig is en je kunt omhoog en omlaag door de foto's scrollen.
no: Gjør det mulig å rulle i rutenettet ved å plassere det i en [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). Da kan rutenettet ha så mange rader som det trenger, og du kan rulle opp og ned i bildene dine.
pt: Para tornar a grade rolável, coloque‑a dentro de uma [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). Isso faz com que a grade possa ter tantas linhas quanto forem necessárias, e você poderá rolar para cima e para baixo pelas fotos.
sv: Gör rutnätet rullningsbart genom att placera det inuti en [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). Det gör så att rutnätet kan ha så många rader det behöver och du kan rulla uppåt och nedåt genom bilderna.
th: ทำให้ตารางของคุณเลื่อนได้โดยวางไว้ภายใน [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) การทำเช่นนี้ก็เพื่อให้ตารางของคุณสามารถมีจำนวนแถวได้มากเท่าที่ต้องการ และคุณจะสามารถเลื่อนขึ้นและลงเพื่อดูรูปภาพของคุณได้
tr: Izgaranı bir [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) içine yerleştirerek kaydırılabilir hâle getir. Bu, ızgaranın gerektiği kadar çok satıra sahip olmasını sağlar, sen de fotoğrafların genelinde yukarı ve aşağı kaydırabilirsin.
vi: Làm cho lưới của bạn có thể cuộn bằng cách đặt lưới bên trong một [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview). Việc này làm cho lưới của bạn có thể có số lượng hàng tùy ý và bạn sẽ có thể cuộn lên và xuống qua các ảnh của mình.
zh_cn: 将网格放到 [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview)（滚动视图）内来将它变成可滚动网格，这样它就可以具有所需要的任意多行数，并且你将能够上下滚动浏览照片。
zh_tw: 透過將其放置在 [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) 中，來讓你的網格可以捲動。這能讓你的網格可以根據需要包含任意數量的橫列，並且你可以上下捲動照片。

source: Inside your grid, use [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) to [iterate](glossary://iteration) over the photo assets in your collection and generate a view for each asset — these views populate your grid.
de: In deinem Raster verwendest du [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach), um über die Foto-Assets in deiner Sammlung zu [iterieren](glossary://iteration) und eine Ansicht für jedes Foto-Asset zu erstellen. Diese Ansichten füllen dein Raster.
es: Dentro de tu cuadrícula, usa [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) para [iterar](glossary://iteration) sobre los activos de fotos de tu colección y generar una vista para cada activo (vistas que rellenan tu cuadrícula).
es_419: Dentro de tu cuadrícula, usa un ciclo [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) para [iterar](glossary://iteration) sobre los activos fotográficos de tu colección y generar una visualización para cada uno. Estas visualizaciones a su vez llenarán tu cuadrícula.
fr: À l’intérieur de ta grille, utilise [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) pour effectuer une [itération](glossary://iteration) sur les ressources photo de ta collection et générer ainsi une vue pour chaque ressource. Ces vues remplissent ta grille.
it: All’interno della griglia puoi utilizzare un valore [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) per effettuare un’[iterazione](glossary://iteration) sulle risorse fotografiche nella raccolta e generare una vista per ciascuna risorsa; queste viste popoleranno la tua griglia.
ja: グリッドの中で[ForEach](doc://com.apple.documentation/documentation/swiftui/foreach)を使ってコレクション内のフォト素材を[反復処理](glossary://iteration)し、素材ごとにビューを生成します。生成したビューでグリッドを埋めます。
ko: 격자 내부에서는 [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach)를 사용해 모음에 있는 사진 항목을 [반복](glossary://iteration)하고 각 항목의 보기를 생성합니다. 이러한 보기는 격자를 채웁니다.
nl: In het raster gebruik je [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) om door de fotobestanden in je verzameling te [itereren](glossary://iteration) en voor elk bronbestand een weergave aan te maken. Met deze weergaven wordt het raster gevuld.
no: Bruk [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) i rutenettet for å [iterere](glossary://iteration) over bilderessursene i samlingen og generere en visning for hver ressurs. Disse visningene fyller rutenettet.
pt: Dentro da grade, você usa [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) para [iterar](glossary://iteration) nos materiais de foto da coleção e gera uma visualização para cada material — essas visualizações preenchem a grade.
sv: Inuti rutnätet använder du [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) till att [iterera](glossary://iteration) över bildresurserna i samlingen och skapa en vy för varje resurs – de här vyerna fyller rutnätet.
th: ภายในตารางของคุณ ให้ใช้ [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) เพื่อ[ทำซ้ำ](glossary://iteration)แอสเซทรูปภาพในคอลเลกชั่นของคุณและสร้างมุมมองสำหรับแต่ละแอสเซท ซึ่งมุมมองเหล่านี้จะสร้างตารางของคุณ
tr: Izgaranın içinde, koleksiyonundaki fotoğraf öğelerinde [tekrarlamak](glossary://iteration) ve her bir öğe için görüntü oluşturmak amacıyla [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) kullan. Bu görüntüler ızgaranı doldurur.
vi: Bên trong lưới của bạn, hãy sử dụng [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) để [lặp lại](glossary://iteration) trên các tài sản ảnh trong bộ sưu tập và tạo một chế độ xem cho từng tài sản — những chế độ xem này điền vào lưới của bạn.
zh_cn: 在网格内使用 [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach)（针对每个）来[迭代](glossary://iteration)照片集中的照片资源，并为每个资源生成一个视图。这些视图将填充网格。
zh_tw: 在你的網格內使用 [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) 對照片集中的照片內容[反覆運算](glossary://iteration)，並且為每個內容產生一個顯示區，這些顯示區會填滿你的網格。

source: Because your grid is lazy, as you scroll, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) only operates on the visible photo assets.
de: Da dein Raster faul ist, wirkt sich [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) immer nur auf die Foto-Assets aus, die sichtbar sind.
es: Dado que tu cuadrícula es diferida, al desplazarte, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) solo opera sobre los activos de fotos visibles.
es_419: Dado que tu cuadrícula es “perezosa”, a medida que se desplaza, el ciclo [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) sólo trabaja en los componentes visibles.
fr: Étant donné que ta grille est économe, lorsque tu fais défiler, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) n’opère que sur les ressources photographiques visibles.
it: Visto che la griglia è “pigra”, quando scorri, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) ha effetto soltanto sulle risorse fotografiche visibili.
ja: このグリッドはゆるやかなので、スクロールしたときに、[ForEach](doc://com.apple.documentation/documentation/swiftui/foreach)では表示されるフォト素材しか処理されません。
ko: 격자는 게으르기(lazy) 때문에 스크롤하면 [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach)는 보이는 사진 항목에서만 작동합니다.
nl: Omdat je raster een LazyGrid is, bewerkt [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) tijdens het scrollen alleen de zichtbare fotobestanden.
no: Siden rutenettet er forsinket, vil [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) bare bearbeide de synlige bilderessursene når du ruller.
pt: Como a grade é preguiçosa, à medida que você rola, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) opera apenas nos materiais de foto visíveis.
sv: Eftersom rutnätet är slött bearbetar [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) bara de synliga bildresurserna när du rullar.
th: เนื่องจากตารางของคุณเป็นแบบยืดหยุ่น ในขณะที่คุณเลื่อนอยู่ [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) จะดำเนินการกับเแอสเซทรูปภาพที่สามารถมองเห็นได้เท่านั้น
tr: Izgaran tembel olduğu için sen kaydırdıkça [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) yalnızca görünür fotoğraf öğelerinde çalışır.
vi: Vì lưới của bạn là lazy nên khi bạn cuộn, [ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) chỉ hoạt động trên các tài sản ảnh được hiển thị.
zh_cn: 由于网格是惰性的，在滚动时，[ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) 只会对可见的照片资源进行操作。
zh_tw: 因為你的網格是惰性網格，在你捲動時，[ForEach](doc://com.apple.documentation/documentation/swiftui/foreach) 只會在可見的照片內容上操作。

source: Create a [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) for each grid item that, when tapped or clicked, displays the individual photo at full size using the [destination](glossary://destination%20view) `PhotoView` initialized with the photo asset.
de: Erstelle einen [Navigations-Link](doc://com.apple.documentation/documentation/swiftui/navigationlink) für jedes Rasterobjekt. Wenn du darauf tippst oder klickst, wird ein bestimmtes Foto in voller Größe mithilfe des `PhotoView`-[Ziels](glossary://destination%20view), das mit dem Foto-Asset initialisiert wurde, angezeigt.
es: Crea un enlace de navegación [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) para cada ítem de la cuadrícula que, al tocarlo o hacer clic, muestre la foto individual a tamaño completo usando el [destino](glossary://destination%20view) `PhotoView` inicializado con el activo de foto.
es_419: Crea un enlace de navegación, [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink), para cada elemento de cuadrícula que, al tocarlo o presionarlo, muestre la foto individual en tamaño completo usando la [visualización de destino](glossary://destination%20view) `PhotoView` inicializada con el componente fotográfico.
fr: Crée un [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) pour chaque élément de grille qui, lorsqu’on le touche ou lorsqu’on clique dessus, affiche la photo individuelle en taille maximale en utilisant la [destination](glossary://destination%20view) `PhotoView` initialisée avec la ressource photographique.
it: Crea un [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) per ciascun elemento della griglia che, quando viene selezionato, mostra la singola foto a dimensioni intere utilizzando la [destinazione](glossary://destination%20view) `PhotoView` inizializzata con la risorsa fotografica.
ja: フォト素材で初期化される[移動先](glossary://destination%20view) `PhotoView`（写真ビュー）を使って、タップまたはクリックされたときに個々の写真がフルサイズで表示される、グリッド項目ごとの[NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink)（ナビゲーションリンク）を作成します。
ko: 각각의 격자 항목을 대상으로 [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink)를 생성하세요. 해당 격자 항목을 탭하거나 클릭하면 사진 항목으로 초기화된 [대상](glossary://destination%20view) `PhotoView`를 사용해 개별 사진을 실제 크기로 표시합니다.
nl: Maak met behulp van de [doel](glossary://destination%20view)-`PhotoView` die met het fotobestand is geïnitialiseerd een [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) voor elk rasteronderdeel aan waarmee de afzonderlijke foto op volledige grootte wordt weergegeven wanneer erop wordt getikt of geklikt.
no: Opprett en [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) for hvert rutenettobjekt som, når det blir trykket eller klikket på, viser bildet i full størrelse ved hjelp av [målet](glossary://destination%20view) `PhotoView`, som initialiseres med bilderessursen.
pt: Crie um [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) para cada item de grade que, quando tocado ou clicado, mostra a foto individual em tamanho original usando o [destino](glossary://destination%20view) `PhotoView` inicializado com o material de foto.
sv: Skapa en [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) för varje rutnätsobjekt. När länken blir tryckt eller klickad på visas den enskilda bilden i full storlek med hjälp av [målet](glossary://destination%20view) `PhotoView` som initieras med bildresursen.
th: สร้าง [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) สำหรับรายการตารางแต่ละรายการ ซึ่งเมื่อแตะหรือคลิกอยู่ จะแสดงแต่ละรูปในขนาดเต็มโดยใช้ `PhotoView` [ปลายทาง](glossary://destination%20view) ที่สร้างค่าเริ่มต้นด้วยแอสเซทรูปภาพ
tr: Dokunulduğunda veya tıklandığında bir fotoğrafı fotoğraf öğesi ile ilk değer atanan `PhotoView` [hedefini](glossary://destination%20view) kullanarak tek başına tam büyüklükte görüntüleyen her bir ızgara öğesi için bir [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) yarat.
vi: Tạo ra một [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink) cho từng mục lưới, khi được chạm hoặc bấm, hiển thị ảnh riêng lẻ ở kích cỡ đầy đủ bằng cách sử dụng [đích](glossary://destination%20view) `PhotoView` được khởi tạo với tài sản ảnh.
zh_cn: 为每个网格项创建 [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink)（导航链接），以在轻点或点按每一项时，使用通过照片资源初始化的[目的视图](glossary://destination%20view) `PhotoView`，以完整大小显示单张照片。
zh_tw: 為每個網格項目建立一個 [NavigationLink](doc://com.apple.documentation/documentation/swiftui/navigationlink)，點按該項目時，使用由照片內容初始化的[目標](glossary://destination%20view) `PhotoView` 以全尺寸顯示單張照片。

source: The `photoItemView(asset:)` method creates a view that displays a small image thumbnail for a photo asset.
de: Die Methode `photoItemView(asset:)` erstellt eine Ansicht, die für ein Foto-Asset eine kleine Bildminiatur anzeigt.
es: El método `photoItemView(asset:)` crea una vista que muestra una pequeña imagen en miniatura de un activo de foto.
es_419: El método `photoItemView(asset:)` crea una visualización que muestra una miniatura imagen pequeña de un componente fotográfico.
fr: La méthode `photoItemView(asset:)` crée une vue qui affiche une petite vignette d’image pour une ressource photographique.
it: Il metodo `photoItemView(asset:)` crea una vista che mostra una miniatura di piccole dimensioni della risorsa fotografica.
ja: `photoItemView(asset:)`（写真項目表示）メソッドで、フォト素材の小さいイメージサムネールを表示するビューを作成します。
ko: `photoItemView(asset:)` 메소드는 사진 항목의 작은 이미지 축소판을 표시하는 보기를 생성합니다.
nl: Met de methode `photoItemView(asset:)` wordt een weergave aangemaakt waarin een kleine afbeeldingsminiatuur voor een fotobestand wordt weergegeven.
no: `photoItemView(asset:)`-metoden oppretter en visning som viser et lite miniatyrbilde for en bilderessurs.
pt: O método `photoItemView(asset:)` cria uma visualização que mostra uma pequena imagem em miniatura de um material de foto.
sv: Metoden `photoItemView(asset:)` skapar en vy som visar en liten bildminiatyr för en bildresurs.
th: วิธีการ `photoItemView(asset:)` จะสร้างมุมมองที่แสดงรูปย่อภาพขนาดเล็กสำหรับแอสเซทรูปภาพ
tr: `photoItemView(asset:)` metodu, fotoğraf öğesi için görüntü küçük resmi gösteren bir görüntü yaratır.
vi: Phương thức `photoItemView(asset:)` tạo ra một chế độ xem hiển thị một hình ảnh thu nhỏ cho một tài sản ảnh.
zh_cn: `photoItemView(asset:)` 方法创建了一个视图，显示照片资源的较小图像缩略图。
zh_tw: `photoItemView(asset:)` 方法會製作一個顯示區，展示照片內容的小型影像縮覽圖。

source: You’ll use this view as the [label](glossary://label) for the navigation link, displaying each link as a thumbnail-sized image of the photo.
de: Du verwendest diese Ansicht als [Etikett](glossary://label) für den Navigations-Link und zeigst jeden Link als Miniaturbild des Fotos an.
es: Usarás esta vista como la [etiqueta](glossary://label) del enlace de navegación, mostrando cada enlace como una imagen en miniatura de la foto.
es_419: Usarás esta visualización como la [etiqueta](glossary://label) del enlace de navegación, y mostrarás cada enlace como una miniatura de la foto de destino.
fr: Tu utiliseras cette vue en tant qu’[étiquette](glossary://label) pour le lien de navigation, en affichant chaque lien sous la forme d’une image de la taille d’une vignette de la photo.
it: Utilizzerai questa vista come l’[etichetta](glossary://label) per il link di navigazione, che mostrerà ciascun link come un’immagine in miniatura della foto.
ja: このビューをナビゲーションリンクの[ラベル](glossary://label)として使って、それぞれのリンクを写真のサムネールサイズのイメージとして表示します。
ko: 이 보기를 탐색 링크의 [레이블](glossary://label)로 사용하고 각각의 링크를 축소판 크기의 사진 이미지로 표시합니다.
nl: Je gebruikt deze weergave als het [label](glossary://label) voor de navigatielink, waarbij elke link als een miniatuurafbeelding van de foto wordt weergegeven.
no: Du bruker denne visningen som [etikett](glossary://label) for navigeringslenken ved å vise hver lenke som et miniatyrbilde av bildet.
pt: Você usará essa visualização como a [etiqueta](glossary://label) do link de navegação, mostrando cada link como uma imagem da foto em tamanho de miniatura.
sv: Du använder den här vyn som [etikett](glossary://label) för navigeringslänken och visar varje länk som en bild i miniatyrstorlek.
th: คุณจะต้องใช้มุมมองนี้เป็น[ป้าย](glossary://label)สำหรับลิงก์การนำทาง ซึ่งแสดงแต่ละลิงก์เป็นภาพขนาดย่อของรูปภาพ
tr: Bu görüntüyü, her bağlantıyı fotoğrafın küçük resim boyutundaki görüntüsü olarak gösteren dolaşma bağlantısı için [etiket](glossary://label) olarak kullanacaksın.
vi: Bạn sẽ sử dụng chế độ xem này dưới dạng [nhãn](glossary://label) cho liên kết điều hướng, hiển thị từng liên kết dưới dạng một hình ảnh được thu nhỏ kích cỡ của ảnh.
zh_cn: 这个视图将用作导航链接的[标签](glossary://label)，让每个链接显示为照片的缩略图大小版本。
zh_tw: 你將使用此顯示區作為導覽連結的[標籤](glossary://label)，將每個連結顯示為照片縮覽圖大小的影像。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..TaskphotoView..title
source: Displaying a Photo
de: Foto anzeigen
es: Mostrar una foto
es_419: Mostrar una foto
fr: Afficher une photo
it: Visualizzare una foto
ja: 写真を表示する
ko: 사진 표시하기
nl: Een foto weergeven
no: Vise et bilde
pt: Mostrando uma Foto
sv: Visa en bild
th: การแสดงรูปภาพ
tr: Fotoğrafı Görüntüleme
vi: Hiển thị một ảnh
zh_cn: 显示照片
zh_tw: 顯示照片

# GuideBook..Guide0..StepCapturing Photos..TaskGroup2..TaskphotoView..Paragraph145
source: Learn how the photo view loads and displays your photo.
de: Lerne, wie die Fotoansicht dein Foto lädt und anzeigt.
es: Aprende cómo se carga y se muestra tu foto en la vista de foto.
es_419: Descubre cómo la visualización de fotos carga y muestra tu foto.
fr: Découvre comment la vue des photos charge et affiche ta photo.
it: Scopri come le foto vengono mostrate e caricate dalla tua vista fotografica.
ja: 写真ビューに写真を読み込んで表示する方法を学びましょう。
ko: 사진 보기가 사진을 로드하고 표시하는 방법을 알아보세요.
nl: Leer hoe de fotoweergave wordt geladen en hoe je foto erin wordt weergegeven.
no: Finn ut hvordan bildevisningen laster inn og viser bildet ditt.
pt: Saiba como a visualização de foto carrega a mostra uma foto.
sv: Lär dig hur bildvyn blir inläst och visar din bild.
th: ดูวิธีที่มุมมองรูปภาพโหลดและแสดงรูปภาพของคุณ
tr: Fotoğraf görüntüsünün nasıl yükleneceğini ve fotoğrafını görüntüleyeceğini öğren.
vi: Tìm hiểu cách chế độ xem ảnh tải và hiển thị ảnh của bạn.
zh_cn: 了解照片视图载入和显示照片的方式。
zh_tw: 瞭解照片顯示區如何載入和顯示照片。

source: When it comes to displaying a photo on its own, you’ll use `PhotoView`.
de: Für das Anzeigen eines einzelnen Fotos verwendest du die Ansicht `PhotoView`.
es: Cuando se trata de mostrar una foto por sí sola, usarás `PhotoView`.
es_419: Para mostrar una sola foto, puedes usar la visualización`PhotoView`.
fr: Quand il s’agit d’afficher une photo toute seule, tu utilises `PhotoView`.
it: Se invece desideri visualizzare una foto singolarmente, usa `PhotoView`.
ja: 写真が自動的に表示されるようにする場合は、`PhotoView`（写真ビュー）を使用します。
ko: 사진 한 장을 따로 표시하려면 `PhotoView`를 사용합니다.
nl: Voor het weergeven van een afzonderlijke foto gebruik je `PhotoView`.
no: Når du vil vise et bilde på egen hånd, bruker du `PhotoView`.
pt: Quando quiser mostrar uma foto sozinha, versão usará `PhotoView`.
sv: När du vill visa en bild på egen hand använder du `PhotoView`.
th: ถ้าจะพูดถึงเรื่องการแสดงรูปภาพด้วยตัวเอง คุณจะต้องใช้ `PhotoView`
tr: İş fotoğrafı kendi başına görüntülemeye geldiğinde `PhotoView`’u kullanacaksın.
vi: Khi cần hiển thị một ảnh độc lập, bạn sẽ sử dụng `PhotoView`.
zh_cn: 关于单独显示一张照片，你将使用 `PhotoView`。
zh_tw: 在單獨顯示照片時，你會使用`PhotoView`。
