Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: In your photo view, you display a high-resolution image that you request from the photo. You also have an overlay with buttons for favoriting or deleting the photo.
de: In deiner Fotoansicht wird ein hochauflösendes Bild angezeigt, das du von dem Foto anforderst. Es gibt auch eine Überlagerung mit Tasten, um das Foto zu den Favoriten hinzuzufügen oder es zu löschen.
es: En tu vista de foto, se muestra la imagen de alta resolución que solicitas de la foto. También tienes una superposición con botones para marcar la foto como favorita o eliminarla.
es_419: En esta visualización se muestra la foto en una imagen de alta resolución. También muestra una sobreposición con botones para marcar la foto como favorita o para eliminarla.
fr: Dans ta présentation de photos, les images dont tu fais la requête à partir de la photo s’affichent en haute résolution. Tu as aussi des boutons incrustés permettant d’ajouter la photo aux favoris ou de la supprimer.
it: Nella vista fotografica viene visualizzata un’immagine ad alta risoluzione che richiedi alla foto. Inoltre, hai a disposizione anche un elemento sovrapposto con i pulsanti per aggiungere la foto a quelle preferite o per eliminarla.
ja: 写真ビューで、写真の高解像度イメージをリクエストして表示しましょう。写真をお気に入りにしたり、削除したりするボタンが付いたオーバーレイも使いましょう。
ko: 사진 보기에서는 해당 사진에 요청한 고해상도 이미지를 표시합니다. 또한 사진을 즐겨찾는 항목으로 표시하거나 삭제하는 버튼도 오버레이로 표시됩니다.
nl: Nadat je om een afbeelding met een hoge resolutie van de foto hebt gevraagd, wordt deze afbeelding weergegeven in de fotoweergave. Deze weergave bevat ook een overlay met knoppen waarmee je de foto als favoriet kunt markeren of verwijderen.
no: I bildevisningen viser du et høyoppløst bilde, som du ber om fra originalbildet. Du har også et overlegg med knapper for å merke bildet som favoritt eller slette det.
pt: Na visualização de foto, você mostra uma imagem em alta resolução que você solicita da foto. Você também tem uma sobreposição com botões para apagar a foto ou marcá‑la como favorita.
sv: I bildvyn visar du en högupplöst bild som du begär från originalbilden. Du har också ett överlägg med knappar för att göra bilden till favorit eller radera den.
th: ในมุมมองรูปภาพของคุณ ให้คุณแสดงภาพความละเอียดสูงที่คุณร้องขอมาจากรูปภาพนั้น คุณยังมีการทับซ้อนกับปุ่มต่างๆ เพื่อตั้งรูปภาพเป็นรายการโปรดหรือลบรูปภาพอีกด้วย
tr: Fotoğraf görüntünde, fotoğraftan istediğin yüksek çözünürlüklü bir görüntü gösterirsin. Fotoğrafı favorilere eklemeye veya silmeye yönelik düğmeler içeren bir katmanın da vardır.
vi: Trong chế độ xem ảnh, bạn hiển thị một hình ảnh có độ phân giải cao mà bạn yêu cầu từ ảnh. Bạn cũng có một lớp phủ với các nút để ưa thích hoặc xóa ảnh.
zh_cn: 在照片视图中显示从照片请求的高分辨率图像。你还有一个叠层，显示用于收藏或删除照片的按钮。
zh_tw: 在你的照片顯示區中，你會顯示從照片要求而來的高解析度影像。你還可以使用帶有按鈕的覆疊來標示喜愛的照片或刪除照片。

source: Your photo view has a `photoAsset` property for the photo it displays. You pass this in when you initialize the `PhotoView`.
de: Die Fotoansicht besitzt für das Foto, das sie anzeigt, die Eigenschaft `photoAsset`. Du übergibst sie, wenn du `PhotoView` initialisierst.
es: Tu vista de foto tiene una propiedad `photoAsset` para la foto que muestra, que se pasa al inicializar la vista `FotoView`.
es_419: Tu visualización de foto tiene una propiedad `"photoAsset"` para la foto que muestra. Esta propiedad debe pasarse cuando se inicializa la visualización `"PhotoView"`.
fr: Ta présentation de photos possède une propriété `photoAsset` pour la photo qu’elle affiche. Elle est déclenchée lorsque tu initialises la `PhotoView`.
it: La vista fotografica ha una proprietà `photoAsset` per la foto che mostra. Questa è la proprietà che trasmetti quando inizializzi `PhotoView`.
ja: 写真ビューには、表示する写真の`photoAsset`（フォト素材）プロパティがあります。このプロパティは、`PhotoView`（写真ビュー）を初期化するときに渡します。
ko: 사진 보기에는 표시되는 사진의 `photoAsset` 속성이 있습니다. `PhotoView`를 초기화할 때 이 속성을 전달합니다.
nl: De fotoweergave heeft een `photoAsset`-eigenschap voor de foto die wordt weergegeven. Je geeft deze door wanneer je de `PhotoView` initialiseert.
no: Bildevisningen har en `photoAsset`-egenskap for bildet den viser. Du overfører denne når du initierer `PhotoView`.
pt: A visualização de foto tem uma propriedade `photoAsset` para a foto que ela mostra. Você passa isso quando inicializa a `PhotoView`.
sv: Bildvyn har en `photoAsset`-egenskap för bilden den visar. Du överför den när du initierar `PhotoView`.
th: มุมมองรูปภาพของคุณมีคุณสมบัติ `photoAsset` สำหรับรูปภาพที่แสดง ให้คุณส่งผ่านสิ่งนี้เมื่อคุณสร้างค่าเริ่มต้นของ `PhotoView`
tr: Fotoğraf görüntünde, gösterdiği fotoğraf için bir `photoAsset` özelliği bulunur. `PhotoView`’a ilk değer atadığında bunu geçirirsin.
vi: Chế độ xem ảnh của bạn có một thuộc tính `photoAsset` cho ảnh mà chế độ xem đó hiển thị. Bạn chuyển thuộc tính này vào khi khởi tạo `PhotoView`.
zh_cn: 照片视图有一个针对它所显示照片的 `photoAsset` 属性。你将在初始化 `PhotoView` 时传入这个属性。
zh_tw: 你的照片顯示區有一個用於顯示照片的 `photoAsset` 屬性。你在初始化 `PhotoView` 時會將其傳入。

source: You also initialize the view with a `cache` property that holds a reference to your image cache.
de: Du initialisierst die Ansicht auch mit der Eigenschaft `cache`, die eine Referenz zum Bildcache enthält.
es: La vista también se inicializa con una propiedad `cache`, que contiene una referencia a tu caché de imágenes.
es_419: También puedes inicializar la visualización con una propiedad `cache`, la cual contiene una referencia a tu caché de imágenes.
fr: Tu initialises également la vue avec une propriété `cache`, qui garde une référence du cache de ton image.
it: Puoi inizializzare la vista anche con una proprietà `cache` che contiene un riferimento alla tua cache delle immagini.
ja: また、イメージキャッシュへの参照を格納する`cache`（キャッシュ）プロパティを使ってビューを初期化します。
ko: 이미지 캐시 참조를 보유하는`cache` 속성으로 보기를 초기화할 수도 있습니다.
nl: Je kunt de weergave ook met een `cache`-eigenschap initialiseren, waarin een verwijzing naar je afbeeldingscache wordt bewaard.
no: Du initierer også visningen med en `cache`-egenskap som inneholder en referanse til bildebufferen.
pt: Você também inicializa a visualização com uma propriedade `cache`, que contém uma referência ao cache da imagem.
sv: Du kan också initiera `cache`-egenskapen som innehåller en referens till bildcachen.
th: คุณยังต้องสร้างค่าเริ่มต้นของมุมมองด้วยคุณสมบัติ `cache` ที่มีการอ้างอิงถึงแคชภาพของคุณอีกด้วย
tr: Ayrıca, resim önbelleğinin referansını tutan bir `cache` özelliği ile görüntüye ilk değer atarsın.
vi: Bạn cũng khởi tạo chế độ xem với một thuộc tính `cache` lưu giữ tham chiếu đến bộ nhớ đệm hình ảnh.
zh_cn: 你还将使用 `cache`（缓存）属性初始化视图，这个属性包含对图像缓存的引用。
zh_tw: 你還可以使用 `cache` 屬性來初始化顯示區，它包含了對影像快取的參照。

source: You can request an image of a specified size from the image cache. After loading the image from the photo asset, the cache delivers it back to you. The image cache also keeps recently-requested images in memory, so it doesn’t have to reload them if you request them again.
de: Du kannst ein Bild mit einer bestimmten Größe aus dem Bildcache anfordern. Nach dem Laden des Bildes aus der Fotodatei gibt der Cache es an dich zurück. Der Bildcache behält außerdem die zuletzt angeforderten Bilder im Speicher, um sie nicht noch mal laden zu müssen, wenn sie erneut abgerufen werden.
es: Puedes solicitar una imagen de un tamaño determinado a la caché de imágenes. Después de cargar la imagen desde el activo de foto, la caché te la proporciona de nuevo. La caché de imágenes también mantiene en memoria las imágenes solicitadas recientemente, para no tener que volver a cargarlas si las vuelves a solicitar.
es_419: Puedes solicitar una imagen de un tamaño determinado a la caché de imágenes. Después de cargar la imagen desde el activo fotográfico, la caché la devuelve. La caché de imágenes también mantiene en memoria las imágenes solicitadas recientemente, para no tener que cargarlas una y otra vez si vuelves a solicitarlas.
fr: Tu peux demander une image d’une taille spécifique au cache de l’image. Une fois qu’il a chargé l’image de la ressource photo, le cache te l’affiche. Le cache de l’image garde également en mémoire les images récemment demandées, pour ne pas avoir à les recharger si tu les demandes à nouveau.
it: Dalla cache delle immagini, puoi richiedere un’immagine di dimensioni specifiche. Dopo aver caricato l’immagine dalla risorsa fotografica, la cache te la restituisce. La cache delle immagini salva in memoria anche le immagini richieste di recente, in modo che non devi ricaricarle se le richiedi nuovamente.
ja: サイズを指定して、イメージキャッシュのイメージをリクエストできます。フォト素材からイメージが読み込まれると、キャッシュからそれが配信されます。イメージキャッシュでは最近リクエストされたイメージもメモリに保管されるので、もう一度リクエストした場合に再読み込みする必要はありません。
ko: 사용자는 지정된 크기의 이미지를 이미지 캐시에 요청할 수 있습니다. 사진 항목으로부터 이미지를 로드한 후에 캐시는 사용자에게 다시 해당 이미지를 전달합니다. 이미지 캐시는 또한 최근에 요청된 이미지를 메모리에 보관하므로 사용자가 해당 이미지를 다시 요청할 경우 이를 다시 로드할 필요가 없습니다.
nl: Je kunt een afbeelding met een specifieke grootte uit de afbeeldingscache opvragen. Nadat de afbeelding uit het fotobestand is geladen, stuurt de cache de afbeelding naar je terug. De afbeeldingscache bewaart ook recent opgevraagde afbeeldingen in het geheugen, zodat deze afbeeldingen niet opnieuw hoeven te worden geladen als je ze weer opvraagt.
no: Du kan be om et bilde med en bestemt størrelse fra bildebufferen. Når bildet er lastet inn fra bilderessursen, leverer bufferen det til deg. Bildebufferen kan også lagre nylig forespurte bilder i minnet, slik at den ikke trenger å laste dem inn på nytt hvis du ber om dem igjen.
pt: Você pode solicitar uma imagem de um tamanho especificado a partir do cache da imagem. Depois de carregar a imagem a partir do recurso de foto, o cache o entrega de volta a você. O cache da imagem também mantém imagens solicitadas recentemente na memória, para não precisar recarregá-las caso você as solicite novamente.
sv: Du kan begära en bild med en viss storlek från bildcachen. När bilden har lästs in från bildresursen levererar cachen den tillbaka till dig. Bildcachen behåller också de senast begärda bilderna i minnet så att den slipper läsa in dem på nytt ifall du begär dem igen.
th: คุณสามารถร้องขอภาพในขนาดที่ระบุเฉพาะได้จากแคชภาพ หลังจากโหลดภาพจากแอสเซทรูปภาพแล้ว แคชจะส่งภาพกลับมาให้คุณ แคชภาพยังช่วยเก็บภาพที่ร้องขอล่าสุดไว้ในหน่วยความจำด้วย ดังนั้นจึงไม่จำเป็นต้องโหลดซ้ำหากคุณร้องขอภาพเหล่านั้นอีกครั้ง
tr: Resim önbelleğinden belirtilen büyüklükte bir resim isteyebilirsin. Fotoğraf öğesinden resmi yükledikten sonra önbellek bunu yeniden sana iletir. Resim önbelleği son istenen resimleri de bellekte tutar, böylece yeniden istediğinde onları yeniden yüklemesi gerekmez.
vi: Bạn có thể yêu cầu một hình ảnh có kích cỡ được chỉ định từ bộ nhớ đệm hình ảnh. Sau khi tải hình ảnh từ tài sản ảnh, bộ nhớ đệm cung cấp hình ảnh trở lại cho bạn. Bộ nhớ đệm hình ảnh cũng giữ lại các hình ảnh đã yêu cầu gần đây trong bộ nhớ để không phải tải lại nếu bạn yêu cầu lại.
zh_cn: 你可以从图像缓存中请求指定大小的图像。从照片资源载入这张图像后，缓存会将它发回给你。图像缓存还在内存中保存了最近请求过的图像，如果你再次请求这些图像就无需重新载入。
zh_tw: 你可以從影像快取中要求特定大小的影像。從照片內容載入影像後，快取會將它傳回給你。影像快取還會將最近要求過的影像儲存在記憶體中，所以如果你再次要求它們，就不需要重新載入。

source: Your view has an `image` [state property](glossary://state%20value) ready to hold the image after loading it.
de: Deine Ansicht besitzt die [Statuseigenschaft](glossary://state%20value) `image`, die das Bild bereithält, nachdem sie es geladen hat.
es: Tu vista tiene una [propiedad de estado](glossary://state%20value) `image` preparada para contener la imagen después de cargarla.
es_419: Tu visualización tiene una [propiedad de estado](glossary://state%20value) `image` lista para recibir la imagen después de cargarla.
fr: Ta vue a une [propriété d’état](glossary://state%20value) `image` prête à maintenir l’image après son chargement.
it: La tua vista ha una [proprietà di stato](glossary://state%20value) `image` che può ritenere l’immagine dopo che è stata caricata.
ja: ビューには、読み込んだあとでイメージを格納できる`image`（イメージ）[状態プロパティ](glossary://state%20value)があります。
ko: 보기에는 이미지를 로드한 후 보유할 준비가 된 `image` [상태 속성](glossary://state%20value)이 있습니다.
nl: Je weergave heeft een `image`-[statuseigenschap](glossary://state%20value) waarin de afbeelding kan worden bewaard nadat deze is geladen.
no: Visningen din har en `image`-[statusegenskap](glossary://state%20value) som er klar til å ta imot bildet når det er lastet inn.
pt: A visualização tem uma [propriedade de estado](glossary://state%20value) `image` pronta para conter a imagem depois de carregá‑la.
sv: Vyn har en `image`-[statusegenskap](glossary://state%20value) som är redo att ta emot bilden när den har lästs in.
th: มุมมองของคุณมี[คุณสมบัติสถานะ](glossary://state%20value) `image` ที่พร้อมสำหรับเก็บภาพหลังจากโหลด
tr: Görüntünde, yüklendikten sonra resmi tutmaya hazır olan bir `image` [durum özelliği](glossary://state%20value) vardır.
vi: Chế độ xem của bạn có một [thuộc tính trạng thái](glossary://state%20value) `image` sẵn sàng lưu giữ hình ảnh sau khi tải.
zh_cn: 视图有一个 `image` [状态属性](glossary://state%20value)，随时准备在图像载入完成后进行保存。
zh_tw: 你的顯示區有一個 `image` [狀態屬性](glossary://state%20value)，它準備好來保留載入後的影像。

source: It’s an [optional](glossary://optional) type — `Image?` — because you want it to start off without any value.
de: Dabei handelt sich um einen [optionalen](glossary://optional) Typ – `Image?` –, da du keinen Ausgangswert haben möchtest.
es: Se trata de un tipo [opcional](glossary://optional) (`Image?`) porque quieres que empiece sin ningún valor.
es_419: Se trata de una propiedad [opcional](glossary://optional) (`Image?`) porque iniciará sin ningún valor.
fr: Il s’agit d’un type [facultatif](glossary://optional), (`Image?`), car tu veux qu’il se lance sans aucune valeur.
it: È di tipo [opzionale](glossary://optional) (`Image?`) perché vuoi che venga avviato senza alcun valore.
ja: これは、[オプショナル](glossary://optional)型（`Image?`）です。値がなくても開始する必要があるためです。
ko: 사용자가 이를 값 없이 시작하도록 하려는 이유로 이는 [선택 사항](glossary://optional) 유형(`Image?`)입니다.
nl: De `image`-statuseigenschap is een [optioneel](glossary://optional) type (`Image?`) omdat je wilt dat deze zonder waarde begint.
no: Det er en [valgfri](glossary://optional) type – `Image?` – fordi du vil at den skal begynne uten en verdi.
pt: É um tipo — `Image?` — [opcional](glossary://optional) porque você quer que ele não tenha nenhum valor no início.
sv: Det är en [alternativ](glossary://optional) typ – `Image?` – eftersom du vill påbörja den utan något värde.
th: มุมมองนี้เป็นประเภท[แบบตัวเลือก](glossary://optional) นั่นคือ `Image?` เนื่องจากคุณจะต้องการใช้เพื่อเริ่มต้นโดยไม่มีค่าใดๆ
tr: Hiçbir değer olmadan başlamak istediğin için [isteğe bağlı](glossary://optional) bir tiptir (`Image?`).
vi: Đó là một kiểu [tùy chọn](glossary://optional) — `Image?` — vì bạn muốn bắt đầu mà không có bất kỳ giá trị nào.
zh_cn: 它是一个[可选](glossary://optional)类型（即 `Image?`），因为你需要它在没有任何初始值的状态下启动。
zh_tw: 它是一個[選擇性](glossary://optional)的類型（`Image?`），因為你希望它在沒有任價值的狀態下開始。

source: A view can use its [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) modifier to run some code [asynchronously](glossary://asynchronous%20process) whenever the view loads.
de: Eine Ansicht kann ihren Modifikator [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) verwenden, um beim Laden der Ansicht Code [asynchron](glossary://asynchronous%20process) auszuführen.
es: Una vista puede usar su modificador [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) para ejecutar algún código [asincrónicamente](glossary://asynchronous%20process) cada vez que se carga la vista.
es_419: Una visualización puede usar su modificador [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) para ejecutar código [asincrónico](glossary://asynchronous%20process) cada vez que la visualización se cargue.
fr: Une vue peut utiliser son modificateur [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) pour exécuter du code de manière [asynchrone](glossary://asynchronous%20process) chaque fois que la vue est chargée.
it: Una vista può utilizzare il proprio modificatore [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) per eseguire il codice [in modo asincrono](glossary://asynchronous%20process), ogni volta che la vista viene caricata.
ja: ビューの[task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:))（タスク）修飾子を使って、ビューが読み込まれるたびに一部のコードを[非同期的](glossary://asynchronous%20process)に実行することができます。
ko: 보기는 [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) 제어자를 사용하여, 보기가 로드될 때마다 [비동기식](glossary://asynchronous%20process)으로 일부 코드를 실행할 수 있습니다.
nl: Een weergave kan de modifier [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) gebruiken om code [asynchroon](glossary://asynchronous%20process) uit te voeren wanneer de weergave wordt geladen.
no: En visning kan bruke sin [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:))-modifikator til å kjøre kode [asynkront](glossary://asynchronous%20process) når visningen lastes inn.
pt: Uma visualização pode usar o modificador [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) para executar um código [assincronamente](glossary://asynchronous%20process) sempre que a visualização é carregada.
sv: En vy kan använda sin [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:))-modifierare till att köra en del kod [asynkront](glossary://asynchronous%20process) när vyerna blir inlästa.
th: มุมมองสามารถใช้ปุ่มปรับค่า [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) เพื่อรันโค้ดบางส่วน[แบบอะซิงโครนัส](glossary://asynchronous%20process)ทุกครั้งที่มุมมองโหลดได้
tr: Bir görüntü kendi [görev(öncelik:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) niteleyicisini görüntü her yüklendiğinde bazı kodları [eşzamansız olarak](glossary://asynchronous%20process) çalıştırmak için kullanabilir.
vi: Một chế độ xem có thể sử dụng trình sửa đổi [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) của chính mình để chạy một số mã [không đồng bộ](glossary://asynchronous%20process) bất kỳ lúc nào chế độ xem tải.
zh_cn: 视图可以使用它的 [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) 修饰符，来在视图载入时[异步](glossary://asynchronous%20process)运行一些代码。
zh_tw: 顯示區可以使用其 [task(priority:_:)](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) 修飾符，在每次載入顯示區時[非同步](glossary://asynchronous%20process)執行一些程式碼。

source: This is where you add code to request a high-resolution image from the cache for the photo asset, specifying the size you want.
de: Hier fügst du den Code ein, um für die Fotodatei ein hochauflösendes Bild aus dem Cache anzufordern und die gewünschte Größe festzulegen.
es: Aquí es donde añades el código para solicitar una imagen de alta resolución de la caché para el activo de foto, especificando el tamaño que quieres.
es_419: Aquí debes agregar el código y especificar el tamaño deseado para que la caché envíe una imagen de alta resolución del activo fotográfico.
fr: C’est ici que tu ajoutes du code pour demander une image en haute résolution au cache pour la ressource photo, en indiquant la taille souhaitée.
it: Qui aggiungerai il codice per richiedere un’immagine ad alta risoluzione dalla cache per la risorsa fotografica, specificandone le dimensioni.
ja: ここでは、希望するサイズを指定して、キャッシュのフォト素材の高解像度イメージをリクエストするコードを追加しましょう。
ko: 여기에서 코드를 추가하면 사진 항목의 캐시에 고해상도 이미지를 요청하고 원하는 크기를 지정할 수 있습니다.
nl: Hier voeg je code toe om een afbeelding met een hoge resolutie en een specifieke grootte op te vragen uit de cache voor het fotobestand.
no: Det er her du legger til kode for å be om et høyoppløst bilde fra bufferen for bilderessursen og angir størrelsen du ønsker.
pt: É aí que você adiciona código para solicitar uma imagem em alta resolução a partir do cache do recurso de foto, especificando o tamanho desejado.
sv: Det är här du lägger till kod för att begära en högupplöst bild från cachen för bildresursen och anger önskad storlek.
th: นี่คือที่ที่คุณใส่โค้ดเพื่อร้องขอภาพความละเอียดสูงจากแคชสำหรับแอสเซทรูปภาพโดยระบุขนาดที่คุณต้องการ
tr: Burası, istediğin büyüklüğü belirterek fotoğraf öğesi için önbellekten yüksek çözünürlüklü bir resim istemek için kod ekleyeceğin yerdir.
vi: Đây là nơi mà bạn thêm mã để yêu cầu hình ảnh có độ phân giải cao từ bộ nhớ đệm cho tài sản ảnh, chỉ định kích cỡ mà bạn muốn.
zh_cn: 你将在这里添加代码来从照片资源的缓存中请求高分辨率图像，并指定想要的大小。
zh_tw: 你可以在此處加入程式碼來從照片內容的快取中要求高解析度影像，並指定你想要的大小。

source: You also provide the cache with a [closure](glossary://closure) that contains code it can call when it has a `result`.
de: Darüber hinaus stellst du dem Cache einen [Funktionsabschluss](glossary://closure) mit Code zur Verfügung, den er aufrufen kann, wenn er einen `result` (Treffer) für dich hat.
es: También proporcionas a la caché una [clausura](glossary://closure) que contiene código que puede llamar cuando tiene un resultado (`result`).
es_419: También debes proporcionar a la caché un código con una [clausura](glossary://closure) que contenga código al que pueda llamar cuando tenga un resultado (`result`).
fr: Tu peux également fournir au cache une [clôture](glossary://closure) contenant du code qu’il peut appeler lorsqu’il a un `result`.
it: Puoi anche fornire alla cache una [chiusura](glossary://closure) che contiene il codice da richiamare quando è presente un `result`.
ja: また、`result`（結果）があるときに呼び出すことができるコードが含まれる[クロージャ](glossary://closure)を使ってキャッシュを用意しましょう。
ko: 사용자는 또한 [클로저](glossary://closure)를 캐시에 제공합니다. 클로저에는 캐시에 `result`가 있을 때 호출할 수 있는 코드가 포함되어 있습니다.
nl: Je geeft de cache ook een [closure](glossary://closure) met code die de cache kan aanroepen wanneer er een `result` voor je is.
no: Du gir også bufferen en [closure-blokk](glossary://closure) som inneholder kode den kan kalle når den har en `result`.
pt: Você também fornece ao cache um [encerramento](glossary://closure) que contém o código que ele pode chamar quando tiver um `result`.
sv: Du kan också tillhandahålla cachen med en [stängning](glossary://closure) som innehåller kod som den kan anropa när den har ett `result`.
th: คุณยังต้องระบุแคชพร้อม[การปิด](glossary://closure)ที่มีโค้ดที่สามารถเรียกใช้ได้เมื่อมี `result`
tr: Ayrıca, önbelleğe bir sonucu (`result`) olduğunda çağırabileceği kodu içeren bir [kapama](glossary://closure) da sunarsın.
vi: Bạn cũng có thể cung cấp cho bộ nhớ đệm một [bao đóng](glossary://closure) chứa mã mà bộ nhớ đệm có thể gọi khi có `result`.
zh_cn: 你还将为缓存提供[闭包](glossary://closure)，其中包含有 `result`（结果）时可以调用的代码。
zh_tw: 你還為快取提供了一個[閉包](glossary://closure)，其中包含它有 `result` 時可以呼叫的程式碼。
