Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..title
source: Capturing Photos
de: Fotos aufnehmen
es: Capturar fotos
es_419: Captura de fotos
fr: Prendre des photos
it: Scattare foto
ja: 写真を取り込む
ko: 사진 캡처하기
nl: Foto's vastleggen
no: Ta bilder
pt: Capturando Fotos
sv: Ta bilder
th: การถ่ายรูป
tr: Fotoğrafları Yakalama
vi: Chụp ảnh
zh_cn: 捕捉照片
zh_tw: 擷取照片

# GuideBook..WelcomeMessageCapturing Photos..title
source: Capturing Photos
de: Fotos aufnehmen
es: Capturar fotos
es_419: Captura de fotos
fr: Prendre des photos
it: Scattare foto
ja: 写真を取り込む
ko: 사진 캡처하기
nl: Foto's vastleggen
no: Ta bilder
pt: Capturando Fotos
sv: Ta bilder
th: การถ่ายรูป
tr: Fotoğrafları Yakalama
vi: Chụp ảnh
zh_cn: 捕捉照片
zh_tw: 擷取照片

# GuideBook..WelcomeMessageCapturing Photos..Paragraph0
source: Imagine the exciting things you could do with the camera in your own app! In this sample, you explore the building blocks of a camera app, and discover how you can use your SwiftUI skills to work with the camera and photo library.
de: Stell dir die aufregenden Sachen vor, die du mit der Kamera in deiner eigenen App machen könntest! In diesem Beispiel erforschst du die Komponenten der Kamera-App und lernst, wie du deine SwiftUI-Fähigkeiten einsetzen kannst, um mit der Kamera und der Fotomediathek zu arbeiten.
es: ¡Imagina todas las cosas emocionantes que podrías hacer con la cámara en tu propia app! En este ejemplo, explorarás los elementos básicos de una app de cámara y descubrirás cómo puedes usar tus conocimientos de SwiftUI para trabajar con la cámara y la fototeca.
es_419: ¡Imagina las cosas emocionantes que podrías hacer con una cámara en tu propia app! En esta muestra, explorarás los bloques de construcción de una app de cámara, y descubrirás cómo puedes usar tus conocimientos de SwiftUI para trabajar con la cámara y la fototeca.
fr: Imagine les choses passionnantes que tu pourrais faire avec l’appareil photo dans ta propre app ! Dans cet échantillon, tu exploreras les éléments de base d’une app d’appareil photo et tu découvriras comment utiliser tes compétences relatives à SwiftUI pour travailler avec l’appareil photo et la photothèque.
it: Immagina tutto ciò che potresti fare se la tua app avesse una fotocamera! In questo playground di esempio, scoprirai di più sui blocchi costitutivi di un’app Fotocamera e apprenderai come utilizzare le tue conoscenze di SwiftUI per utilizzare la fotocamera e la libreria di foto.
ja: 自分だけのAppでカメラを使ってできる、ワクワクすることを想像してみましょう! このサンプルでは、カメラAppの構築要素を見てみて、SwiftUIのスキルを使ってカメラとフォトライブラリを操作する方法を身に付けます。
ko: 나만의 앱에서 카메라로 할 수 있는 신나는 일을 상상해 보세요! 이 샘플에서는 카메라 앱의 구성요소를 살펴보고 SwiftUI 기술을 사용하여 카메라와 사진 보관함에서 작업하는 방법을 알아봅니다.
nl: Stel je eens voor welke spannende dingen je met de camera zou kunnen doen in je eigen app! In dit voorbeeld maak je kennis met de bouwstenen van een camera-app en ontdek je hoe je je SwiftUI-vaardigheden kunt gebruiken voor het werken met de camera en de fotobibliotheek.
no: Tenk på alle de spennende tingene du kan gjøre med kameraet i appen din! I dette eksempelet utforsker du byggeklossene for en kameraapp og finner ut hvordan du kan bruke SwiftUI-ferdighetene dine til å arbeide med kameraet og bildebiblioteket.
pt: Imagine que coisas legais você poderia fazer com a câmera no seu próprio app! Nesta amostra, você vai explorar os blocos de construção de um app de câmera e descobrir como usar suas habilidades de SwiftUI para trabalhar com a câmera e a fototeca.
sv: Föreställ dig vilka spännande saker du skulle kunna göra med din egen app! I det här exemplet utforskar du byggstenarna i en kameraapp och upptäcker hur du kan använda dina SwiftUI-färdigheter till att arbeta med kameran och bildbiblioteket.
th: ลองจินตนาการถึงเรื่องน่าตื่นเต้นที่คุณสามารถทำได้ด้วยกล้องในแอปของคุณเองดูสิ! ในตัวอย่างนี้ คุณจะได้สำรวจองค์ประกอบหลักของแอปกล้อง และค้นพบวิธีที่คุณสามารถใช้ทักษะ SwiftUI ของคุณเพื่อทำงานกับกล้องและคลังรูปภาพได้
tr: Kendi uygulamanda kamerayla yapabileceğin heyecan verici şeyleri hayal et! Bu örnekte, bir kamera uygulamasının yapı taşlarını öğrenecek ve kamerayla ve fotoğraf arşiviyle çalışmak için SwiftUI becerilerini nasıl kullanacağını keşfedeceksin.
vi: Hãy tưởng tượng những việc phấn khích mà bạn có thể thực hiện với camera trong ứng dụng của riêng mình! Trong mẫu này, bạn khám phá quá trình xây dựng một ứng dụng camera và khám phá cách mà bạn có thể sử dụng các kỹ năng SwiftUI để làm việc với camera và thư viện ảnh.
zh_cn: 想象一下使用你自己 App 中的相机能做到什么炫酷的事情！在本示例中，你将探索相机 App 的构建块，并了解如何通过 SwiftUI 技能使用相机和照片图库。
zh_tw: 想像一下你可以在自己的 App 中使用相機做些令人興奮的事！在此範例中，你將探索相機 App 的建構基礎，並瞭解如何使用你的 SwiftUI 技巧來使用相機和照片資料庫。

# GuideBook..Guide0..StepCapturing Photos..title
source: Capturing Photos
de: Fotos aufnehmen
es: Capturar fotos
es_419: Captura de fotos
fr: Prendre des photos
it: Scattare foto
ja: 写真を取り込む
ko: 사진 캡처하기
nl: Foto's vastleggen
no: Ta bilder
pt: Capturando Fotos
sv: Ta bilder
th: การถ่ายรูป
tr: Fotoğrafları Yakalama
vi: Chụp ảnh
zh_cn: 捕捉照片
zh_tw: 擷取照片

# GuideBook..Guide0..StepCapturing Photos..LearningCenterContent..Paragraph2
source: Welcome to Capturing Photos!
de: Willkommen bei „Fotos aufnehmen“!
es: ¡Te damos la bienvenida a “Capturar fotos”!
es_419: ¡Te damos la bienvenida a Captura de fotos!
fr: Bienvenue dans la prise de photos !
it: “Scattare foto” ti dà il benvenuto!
ja: ようこそ“写真を取り込む”へ!
ko: 사진 캡처하기에 입문하신 것을 환영합니다!
nl: Welkom bij Foto's vastleggen!
no: Velkommen til Ta bilder!
pt: Capturando Fotos!
sv: Välkommen till Ta bilder!
th: ยินดีต้อนรับสู่การถ่ายรูป!
tr: Fotoğrafları Yakalama’ya Hoş Geldin!
vi: Chào mừng đến Chụp ảnh!
zh_cn: 欢迎使用捕捉照片！
zh_tw: 歡迎來到「擷取照片！」

# GuideBook..Guide0..StepCapturing Photos..LearningCenterContent..Paragraph3
source: Think of the essential things a camera app should do:
de: Denke an die grundlegenden Funktionen einer Kamera-App:
es: Piensa en las cosas imprescindibles que debe hacer una app de cámara:
es_419: Imagina las cosas básicas que una app de cámara debería hacer:
fr: Réfléchis aux choses essentielles qu’une app d’appareil photo doit faire :
it: Prova a pensare alle funzionalità essenziali che dovrebbe avere un’app fotocamera:
ja: カメラAppに欠かせない機能と言えば、以下のようなものがあります:
ko: 카메라 앱이 갖추어야 할 필수 기능에 대해 생각해 보세요.
nl: Ga na welke dingen een camera moet kunnen:
no: Tenk på de viktigste tingene en kameraapp må kunne gjøre:
pt: Pense nas coisas essenciais que um app de câmera deve fazer:
sv: Tänk på de grundläggande sakerna som en kameraapp ska göra:
th: นึกถึงสิ่งสำคัญที่แอปกล้องควรทำ:
tr: Bir kamera uygulamasının yapması gereken önemli şeyleri düşün:
vi: Hãy nghĩ về những thứ thiết yếu mà một ứng dụng camera cần thực hiện:
zh_cn: 想一想相机 App 应该有的基本功能是：
zh_tw: 想想相機 App 應該做的基本事項：

source: Display live video from the camera in a viewfinder
de: Livevideo der Kamera in einem Sucher anzeigen
es: Visualizar el vídeo en directo de la cámara en un visor
es_419: Mostrar video en vivo de la cámara en un visor
fr: Afficher une vidéo en direct provenant de l’appareil photo dans un viseur
it: Mostrare video in diretta dalla fotocamera in un mirino
ja: カメラのライブ映像をファインダーに表示する
ko: 카메라의 라이브 영상을 뷰파인더에 표시하기
nl: Livevideo in de zoeker van de camera weergeven
no: Vise direktestrømmet video fra kameraet i en søker
pt: Mostrar um vídeo ao vivo da câmera em um visor
sv: Visa direktströmmad video från kameran i en sökare.
th: แสดงวิดีโอสดจากกล้องในช่องมองภาพ
tr: Vizörde kameradan canlı videoyu görüntüleme
vi: Hiển thị video trực tiếp từ camera trong kính ngắm
zh_cn: 在取景器中显示来自摄像头的实时视频
zh_tw: 從相機觀景窗顯示即時影片

source: Take a photo when you tap or click the shutter button
de: Beim Tippen oder Klicken auf die Auslösertaste ein Foto aufnehmen
es: Hacer una foto al tocar o hacer clic en el botón del obturador
es_419: Tomar una foto cuando toques o presiones el botón de obturador
fr: Prendre une photo lorsqu’on touche le bouton d’obturateur ou clique dessus
it: Scattare foto con il pulsante di scatto
ja: シャッターボタンをタップまたはクリックしたときに写真を撮影する
ko: 셔터 버튼을 탭 또는 클릭할 때 사진 촬영하기
nl: Een foto maken wanneer je op de sluiterknop tikt of klikt
no: Ta et bilde når du trykker eller klikker på lukkerknappen
pt: Tirar uma foto ao tocar ou clicar no botão obturador
sv: Ta en bild när du trycker eller klickar på slutarknappen.
th: ถ่ายรูปเมื่อคุณแตะหรือกดปุ่มชัตเตอร์
tr: Deklanşör düğmesine dokunduğunda veya tıkladığında fotoğraf çekme
vi: Chụp ảnh khi bạn chạm hoặc bấm vào nút chụp
zh_cn: 轻点或点按快门按钮时拍照
zh_tw: 點按快門按鈕時拍攝照片

source: Save your photo
de: Dein Foto sichern
es: Guardar las fotos
es_419: Guardar tu foto
fr: Enregistrer ta photo
it: Salvare foto
ja: 写真を保存する
ko: 사진 저장
nl: De foto bewaren
no: Arkivere bildet
pt: Salvar a foto
sv: Spara bilden.
th: บันทึกรูปภาพของคุณ
tr: Fotoğrafını kaydetme
vi: Lưu ảnh của bạn
zh_cn: 存储照片
zh_tw: 儲存照片

source: Browse and view the photos you’ve already taken
de: Deine bereits aufgenommenen Fotos durchstöbern
es: Explorar y mostrar las fotos que ya se han hecho
es_419: Explorar y visualizar las fotos que has tomado
fr: Parcourir et afficher les photos que tu as prises
it: Sfogliare e mostrare le foto che hai già scattato
ja: 撮影済みの写真をブラウズする/表示する
ko: 촬영한 사진 찾아보기 및 보기
nl: Door foto's bladeren die je hebt gemaakt en deze foto's bekijken
no: Bla gjennom og vise bildene du har tatt
pt: Explorar e visualizar as fotos que você já tirou
sv: Bläddra bland och visa bilderna du redan har tagit.
th: เลือกหาและดูรูปภาพที่คุณถ่ายไว้แล้ว
tr: Daha önce çektiğin fotoğrafları tarama ve görüntüleme
vi: Duyệt và xem ảnh mà bạn đã chụp
zh_cn: 浏览和查看已拍摄的照片
zh_tw: 瀏覽並檢視你已經拍攝的照片

# GuideBook..Guide0..StepCapturing Photos..LearningCenterContent..Paragraph8
source: You’ll find out how to do all of these — and more. You’ll learn about the data objects your app uses, and how to manage the flow of data between them and the app’s user interface.
de: Du wirst herausfinden, wie all dies umgesetzt wird – und mehr. Du erfährst von Datenobjekten, die deine App verwendet, und wie du den Datenstrom zwischen diesen und der Benutzeroberfläche der App verwaltest.
es: Descubrirás cómo hacer todo esto (y mucho más). Aprenderás sobre los objetos de datos que utiliza tu app y cómo gestionar el flujo de datos entre ellos y la interfaz de usuario de la app.
es_419: Descubrirás cómo hacer todo esto… ¡y más! Además, aprenderás sobre los objetos de datos que tu app usa, y cómo administrar el flujo de datos entre ellos y la interfaz de usuario de la app.
fr: Tu apprendras comment faire tout cela, et bien plus encore. Tu découvriras les objets de données que ton app utilise et de quelle manière gérer le flux de données entre ceux-ci et l’interface utilisateur de ton app.
it: Imparerai a programmarle tutte, insieme a molte altre. Acquisirai, inoltre, informazioni sugli oggetti dati utilizzati dalla tua app e su come gestire il flusso di dati tra loro e l’interfaccia utente dell’app.
ja: これらのすべての機能を実現するにはどうすればよいかなどを探りましょう。ここでは、Appで使用するデータオブジェクトについて学びます。また、オブジェクトとAppのユーザインターフェイスの間のフローを管理する方法も学びます。
ko: 이러한 모든 기능을 실현하려면 어떻게 해야 하는지 알아보세요. 여기에서는 앱에서 사용하는 데이터 객체 및 객체와 앱의 사용자 인터페이스 간의 데이터 흐름을 관리하는 방법에 대해 배우게 될 거예요.
nl: Je ontdekt hoe je al deze dingen kunt doen, en meer. Je leert welke gegevensobjecten je app gebruikt en hoe je de gegevensstroom tussen deze objecten en de gebruikersinterface van de app beheert.
no: Du kommer til å finne ut hvordan du kan gjøre alt dette og mye mer. Du kommer til å lære om dataobjektene som appen bruker, og hvordan du håndterer dataflyten mellom dem og appens brukergrensesnitt.
pt: Você descobrirá como fazer tudo isso e muito mais. Você aprenderá sobre os objetos de dados que o app usa e como gerenciar o fluxo de dados entre eles e a interface de usuário do app.
sv: Du upptäcker hur du kan göra allt det här och mycket mer. Du lär dig om de dataobjekt som appen använder och hur du hanterar dataflödet mellan dem och appens användargränssnitt.
th: คุณจะได้ค้นพบวิธีการทำสิ่งต่างๆ เหล่านี้ทั้งหมด และอื่นๆ อีกมากมาย คุณจะได้เรียนรู้เกี่ยวกับวัตถุข้อมูลที่แอปของคุณใช้ รวมถึงวิธีจัดการลำดับของข้อมูลระหว่างวัตถุข้อมูลเหล่านั้นกับอินเทอร์เฟซผู้ใช้ของแอป
tr: Bunların tümünün nasıl yapılacağını ve daha fazlasını öğreneceksin. Uygulamanın kullandığı veri nesneleri hakkında bilgi edinecek ve bunlarla uygulamanın kullanıcı arayüzü arasındaki veri akışını nasıl yöneteceğini öğreneceksin.
vi: Bạn sẽ tìm hiểu cách thực hiện tất cả những việc này — và nhiều hơn nữa. Bạn sẽ tìm hiểu về các đối tượng dữ liệu mà ứng dụng sử dụng, cũng như cách quản lý luồng dữ liệu giữa chúng và giao diện người dùng của ứng dụng.
zh_cn: 你将学会如何做到这一切，甚至更多。你将了解 App 使用的数据对象，以及如何管理对象和 App 用户界面之间的数据流动。
zh_tw: 你將瞭解如何完成所有這些工作，甚至更多。你將學習到你的 App 所使用的資料物件，以及如何管理它們與 App 使用者介面之間的資料流。

# GuideBook..Guide0..StepCapturing Photos..LearningCenterContent..Paragraph9
source: Before you get started, select App Preview and take a moment to explore your camera app and take a few photos.
de: Bevor es losgeht, wähle die App-Vorschau aus und nimm dir etwas Zeit, um deine Kamera-App zu erkunden und ein paar Fotos aufzunehmen.
es: Antes de empezar, selecciona Previsualización y tómate un momento para explorar tu app de cámara y hacer unas cuantas fotos.
es_419: Antes de empezar, selecciona Previsualización y tómate un momento para explorar tu app de cámara y tomar algunas fotos.
fr: Avant de commencer, sélectionne Aperçu de l’app et prends un moment pour explorer ton app d’appareil photo et prendre quelques photos.
it: Prima di iniziare, seleziona “Anteprima app” ed esplora le funzionalità della tua app fotocamera in azione, scattando alcune foto.
ja: 始める前に、まずはAppのプレビューを選択し、少し時間を取ってカメラAppについて調べて、何枚か写真を撮影してみましょう。
ko: 시작하기 전에 ’앱 미리보기’를 선택하고 작동 중인 카메라 앱을 잠시 살펴보고 사진을 몇 장 찍어 보세요!
nl: Selecteer voordat je aan de slag gaat 'Appvoorvertoning' en neem even de tijd om je camera-app te verkennen en een paar foto's te maken.
no: Før du begynner, velger du Appforhåndsvisning og bruker litt tid på å utforske kameraappen og ta noen bilder.
pt: Antes de começar, mude para a Pré-visualização do App e passe um tempo explorando o app de câmera e tirando algumas fotos.
sv: Välj Appförhandsvisning innan du börjar och ägna några ögonblick åt att undersöka hur kameraappen fungerar och ta några bilder.
th: ก่อนที่คุณจะเริ่ม ให้เลือกการแสดงตัวอย่างแอปและใช้เวลาสักครู่ในการสำรวจแอปกล้องของคุณ แล้วลองถ่ายสักสองสามรูป
tr: Başlamadan önce, Uygulama Önizleme’yi seç ve kamera uygulamanı keşfetmek için biraz zaman ayırıp birkaç fotoğraf çek.
vi: Trước khi bạn bắt đầu, hãy chọn Bản xem trước ứng dụng và dành thời gian để khám phá ứng dụng camera và chụp một vài bức ảnh.
zh_cn: 开始前，选择“App 预览”，然后花点时间探索相机 App，并拍几张照片吧。
zh_tw: 在你開始前，請選擇「App 預覽」並且花一點時間來探索相機 App 並且拍一些照片。

source: Start Walkthrough
de: Schritt-für-Schritt-Anleitung starten
es: Iniciar el tutorial
es_419: Iniciar tutorial
fr: Commencer les explications
it: Avvia la guida passo passo
ja: ガイドを開始
ko: 가이드 시작하기
no: Start gjennomgangen
pt: Iniciar Passo a Passo
sv: Starta genomgången
th: เริ่มการสาธิต
tr: Kılavuzu Başlat
vi: Bắt đầu hướng dẫn
zh_cn: 开始演示
zh_tw: 開始演練

source: AX description for button
de: Bedienungshilfen-Beschreibung für Taste
es: Descripción de accesibilidad del botón
es_419: Descripción de accesibilidad del botón
fr: Description d’accessibilité pour le bouton
it: Descrizione di accessibilità per il pulsante
ja: ボタンのアクセシビリティの説明
ko: 버튼에 대한 손쉬운 사용 설명
nl: Toegankelijkheidsbeschrijving voor knop
no: Tilgjengelighetsbeskrivelse for knapp
pt: Descrição de acessibilidade do botão
sv: Hjälpmedelsbeskrivning för knapp
th: คำอธิบาย AX สำหรับปุ่ม
tr: Düğme için erişilebilirlik açıklaması
vi: Mô tả AX cho nút
zh_cn: 按钮辅助功能描述
zh_tw: 按鈕的 AX 描述

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..title
source: Previewing the Camera Output
de: Vorschau der Kameraausgabe anzeigen
es: Previsualizar la salida de la cámara
es_419: Previsualizar la salida de la cámara
fr: Aperçu de la sortie de l’appareil photo
it: Vedere l’anteprima dell’output della fotocamera
ja: カメラ出力をプレビューする
ko: 카메라 출력 미리보기
nl: Een voorvertoning van de camera-uitvoer bekijken
no: Forhåndsvise kamerautdataene
pt: Pré‑visualizando a Saída da Câmera
sv: Förhandsvisa kamerautmatningen
th: การแสดงตัวอย่าง output ของกล้อง
tr: Kamera Çıktısını Önizleme
vi: Xem trước Đầu ra camera
zh_cn: 预览相机输出
zh_tw: 預覽相機輸出

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..Paragraph10
source: Your camera’s video output sends a continuous stream of individual images (video frames). You display these in a viewfinder so you can see exactly what the camera is looking at before composing your shot and taking a photo.
de: Die Videoausgabe deiner Kamera sendet einen kontinuierlichen Strom aus einzelnen Bildern (Einzelbilder des Videos). Du zeigst sie in einem Sucher an, damit du genau sehen kannst, worauf deine Kamera gerichtet ist, bevor du das Motiv wählst und das Foto aufnimmst.
es: La salida de vídeo de tu cámara envía una secuencia continua de imágenes individuales (fotogramas de vídeo). Estos se muestran en un visor para que puedas ver exactamente lo que la cámara está viendo antes de componer la toma y hacer la foto.
es_419: La salida de video de tu cámara envía un flujo continuo de imágenes individuales (cuadros de video), y tú las muestras en el visor para ver exactamente lo que la cámara está viendo antes de componer tu toma y tomar tu foto.
fr: La sortie vidéo de ton appareil photo envoie un flux continu d’images individuelles (images vidéo). Tu les affiches dans un viseur pour que tu puisses voir exactement ce qui se trouve dans le cadre de l’appareil photo avant de composer ton image et prendre une photo.
it: L’output video della tua fotocamera invia un flusso continuo di immagini singole, dette “fotogrammi video”, che puoi visualizzare in un mirino. Così, prima di comporre l’immagine e scattare una foto, potrai vedere esattamente gli elementi su cui sta puntando la fotocamera.
ja: カメラのビデオ出力から、個々のイメージ（ビデオフレーム）のストリームが継続的に送信されます。これらをファインダーに表示して、構図を決めて写真を撮影する前にカメラが捕らえているものを正確に確認できるようにしましょう。
ko: 카메라의 비디오 출력은 개별 이미지(비디오 프레임)의 연속 스트림을 생성합니다. 이는 뷰파인더에 표시되므로 구도를 잡고 사진을 찍기 전에 카메라가 보고 있는 것을 정확히 볼 수 있습니다.
nl: De video-uitvoer van je camera verstuurt een ononderbroken stroom van afzonderlijke afbeeldingen (videobeelden). Je geeft deze afbeeldingen weer in een zoeker, zodat je precies kunt zien waar de camera op gericht is voordat je een compositie maakt en een foto neemt.
no: Kameraet videoutdata sender en kontinuerlig strøm av individuelle bilder (videobilder). Disse viser du i en søker, slik at du kan se det kameraet ser før du velger utsnittet og tar et bilde.
pt: A saída de vídeo da câmera envia um fluxo contínuo de imagens individuais (quadros de vídeo). Elas são mostradas em um visor para que você possa ver exatamente o que a câmera está vendo antes de compor a cena e tirar uma foto.
sv: Kamerans videoutmatning skickar en kontinuerlig ström med enskilda bilder (videobildrutor). Du visar dem i en sökare så att du ser exakt vad kameran tittar på innan du arrangerar tagningen och tar en bild.
th: output วิดีโอของกล้องของคุณจะส่งการสตรีมต่อเนื่องของแต่ละภาพ (เฟรมวิดีโอ) คุณแสดงภาพเหล่านี้ในช่องมองภาพ คุณจึงสามารถดูสิ่งที่กล้องกำลังมองอยู่ได้อย่างชัดเจนก่อนที่จะจัดองค์ประกอบภาพของคุณและถ่ายรูป
tr: Kameranın video çıktısı, ayrı ayrı görüntülerden oluşan sürekli bir akış (video kareleri) gönderir. Çekimini oluşturup fotoğrafını çekmeden önce kameranın neye baktığını tam olarak görebilmen için bunları bir vizörde görüntülersin.
vi: Đầu ra video của camera gửi một luồng liên tục gồm các hình ảnh riêng lẻ (khung hình video). Bạn hiển thị những hình ảnh này trong một kính ngắm để có thể nhìn thấy chính xác những gì mà camera đang hướng vào trước khi tạo bố cục bức ảnh và chụp ảnh.
zh_cn: 相机的视频输出会发送连续的单个图像流（视频帧）。你需要将它们显示在取景器中，以便能够看到相机所捕捉到的准确内容，然后再进行画面构图和拍摄。
zh_tw: 相機的影片輸出會傳送單張影像（視訊影格）的連續串流。這些內容會顯示在觀景窗中，所以在構圖和拍照之前，你可以準確地看到相機正在對準的畫面。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..Paragraph11
source: Discover more about how this works. 🎞
de: Erfahre mehr darüber, wie das funktioniert. 🎞
es: Descubre más sobre cómo funciona esto. 🎞
es_419: Obtén detalles sobre cómo funciona esto. 🎞
fr: Découvre davantage d’informations sur la façon dont cela fonctionne. 🎞
it: Scopri come funziona. 🎞
ja: この仕組みを詳しく見てみましょう。🎞
ko: 이것이 어떻게 작동하는지 자세히 알아보세요. 🎞
nl: Ontdek meer over hoe dit werkt. 🎞
no: Finn ut mer om hvordan dette fungerer. 🎞
pt: Descubra mais sobre como isso funciona. 🎞
sv: Upptäck mer om hur det här fungerar. 🎞
th: ค้นพบเพิ่มเติมเกี่ยวกับการทำงานของสิ่งนี้ 🎞
tr: Bunun nasıl çalıştığıyla ilgili daha fazlasını keşfet. 🎞
vi: Khám phá thêm về cách thức hoạt động. 🎞
zh_cn: 进一步探索工作原理。🎞
zh_tw: 進一步探索這是如何運作的。🎞

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..TaskusingCamera..title
source: Using the Camera
de: Die Kamera verwenden
es: Usar la cámara
es_419: Usar la cámara
fr: Utilisation de l’appareil photo
it: Utilizzare la fotocamera
ja: カメラを使う
ko: 카메라 사용하기
nl: De camera gebruiken
no: Bruke kameraet
pt: Usando a Câmera
sv: Använda kameran
th: การใช้กล้อง
tr: Kamerayı Kullanma
vi: Sử dụng Camera
zh_cn: 使用相机
zh_tw: 使用相機

source: Learn about the camera in your data model.
de: Erfahre mehr über die Kamera in deinem Datenmodell.
es: Aprende sobre la cámara en tu modelo de datos.
es_419: Obtén información sobre la cámara en tu modelo de datos.
fr: Obtiens des informations sur l’appareil photo dans ton modèle de données.
it: Scopri di più sulla fotocamera in relazione al tuo modello di dati.
ja: データモデルのカメラについて学びましょう。
ko: 데이터 모델의 카메라에 관해 배워보세요.
nl: Leer over de camera in je gegevensmodel.
no: Lær mer om kameraet i datamodellen din.
pt: Saiba mais sobre a câmera no modelo de dados.
sv: Läs mer om kameran i din datamodell.
th: เรียนรู้เกี่ยวกับกล้องในโมเดลข้อมูลของคุณ
tr: Veri modelindeki kamera hakkında bilgi edin.
vi: Tìm hiểu thêm về camera trong mô hình dữ liệu của bạn.
zh_cn: 了解数据模型中的相机。
zh_tw: 瞭解資料模型中的相機。
