Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Yes, you no longer want a fixed [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) size for each photo. Instead, the width of the view and the number of columns in the grid determine the image size.
de: Genau, du möchtest keine feste [Rahmen](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))größe mehr für jedes Foto haben. Stattdessen sollen die Breite der Ansicht und die Anzahl der Spalten in deinem Raster die Bildgröße bestimmen.
es: Sí, ya no quieres un tamaño fijo de [marco](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) para cada foto. En su lugar, la anchura de la vista y el número de columnas de la cuadrícula determinan el tamaño de la imagen.
es_419: Así es, ya no debes usar un tamaño de [cuadro](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) fijo para cada foto. En lugar de eso, el tamaño de la imagen está determinado por el ancho de la visualización y la cantidad de columnas en la cuadrícula.
fr: En effet, tu ne veux plus de taille fixe pour le [cadre](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) de chaque photo. Au lieu de cela, la largeur de la vue et le nombre de colonnes de la grille déterminent la taille de l’image.
it: Esatto! Ora non vuoi più che le dimensioni del [riquadro](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) di ciascuna foto siano fisse. Al contrario, vuoi che la larghezza della vista e il numero di colonne nella griglia determinino le dimensioni dell’immagine.
ja: そう、それぞれの写真の固定の[frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))（フレーム）サイズはもういりませんよね。代わりに、ビューの幅とグリッド内の列数によって、イメージのサイズが決まります。
ko: 그렇습니다. 각각의 사진에 고정된 [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) 크기는 필요하지 않죠. 이제 보기의 너비와 격자에 있는 열의 개수가 이미지 크기를 결정합니다.
nl: Inderdaad, je wilt geen vaste [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))grootte meer voor elke foto. In plaats daarvan bepalen de breedte van de weergave en het aantal kolommen in het raster de grootte van de afbeelding.
no: Ja, du vil ikke lenger ha en fast [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))-størrelse for hvert bilde. I stedet skal bredden på visningen og antall kolonner i rutenettet bestemme bildestørrelsen.
pt: Sim, você não quer mais um tamanho fixo de [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) para cada foto. Em vez disso, o tamanho da imagem é determinado pela largura da visualização e o número de colunas na grade.
sv: Ja, du vill inte längre ha en fast [ram](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))storlek för varje bild. Istället avgörs bildstorleken av bredden på vyn och antalet kolumner i rutnätet.
th: ใช่ คุณไม่ต้องการขนาด[กรอบ](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))ที่คงที่ของรูปภาพแต่ละรูปอีกต่อไป แต่ความกว้างของมุมมองและจำนวนคอลัมน์ในตารางจะกำหนดขนาดของภาพแทน
tr: Evet, artık her fotoğraf için sabit bir [çerçeve](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) büyüklüğü istemiyorsun. Bunun yerine, görüntü büyüklüğünü görüntünün genişliği ve ızgaradaki sütun sayısı belirler.
vi: Đúng, bạn không muốn sử dụng kích cỡ [khung hình](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) cố định cho từng ảnh nữa. Thay vào đó, chiều rộng của chế độ xem và số lượng cột trong lưới xác định kích cỡ hình ảnh.
zh_cn: 是的，你不再想要每张照片都是固定 [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:))（帧）大小，而是让视图的宽度和网格中的列数来确定图像的大小。
zh_tw: 是的，你不再需要每張照片的固定 [frame](doc://com.apple.documentation/documentation/swiftui/view/frame(width:height:alignment:)) 大小。相反地，顯示區的寬度和網格中的直欄數決定了影像大小。

source: Comment out the following line, as shown, so that each photo is free to occupy as much space as possible:
de: Kommentiere folgende Zeile wie gezeigt aus. Damit kann jedes Foto so viel Platz einnehmen, wie es benötigt:
es: Marca como comentario la siguiente línea, tal y como se muestra, para que cada foto ocupe todo el espacio posible:
es_419: Marca como comentario la siguiente línea como se muestra para que cada foto pueda ocupar tanto espacio como sea posible:
fr: Commente la ligne suivante, comme indiqué, pour que chaque photo puisse occuper autant d’espace que possible :
it: Converti la riga seguente in commento, come mostrato, per fare in modo che ciascuna foto possa occupare quanto più spazio possibile:
ja: 示されているように次の行をコメントアウトして、それぞれの写真にできるだけ多くの領域を自由に占有できるようにしましょう:
ko: 각 사진이 가능한 한 많은 공간을 차지할 수 있도록 다음 줄을 표시된 대로 주석 처리해 보세요.
nl: Commentarieer de volgende regel zoals weergegeven uit, zodat elke foto zoveel ruimte in beslag kan nemen als nodig is:
no: Kommenter ut følgende linje, som vist, slik at hvert bilde kan bruke så mye plass som mulig:
pt: Comente a linha a seguir, como mostrado, para que cada foto tenha liberdade para ocupar o máximo de espaço possível:
sv: Kommentera bort den följande raden, på det sätt som visas, så att varje enskild bild kan ta upp så mycket utrymme som möjligt:
th: ทำให้บรรทัดต่อไปนี้เป็นความคิดเห็นตามที่แสดงเพื่อให้รูปภาพแต่ละรูปใช้พื้นที่ว่างได้มากเท่าที่เป็นไปได้:
tr: Aşağıdaki satırı gösterildiği şekilde dışarıda bırak, böylece her fotoğraf mümkün olabildiğince fazla yer kaplayabilir:
vi: Loại bỏ dòng sau đây, như minh họa, sao cho từng ảnh tự do chiếm hữu không gian nhiều nhất có thể:
zh_cn: 注释掉下面显示的这一行，让每张照片都可以自由占据所需要的空间：
zh_tw: 在下列幾行中加入註解，這樣每張照片都可以盡可能使用最多的空間：

source: Open your photo gallery again and you’ll see that each photo now fills the column width.
de: Öffne deine Fotogalerie noch einmal und wie du siehst, füllt jedes Foto nun die Spaltenbreite aus.
es: Vuelve a abrir tu galería de fotos y verás que ahora cada foto ocupa todo el ancho de la columna.
es_419: Abre tu galería de fotos nuevamente y verás que ahora cada foto llena su columna a lo ancho.
fr: Ouvre ta galerie de photos une fois de plus et observe la façon dont chaque photo remplit désormais la largeur de la colonne.
it: Apri di nuovo la galleria fotografica e vedrai che tutte le foto ora occupano l’intera larghezza.
ja: もう一度フォトギャラリーを開いてみましょう。それぞれの写真が列幅いっぱいに表示されていますね?
ko: 사진 갤러리를 다시 열면 각각의 사진이 이제 열 너비를 채우는 것을 볼 수 있습니다.
nl: Open de fotogalerie opnieuw. Zoals je ziet, vult elke foto nu de volledige breedte van de kolom.
no: Åpne bildegalleriet igjen for å se at hvert bilde nå fyller kolonnebredden.
pt: Abra novamente a galeria de fotos e você verá que cada foto agora preenche a largura da coluna.
sv: Öppna bildgalleriet igen så ser du hur varenda bild nu fyller kolumnbredden.
th: เปิดแกลเลอรี่รูปภาพของคุณอีกครั้งแล้วคุณจะเห็นว่ารูปภาพแต่ละรูปเต็มความกว้างของคอลัมน์แล้วในตอนนี้
tr: Fotoğraf galerini yeniden aç, her bir fotoğrafın artık sütun genişliğini doldurduğunu göreceksin.
vi: Mở lại phòng trưng bày ảnh và bạn sẽ thấy rằng từng ảnh bây giờ phủ kín chiều rộng cột.
zh_cn: 重新打开照片画廊，现在你将看到每张照片填满了列的宽度。
zh_tw: 再次打開你的照片圖庫，你會看到每張照片現在都填滿了寬度。

source: Try making your view wider. What do you notice happens?
de: Versuche, deine Ansicht zu verbreitern. Fällt dir auf, was passiert?
es: Intenta hacer más ancha tu vista. ¿Notas qué ocurre?
es_419: Intenta ampliar el ancho de tu visualización. ¿Qué pasa?
fr: Essaie d’élargir ta vue. Qu’as-tu remarqué ?
it: Se adesso provi ad allargare la vista, che cosa succede?
ja: ビューの幅を広げてみましょう。どうなりますか?
ko: 보기를 더 넓게 해 보세요. 어떤 일이 생기나요?
nl: Maak de weergave breder. Wat gebeurt er?
no: Prøv å gjøre visningen bredere. Hva legger du merke til?
pt: Tente tornar sua visualização maior. O que você percebe que acontece?
sv: Prova att göra vyn bredare. Vad lägger du märke till?
th: ลองทำให้มุมมองของคุณกว้างขึ้น คุณสังเกตเห็นว่าเกิดอะไรขึ้นบ้าง
tr: Görüntünü daha geniş hâle getirmeyi dene. Ne olduğunu fark ettin?
vi: Thử làm cho chế độ xem của bạn rộng hơn. Bạn nhận thấy điều gì xảy ra?
zh_cn: 试试将视图变宽。注意到发生什么了吗？
zh_tw: 嘗試讓你的顯示區變寬一些。你注意到發生了什麼嗎？

source: Look carefully at your new fixed columns and you’ll notice that they have space between them, but none on either side. Looking at the code, can you see why?
de: Sieh dir deine neuen festen Spalten genau an. Hast du bemerkt, dass sich zwischen ihnen ein Abstand befindet, aber nicht auf jeder Seite? Kannst du auf Grundlage des Codes sagen, warum das so ist?
es: Fíjate bien en tus nuevas columnas fijas y verás que tienen espacio entre ellas, pero ninguno a ambos lados. Mirando el código, ¿puedes ver por qué?
es_419: Fíjate bien en tus nuevas columnas fijas y verás que hay un espacio entre ellas, pero no junto a los bordes exteriores. Y ahora fíjate en el código, ¿reconoces por qué ocurre eso?
fr: Observe attentivement tes nouvelles colonnes fixes et remarque la façon dont elles sont désormais espacées entre elles, mais n’ont plus d’espace autour. En regardant ton code, saurais-tu dire pourquoi ?
it: Osservando attentamente le tue nuove colonne fisse, noterai che è presente uno spazio tra loro ma non da entrambi i lati. Sei in grado di capire il perché analizzando il codice?
ja: 新しい固定の列をよく見てください。列と列の間には間隔がありますが、両脇にはありませんね? コードを見てみましょう。なぜだか分かりますか?
ko: 새로운 고정 열을 잘 살펴보면 열 사이에 공간이 있지만 양쪽 가장자리는 그렇지 않은 것을 알 수 있습니다. 코드를 보면 그 이유를 알 수 있나요?
nl: Bekijk de nieuwe vaste kolommen eens nauwkeurig. Zoals je ziet, is er ruimte aanwezig tussen de kolommen, maar niet aan de zijkanten van de kolommen. Kun je in de code zien waardoor dit komt?
no: Se nøye på de nye faste kolonnene. Som du ser er det mellomrom mellom dem, men ikke på noen av sidene. Kan du finne ut hvorfor ved å studere koden?
pt: Olhe cuidadosamente para as novas colunas fixas e você perceberá que há espaço entre elas, mas nenhum espaço nos lados. Observando o código, você enxerga o motivo?
sv: Titta noga på de nya fasta kolumnerna och lägg märke till att det finns ett tomrum mellan dem, men inget på vardera sida. Kan du se varför när du tittar på koden?
th: ดูคอลัมน์ใหม่ที่มีขนาดคงที่ของคุณอย่างรอบคอบ แล้วคุณจะสังเกตเห็นว่าคอลัมน์เหล่านั้นมีพื้นที่ว่างระหว่างคอลัมน์ แต่ไม่มีพื้นที่ว่างที่ด้านข้างทั้งสองข้าง ให้ดูที่โค้ด คุณเห็นไหมว่าทำไม
tr: Yeni sabit sütunlarına dikkatle bak, aralarında boşluk olduğunu ancak iki yanlarda olmadığını fark edeceksin. Koda baktığında nedenini görebiliyor musun?
vi: Hãy xem kỹ các cột có chiều rộng cố định mới và bạn sẽ nhận thấy rằng chúng có khoảng trống ở giữa, nhưng ở hai cạnh lại không có. Nhìn vào mã, bạn có thể biết tại sao không?
zh_cn: 仔细查看新的固定列，你会注意到列之间有空隙，但两侧都没有。看看代码，你知道为什么吗？
zh_tw: 仔細查看新的固定直欄，你會注意到它們之間有空間，但兩側都沒有。看一下程式碼，你能明白為什麼嗎？

source: Change the view’s padding so it’s all around instead of just vertical:
de: Ändere den Randabstand der Ansicht, damit du überall und nicht nur vertikal einen Rand hast:
es: Cambia el relleno de la vista para que esté en todo su contorno en lugar de solo en vertical:
es_419: Cambia el relleno de la visualización para que esté alrededor de esta, y no sólo verticalmente:
fr: Modifie le remplissage de la vue pour qu’elle soit un peu partout et non juste verticale :
it: Modifica la spaziatura interna della vista in modo che non sia soltanto verticale ma sia anche distribuita in modo uniforme:
ja: ビューのpadding（パディング）を、縦方向だけでなく、全方向に変更しましょう:
ko: 보기의 여백을 변경해 여백이 수직만이 아닌 주위 전체에 표시되도록 하세요.
nl: Wijzig de padding van de weergave. Zorg dat er niet alleen padding in verticale richting, maar ook in horizontale richting wordt toegepast:
no: Endre visningens utfylling, slik at den brukes overalt, ikke bare vertikalt:
pt: Mude o preenchimento da visualização para que ele ocorra de todos os lados, em vez de somente na vertical:
sv: Ändra vyns tomrum så att det finns överallt istället för bara vertikalt:
th: เปลี่ยนช่องว่างภายในของมุมมองเพื่อให้อยู่รอบๆ แทนที่จะอยู่เพียงแค่ในแนวตั้ง:
tr: Yalnızca düşey yerine her yerde olması için görüntünün boşluğunu değiştir:
vi: Thay đổi phần đệm của chế độ xem để bao quanh toàn bộ thay vì chỉ chiều dọc:
zh_cn: 更改视图的填充，将它应用到四周，而不是仅应用到垂直方向：
zh_tw: 更改顯示器的填充，使其在位於四周而不是只有垂直：

source: Some further things to try:
de: Weitere Dinge, die du ausprobieren solltest:
es: Algunas cosas más para probar:
es_419: Otras cosas que puedes intentar:
fr: Voici d’autres choses à essayer :
it: Ecco un paio di altre cose da provare:
ja: さらに、次のことを試してみましょう:
ko: 다음의 심화 항목을 연습해 보세요.
nl: Andere dingen die je kunt proberen:
no: Noen flere ting du kan prøve:
pt: Mais algumas coisas para experimentar:
sv: Några fler saker du kan prova:
th: สิ่งอื่นๆ ที่ควรลองเพิ่มเติม:
tr: Daha fazla denenebilecekler şu şekildedir:
vi: Một số việc khác nên thử:
zh_cn: 还可以尝试一些更深入的操作：
zh_tw: 要進一步嘗試的事項：

source: Add more grid items for additional columns.
de: Füge weitere Rasterobjekte für zusätzliche Spalten hinzu.
es: Añade más ítems de rejilla para columnas adicionales.
es_419: Agrega más elementos de cuadrícula para las columnas adicionales.
fr: Ajoute davantage d’éléments de grille pour des colonnes supplémentaires.
it: Aggiungi più elementi griglia per ottenere altre colonne.
ja: 追加列にグリッド項目を追加しましょう。
ko: 추가된 열에 더 많은 격자 항목을 추가하세요.
nl: Meer rasteronderdelen toevoegen voor extra kolommen.
no: Legg til flere rutenettobjekter for flere kolonner.
pt: Adicione mais itens de grade para colunas adicionais.
sv: Lägg till fler rutnätsobjekt för ytterligare kolumner.
th: เพิ่มรายการตารางมากขึ้นสำหรับคอลัมน์เพิ่มเติม
tr: Ek sütunlar için daha fazla kareli alan öğesi ekle.
vi: Bổ sung thêm mục lưới cho các cột bổ sung.
zh_cn: 再添加一些网格项，以显示更多列。
zh_tw: 為其他直欄加入更多網格項目。

source: Change the value returned by your `imageSize` property to obtain higher-resolution images for your fixed grid.
de: Ändere den Wert, der von der Eigenschaft `imageSize` (Bildgröße) zurückgegeben wird, um Bilder mit höherer Auflösung für dein festes Raster zu erhalten.
es: Cambia el valor devuelto por tu propiedad `imageSize` para obtener imágenes de mayor resolución para tu cuadrícula fija.
es_419: Cambia el valor devuelto por tu propiedad `imageSize` para obtener imágenes de mayor resolución en tu cuadrícula de tamaño fijo.
fr: Modifie la valeur renvoyée par ta propriété `imageSize` pour obtenir des images de meilleure résolution pour ta grille fixe.
it: Modifica il valore restituito dalla proprietà `imageSize` per ottenere immagini con risoluzione più alta per la tua griglia fissa.
ja: `imageSize`（イメージサイズ）プロパティから返される値を変更して、固定グリッド用の高解像度イメージを取得しましょう。
ko: `imageSize` 속성이 반환한 값을 변경해 고정 격자에 고해상도 이미지를 가져오세요.
nl: De waarde wijzigen die door de eigenschap `imageSize` wordt geretourneerd om ervoor te zorgen dat je vaste raster wordt gevuld met afbeeldingen met een hogere resolutie.
no: Endre verdien som returneres av `imageSize`-egenskapen, slik at du får bilder med høyere oppløsning til det faste rutenettet.
pt: Mude o valor retornado pela propriedade `imageSize` para obter imagens com resolução maior para a grade fixa.
sv: Ändra värdet som returneras av egenskapen `imageSize` så att du får bilder med högre upplösning till det fasta rutnätet.
th: เปลี่ยนค่าที่คืนค่าโดยคุณสมบัติ `imageSize` ของคุณเพื่อรับภาพที่มีความละเอียดสูงขึ้นสำหรับตารางแบบขนาดคงที่ของคุณ
tr: Sabit kareli alanın için daha yüksek çözünürlüklü görüntüler elde etmek için `imageSize` özelliğin tarafından döndürülen değeri değiştir.
vi: Thay đổi giá trị do thuộc tính `imageSize` của bạn trả về để lấy các hình ảnh có độ phân giải cao hơn cho lưới cố định của bạn.
zh_cn: 更改 `imageSize`（图像大小）属性返回的值，为固定网格获取更高分辨率的图像。
zh_tw: 更改 `imageSize` 屬性傳回的值來為固定網格取得較高解析度的影像。

source: Use a maximum height for your photo item view instead of a fixed height: `.frame(maxHeight: 400)`.
de: Verwende für deine Ansicht der Foto-Objekte eine Maximalhöhe statt einer festen Größe: `.frame(maxHeight: 400)`.
es: Usa una altura máxima para la vista de tu ítem de foto en lugar de una altura fija: `.frame(maxHeight: 400)`.
es_419: En lugar de un valor de altura fijo, usa el siguiente valor de altura máxima para tu visualización de activos fotográficos: `.frame(maxHeight: 400)`.
fr: Utilise une hauteur maximale pour ta vue d’élément de photo au lieu d’une hauteur fixe : `.frame(maxHeight: 400)`.
it: Usa un’altezza massima per l’elemento foto piuttosto che un’altezza fissa: `.frame(maxHeight: 400)`.
ja: 写真項目のビューに、固定の高さではなく、最大の高さ（`.frame(maxHeight: 400)`）を使用しましょう。
ko: 사진 항목 보기에 고정된 높이 대신 최대 높이인 `.frame(maxHeight: 400)`를 사용하세요.
nl: Een maximale hoogte voor de weergave van je foto-onderdelen gebruiken in plaats van een vaste hoogte: `.frame(maxHeight: 400)`.
no: Bruk en maksimal høyde for bildeobjektvisningen i stedet for en fast høyde: `.frame(maxHeight: 400)`.
pt: Use uma altura máxima para a visualização de item de foto em vez de uma altura fixa: `.frame(maxHeight: 400)`.
sv: Använd en högsta höjd för bildobjektvyn istället för en fast höjd: `.frame(maxHeight: 400)`.
th: ใช้ความสูงสูงสุดสำหรับมุมมองรายการรูปภาพของคุณแทนการใช้ความสูงแบบคงที่: `.frame(maxHeight: 400)`
tr: Fotoğraf öğesi görüntün için sabit bir yükseklik yerine maksimum yüksekliği kullan: `.frame(maxHeight: 400)`.
vi: Sử dụng chiều cao tối đa cho chế độ xem mục ảnh của bạn thay vì chiều cao cố định: `.frame(maxHeight: 400)`.
zh_cn: 为照片项视图使用最大高度，而非固定高度：`.frame(maxHeight: 400)`。
zh_tw: 為你的照片項目顯示區使用最大高度而不是固定高度：`.frame(maxHeight: 400)`。
