Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Tip: Keep it `private` because you’re only using it inside `CameraView`. This is a good practice for any definition that you only plan to use within a type.
de: Tipp: Du solltest die Definition mit `private` privat halten, da du sie nur innerhalb von `CameraView` (Kameraansicht) verwendest. Das ist eine gute Herangehensweise für alle Definitionen, die du nur in einem Typ verwenden möchtest.
es: Consejo: Mantenlo privado (`private`) porque solo lo usas dentro de `CameraView`. Esta es una buena práctica para cualquier definición que solo pienses utilizar dentro de un tipo.
es_419: Consejo: mantén el parámetro `private` porque sólo lo usarás dentro de la visualización `CameraView`. Esta es una buena práctica para cualquier definición que pienses usar solo dentro de un tipo.
fr: Astuce : fais en sorte que cela reste `private` (privé), car tu ne l’utilises qu’à l’intérieur de `CameraView`. Il s’agit d’un bon entraînement pour toutes les définitions que tu prévois d’utiliser à l’intérieur d’un type.
it: Suggerimento: usa `private` perché lo stai inserendo soltanto all’interno di `CameraView`. Questa è una buona pratica per qualsiasi definizione che pensi di usare soltanto all’interno di un tipo.
ja: ヒント: これは、`CameraView`（カメラビュー）の中でのみ使うので、`private`（プライベート）にしておきます。型の中でのみ使用する予定の定義には、この方法を使うようにしましょう。
ko: 팁: 이것은 `CameraView` 내부에서만 사용하기 때문에 `private`으로 유지합니다. 이것은 한 유형 내부에서만 사용하려는 모든 정의에 대한 좋은 방법입니다.
nl: Tip: maak de definitie `private` omdat je deze alleen in `CameraView` gebruikt. Dit is een goede gewoonte voor alle definities die je alleen binnen een type wilt gaan gebruiken.
no: Tips: Behold den som `private`, siden du bare bruker den i `CameraView`. Dette er en anbefalt fremgangsmåte for alle definisjoner som du bare skal bruke én gang i en type.
pt: Dica: mantenha isso em `private` porque você está usando isso apenas dentro de `CameraView`. Essa é uma prática recomendada para qualquer definição que você planeje usar apenas dentro de um tipo.
sv: Tips: Behåll den `private` eftersom du bara använder den inuti `CameraView`. Det är en bra idé för alla definitioner som du bara tänker använda inom en typ.
th: เคล็ดลับ: ทำให้เป็นส่วนตัวอยู่เสมอด้วย `private` เนื่องจากคุณใช้อยู่ภายใน `CameraView` เท่านั้น นี่จึงเป็นแนวทางการปฏิบัติที่ดีสำหรับคำจำกัดความใดๆ ที่คุณวางแผนว่าจะใช้ภายในประเภทเท่านั้น
tr: İpucu: Bunu `CameraView` içinde yalnızca sen kullandığın için gizli (`private`) tut. Bu, yalnızca bir tip içinde kullanmayı planladığın herhangi bir tanım için iyi bir uygulamadır.
vi: Mẹo: Hãy giữ `private` vì bạn chỉ đang sử dụng trong `CameraView`. Đây là một cách làm phù hợp đối với bất kỳ định nghĩa nào mà bạn chỉ dự định sử dụng bên trong một kiểu.
zh_cn: 提示：将它设为 `private` 是因为你只在 `CameraView` 内部使用它。对于只打算在某个类型内部使用的任何定义，这都是一种很好的做法。
zh_tw: 提示：維持 `private`，因為你只在 `CameraView` 中使用它。對於你只打算在一個類型中使用的任何定義，這是很好的做法。

source: Then, in your shutter [Button](doc://com.apple.documentation/documentation/swiftui/button) handler, [comment out](glossary://comment%20out) the line of code that immediately takes a photo when you tap or click the button.
de: Wandle dann die Codezeile im Handler der Auslöser-[Taste](doc://com.apple.documentation/documentation/swiftui/button), die beim Tippen oder Klicken auf die Taste sofort ein Foto aufnimmt, in einen [Kommentar](glossary://comment%20out) um.
es: A continuación, en el gestor de tu [botón](doc://com.apple.documentation/documentation/swiftui/button) del obturador, [marca como comentario](glossary://comment%20out) la línea de código que hace una foto inmediatamente al tocar o hacer clic en el botón.
es_419: Luego, en el controlador [Button](doc://com.apple.documentation/documentation/swiftui/button) del obturador, [marca como comentario](glossary://comment%20out) la línea de código que toma una foto cuando se presiona o toca el botón.
fr: Ensuite, dans le gestionnaire de ton [bouton](doc://com.apple.documentation/documentation/swiftui/button) d’obturateur, [commente](glossary://comment%20out) la ligne de code qui prend immédiatement une photo quand tu touches le bouton ou cliques dessus.
it: Quindi, nel gestore del [pulsante](doc://com.apple.documentation/documentation/swiftui/button) di scatto, [converti in commento](glossary://comment%20out) la linea di codice che scatta una foto immediatamente quando selezioni il pulsante.
ja: そのあとで、シャッターの[Button](doc://com.apple.documentation/documentation/swiftui/button)（ボタン）ハンドラで、ボタンをタップまたはクリックしたらすぐに写真を撮影するコード行を[コメントアウト](glossary://comment%20out)します。
ko: 그런 다음, 셔터의 [Button](doc://com.apple.documentation/documentation/swiftui/button) 핸들러에서 버튼을 탭 또는 클릭하면 바로 사진을 촬영하는 코드 줄을 [주석 처리](glossary://comment%20out)합니다.
nl: Vervolgens moet je in de [Button](doc://com.apple.documentation/documentation/swiftui/button)-handler van de sluiter de regel code [uitcommentariëren](glossary://comment%20out) die ervoor zorgt dat er onmiddellijk een foto wordt gemaakt wanneer je op de knop tikt of klikt.
no: I lukkerens [Button](doc://com.apple.documentation/documentation/swiftui/button)-håndterer må du [kommentere ut](glossary://comment%20out) kodelinjen som tar et bilde umiddelbart når du trykker eller klikker på knappen.
pt: Em seguida, no controlador [Button](doc://com.apple.documentation/documentation/swiftui/button) do obturador, [comente](glossary://comment%20out) a linha de código que tira uma foto imediatamente quando você toca ou clica no botão.
sv: I slutarens [Button](doc://com.apple.documentation/documentation/swiftui/button)-hanterare ska du sedan [kommentera bort](glossary://comment%20out) kodraden som tar en bild omedelbart när du trycker eller klickar på knappen.
th: จากนั้น ในตัวจัดการ[ปุ่ม](doc://com.apple.documentation/documentation/swiftui/button)ชัตเตอร์ของคุณ ให้ทำให้บรรทัดโค้ดที่ถ่ายรูปในทันทีเมื่อคุณแตะหรือคลิกปุ่ม[เป็นความคิดเห็น](glossary://comment%20out)
tr: Sonra, deklanşör [Düğme](doc://com.apple.documentation/documentation/swiftui/button) işleyicinde, düğmeye dokunduğunda veya tıkladığında hemen fotoğraf çeken kod satırını [dışarıda bırak](glossary://comment%20out).
vi: Sau đó, trong trình xử lý [Nút](doc://com.apple.documentation/documentation/swiftui/button) chụp của bạn, hãy [loại bỏ](glossary://comment%20out) dòng mã có chức năng chụp ảnh ngay khi bạn chạm hoặc bấm nút.
zh_cn: 然后，在快门 [Button](doc://com.apple.documentation/documentation/swiftui/button)（按钮）处理程序中，将用于在轻点或点按按钮时立即拍照的那一行代码[注释掉](glossary://comment%20out)。
zh_tw: 然後，在你的快門 [Button](doc://com.apple.documentation/documentation/swiftui/button) 處理器中有一行當你點按按鈕時會立即拍照的程式碼，在其內加入[註解](glossary://comment%20out)。

source: You’ll call `takePhoto()` inside your timer handler instead.
de: Du rufst stattdessen die Funktion `takePhoto()` in deinem Timer-Handler auf.
es: En su lugar, llamarás a `takePhoto()` dentro del gestor del temporizador.
es_419: En lugar de eso, deberás llamar al método `"takePhoto()"` dentro de tu administrador de temporizadores.
fr: Tu appelleras plutôt `takePhoto()` à l’intérieur du gestionnaire de ton minuteur.
it: Richiamerai `takePhoto()` all’interno del gestore del timer.
ja: その代わりに、timer（タイマー）ハンドラの中で`takePhoto()`（写真を撮影）を呼び出します。
ko: 대신 타이머 핸들러 내부에서 `takePhoto()`를 호출합니다.
nl: In plaats daarvan roep je `takePhoto()` aan in je timerhandler.
no: I stedet skal du kalle `takePhoto()` i nedtellingshåndtereren.
pt: Em vez disso, chame `takePhoto()` dentro do controlador de timer.
sv: Du kommer istället att anropa `takePhoto()` inuti timerhanteraren.
th: คุณจะต้องเรียกใช้ `takePhoto()` ภายในตัวจัดการนาฬิกานับถอยหลังของคุณแทน
tr: Bunun yerine sayaç işleyicinin içindeki `takePhoto()`’yu çağıracaksın.
vi: Thay vào đó, bạn sẽ gọi `takePhoto()` bên trong trình xử lý hẹn giờ.
zh_cn: 你将改为在计时器处理程序内调用 `takePhoto()`。
zh_tw: 你將改為在計時器處理器中呼叫 `takePhoto()`。

source: Next set your `delayCount` variable to the number of seconds you want to count down, like `5` seconds.
de: Lege als Nächstes die `delayCount`-Variable auf die Sekundenzahl fest, die du herunterzählen möchtest, z. B. `5` Sekunden.
es: A continuación, establece tu variable `delayCount` en el número de segundos que quieres que cuente hacia atrás (por ejemplo, `5` segundos).
es_419: A continuación, establece el número de segundos de la cuenta regresiva en tu variable `delayCount`, por ejemplo, `5` segundos.
fr: Définis ensuite ta variable `delayCount` sur le nombre de secondes que tu veux décompter, par exemple `5` secondes.
it: Nel passaggio successivo, imposta la variabile `delayCount` sul numero di secondi corrispondenti alla durata del conto alla rovescia, ad esempio, `5` secondi.
ja: 次に、`delayCount`（遅延カウント）変数を、5秒など、カウントダウンしたい秒数に設定します。
ko: 이제 `delayCount` 변수를 카운트다운하려는 초 수로 설정합니다(예: `5`초).
nl: Stel nu de variabele `delayCount` in op het aantal seconden dat je wilt aftellen, bijvoorbeeld `5` seconden.
no: Konfigurer deretter `delayCount`-variabelen med det antall sekunder du vil telle ned, for eksempel `5` sekunder.
pt: Depois, defina a variável `delayCount` com o número de segundos que você quer na contagem regressiva, como `5` segundos.
sv: Ställ sedan in variabeln `delayCount` på antalet sekunder som du vill räkna ned, exempelvis `5` sekunder.
th: ถัดไป ตั้งค่าตัวแปร `delayCount` ของคุณเป็นจำนวนวินาทีที่คุณต้องการนับถอยหลัง เช่น `5` วินาที
tr: Sonra, `delayCount` değişkenini geri saymak istediğin saniye sayısına (`5` saniye gibi) ayarla.
vi: Tiếp theo, đặt biến `delayCount` thành số giây mà bạn muốn đếm ngược, ví dụ như `5` giây.
zh_cn: 接下来，将 `delayCount` 变量设为想要倒计时的秒数，比如 `5` 秒。
zh_tw: 接下來將你的 `delayCount` 變數設定為你要倒數計時的秒數，比如 `5` 秒。

source: Below your `delayCount` assignment, add a scheduled [Timer](doc://com.apple.documentation/documentation/foundation/timer) to repeat once per second. When your timer goes off, it calls the code in the [closure](glossary://closure) that you provide for it, [decrementing](glossary://decrement) `delayCount`.
de: Füge unter der `delayCount`-Zuweisung einen geplanten [Timer](doc://com.apple.documentation/documentation/foundation/timer) hinzu, der sich sekündlich wiederholt. Wenn der Timer aktiviert wird, ruft dieser den Code in dem [Funktionsabschluss](glossary://closure) auf, den du dort vorgesehen hast. Dadurch wird `delayCount` [verringert](glossary://decrement).
es: Debajo de la asignación `delayCount`, añade un [temporizador](doc://com.apple.documentation/documentation/foundation/timer) programado para que se repita una vez por segundo. Cuando tu temporizador se activa, llama al código de la [clausura](glossary://closure) que le proporcionas, [reduciendo el valor](glossary://decrement) de `delayCount`.
es_419: Debajo de `delayCount`, agrega un temporizador ([Timer](doc://com.apple.documentation/documentation/foundation/timer)) programado para que se repita una vez por segundo. Cuando tu temporizador finalice, llamará al código dentro de la [clausura](glossary://closure) que le proporcionaste, [disminuyendo](glossary://decrement) el valor de `delayCount`.
fr: Sous ton attribution `delayCount`, ajoute un [minuteur](doc://com.apple.documentation/documentation/foundation/timer) programmé pour se répéter une fois par seconde. Quand ton minuteur démarre, il appelle le code dans la [clôture](glossary://closure) que tu lui indiques, en [décrémentant](glossary://decrement) `delayCount`.
it: Sotto all’assegnazione `delayCount`, aggiungi un [Timer](doc://com.apple.documentation/documentation/foundation/timer) programmato che si ripete una volta al secondo. Quando il timer si attiva, il codice nella [chiusura](glossary://closure) che hai fornito viene richiamato, [decrementando](glossary://decrement) il valore `delayCount`.
ja: `delayCount`（遅延カウント）への値の代入の下に、1秒につき1回繰り返すスケジュール済みの[Timer](doc://com.apple.documentation/documentation/foundation/timer)（タイマー）を追加します。タイマーが作動すると、指定した[クロージャ](glossary://closure)のコードが呼び出されて、`delayCount`が[減って（デクリメントして）](glossary://decrement)いきます。
ko: `delayCount` 할당 아래에 설정된 [Timer](doc://com.apple.documentation/documentation/foundation/timer)를 추가하여 1초에 한 번 반복되도록 합니다. 타이머가 울리면, 내부에 배치한 핸들러 코드를 호출하여 `delayCount`를 [감소](glossary://decrement)시킵니다.
nl: Voeg onder de `delayCount`-toewijzing een geplande [Timer](doc://com.apple.documentation/documentation/foundation/timer) toe die elke seconde wordt herhaald. Wanneer de timer afgaat, roept deze de code aan in de [closure](glossary://closure) die je ervoor opgeeft, waardoor `delayCount` wordt [verlaagd](glossary://decrement).
no: Under `delayCount`-tildelingen legger du til en planlagt [Timer](doc://com.apple.documentation/documentation/foundation/timer) som skal gjentas én gang per sekund. Når nedtellingen løses ut, kaller den koden i [closure-blokken](glossary://closure) som du angir for den, og [minsker](glossary://decrement) `delayCount`.
pt: Abaixo da atribuição de `delayCount`, adicione um [Timer](doc://com.apple.documentation/documentation/foundation/timer) programado para repetir uma vez por segundo. Quando o timer dispara, ele chama o código no [encerramento](glossary://closure) que você forneceu a ele, [decrementando](glossary://decrement) `delayCount`.
sv: Nedanför tilldelningen `delayCount` lägger du till en schemalagd [Timer](doc://com.apple.documentation/documentation/foundation/timer) som upprepas en gång per sekund. När timern löses ut anropar den koden i [stängningen](glossary://closure) som du tillhandahåller för den och [minskar](glossary://decrement) `delayCount`.
th: ด้านล่างการกำหนดค่า `delayCount` ของคุณ ให้เพิ่ม[นาฬิกานับถอยหลัง](doc://com.apple.documentation/documentation/foundation/timer)ที่กำหนดเวลาไว้เพื่อทำซ้ำวินาทีละครั้ง เมื่อนาฬิกานับถอยหลังของคุณหยุดลง ก็จะเรียกใช้โค้ดใน[การปิด](glossary://closure)ที่คุณระบุไว้ โดยจะ[ลด]จำนวนของ `delayCount`
tr: `delayCount` atamanın altına saniyede bir kez yinelenecek zamanlanmış bir [Sayaç](doc://com.apple.documentation/documentation/foundation/timer) ekle. Sayacın bittiğinde, [kapamanın](glossary://closure) içine koyduğun kod çağrılır ve `delayCount` [azaltılır](glossary://decrement).
vi: Bên dưới phần gán `delayCount` của bạn, hãy thêm một [Hẹn giờ](doc://com.apple.documentation/documentation/foundation/timer) theo lịch trình để lặp lại một lần mỗi giây. Khi hẹn giờ của bạn dừng, hẹn giờ gọi mã trong [bao đóng](glossary://closure) mà bạn cung cấp, [giảm dần](glossary://decrement) `delayCount`.
zh_cn: 在 `delayCount` 赋值语句下方，添加已设定的 [Timer](doc://com.apple.documentation/documentation/foundation/timer) 并让它每秒重复一次。计时器启动时，会调用你提供给它的[闭包](glossary://closure)中的代码，让 `delayCount` [递减](glossary://decrement)。
zh_tw: 在你的 `delayCount` 指定值下方加入一個排定的 [Timer](doc://com.apple.documentation/documentation/foundation/timer) 來每秒重複一次。當你的計時器關閉時，它會呼叫你提供位於[閉包](glossary://closure)中的程式碼，[遞減](glossary://decrement) `delayCount`。

source: And now for the final step in your timer closure: when `delayCount` reaches zero, stop the timer and instruct the camera to take the photo.
de: Jetzt zum letzten Schritt deines Timer-Funktionsabschlusses: Wenn `delayCount` den Wert null erreicht, stoppst du den Timer und weist die Kamera an, das Foto aufzunehmen.
es: Y ahora, el último paso de la clausura del temporizador: cuando `delayCount` llegue a cero, para el temporizador y dile a la cámara que haga la foto.
es_419: Y para el paso final de la clausura del temporizador: una vez que `delayCount` llegue a cero, el temporizador debe detenerse e indicarle a la cámara que tome la foto.
fr: Et maintenant, place à la dernière étape de la clôture de ton minuteur : lorsque `delayCount` atteint zéro, arrête le minuteur et indique à l’appareil photo de prendre la photo.
it: Ora manca l’ultimo passaggio necessario per la chiusura del temporizzatore: quando `delayCount` raggiunge lo zero, interrompi il timer e indica alla fotocamera di scattare una foto.
ja: 次は、timer（タイマー）クロージャの最終ステップです。`delayCount`（遅延カウント）がゼロになったら、タイマーを停止して写真を撮影するようにカメラに指示します。
ko: 이제 타이머 클로저의 마지막 단계입니다. `delayCount`가 0이 되면 타이머를 멈추고 사진을 촬영하도록 지시합니다.
nl: En nu ben je toe aan de laatste stap in je timerclosure: wanneer `delayCount` nul bereikt, stop je de timer en geef je de camera opdracht om een foto te maken.
no: Nå er det tid for det siste trinnet i closure-blokken for nedtellingen: Når `delayCount` blir null, skal nedtellingen stoppes, og kameraet skal få beskjed om å ta bildet.
pt: E agora, o passo final no encerramento do timer: quando `delayCount` chegar a zero, interrompa o timer e instrua a câmera para tirar a foto.
sv: Nu är det dags för det slutliga steget i timerstängningen: när `delayCount` når noll stoppar du timern och säger åt kameran att ta bilden.
th: และสำหรับขั้นตอนสุดท้ายในการปิดนาฬิกานับถอยหลังของคุณ เมื่อ `delayCount` ถึงศูนย์ ให้หยุดนาฬิกานับถอยหลังแล้วสั่งให้กล้องถ่ายรูป
tr: Şimdi de sayaç kapamanda son adım olarak, `delayCount` sıfıra ulaştığında sayacı durdur ve kameraya fotoğraf çekme yönergesini ver.
vi: Va bây giờ là bước cuối cùng trong bao đóng hẹn giờ của bạn: khi `delayCount` đến 0, dừng hẹn giờ và chỉ dẫn camera chụp ảnh.
zh_cn: 现在到了计时器闭包的最后一步：当 `delayCount` 归零时，让计时器停止运行，并命令相机拍摄照片。
zh_tw: 現在是計時器閉的最後一步：一旦 `delayCount` 到達 0，停止計時器，並告訴相機拍照。

source: Add the following code in your timer closure, after `delayCount -= 1`:
de: Füge folgenden Code nach `delayCount -= 1` in den Funktionsabschluss deines Timers ein:
es: Añade el siguiente código en la clausura del temporizador, después de `delayCount -= 1`:
es_419: Agrega el siguiente código en tu clausura de temporizador, después de `delayCount -= 1`:
fr: Ajoute le code suivant dans la clôture de ton minuteur, après `delayCount -= 1` :
it: Aggiungi il codice di seguito nella chiusura del timer, dopo `delayCount -= 1`:
ja: `delayCount -= 1`のあと、timer（タイマー）クロージャに次のコードを追加します:
ko: 타이머 클로저에서 `delayCount -= 1` 뒤에 아래 코드를 추가합니다.
nl: Voeg de volgende code toe aan je timerclosure, na `delayCount -= 1`:
no: Legg til denne koden etter `delayCount -= 1` i closure-blokken for nedtellingen:
pt: Adicione o seguinte código no encerramento do timer, depois de `delayCount -= 1`:
sv: Lägg till följande kod efter `delayCount -= 1` i timerstängningen:
th: เพิ่มโค้ดต่อไปนี้ในการปิดนาฬิกานับถอยหลังของคุณต่อจาก `delayCount -= 1`:
tr: Aşağıdaki kodu sayaç kapamandaki `delayCount -= 1` satırından sonra ekle:
vi: Thêm mã sau đây trong bao đóng hẹn giờ của bạn, phía sau `delayCount -= 1`:
zh_cn: 将以下代码添加到计时器闭包中，放在 `delayCount -= 1` 之后：
zh_tw: 在計時器閉包的 `delayCount -= 1` 後方加入下列程式碼：

source: When you call the timer’s [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) method, it stops — its job is done!
de: Wenn du die [Invalidierungs](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)methode des Timers aufrufst, wird er gestoppt – seine Arbeit ist erledigt!
es: Cuando llames al método [invalidar](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) del temporizador, se detendrá: ¡ya habrá hecho su trabajo!
es_419: Cuando llames al método [invalidar](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) del temporizador, ¡este debería detenerse porque su trabajo habrá terminado!
fr: Quand tu appelles la méthode [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) du minuteur, il s’arrête. Il a terminé sa tâche !
it: Quando richiami il metodo [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) del timer, questo si interromperà. Missione compiuta!
ja: timer（タイマー）の[invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)（無効化）メソッドを呼び出すと、タイマーが停止します。これでタイマーの仕事は完了です!
ko: 타이머의 [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) 메소드를 호출하면 타이머가 중지됩니다. 이것으로 타이머 작업이 완료되었습니다!
nl: Waneer je de methode [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) van de timer aanroept, wordt de timer gestopt.
no: Når du kaller nedtellingens [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)-metode, stopper den, siden den har gjort det den skal gjøre!
pt: Quando você chama o método [invalidar](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) do timer, ele para — o trabalho dele está feito!
sv: När du anropar timerns [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)-metod stoppas den – timern har gjort det den ska!
th: เมื่อคุณเรียกใช้วิธีการ[ทำให้เป็นโมฆะ](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)ของนาฬิกานับถอยหลัง นาฬิกานับถอยหลังจะหยุดและถือว่าทำหน้าที่สิ้นสุดแล้ว!
tr: Sayacın [geçersizleştirme](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) metodunu çağırdığında sayaç durur, işi biter!
vi: Khi bạn gọi phương thức [hủy xác thực](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) của hẹn giờ, hẹn giờ dừng lại — nhiệm vụ đã hoàn thành!
zh_cn: 调用计时器的 [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate)（无效化）方法时，计时器将停止运行，它的工作完成了！
zh_tw: 當你呼叫計時器的 [invalidate](doc://com.apple.documentation/documentation/foundation/timer/1415405-invalidate) 方法時，它即會停止，它的工作已經完成！

source: Your button handler should now look like the code below.
de: Der Code für den Tasten-Handler sollte jetzt so wie unten aussehen.
es: Ahora el código del gestor del botón debería tener el aspecto del código siguiente.
es_419: Ahora, el controlador del botón debería verse como en el código de abajo.
fr: Le gestionnaire de ton bouton doit désormais ressembler au code ci-dessous.
it: Il codice del gestore del pulsante dovrebbe essere come quello mostrato sotto.
ja: ボタンハンドラは、次のコードのようになります。
ko: 버튼 핸들러는 이제 아래 코드와 같아야 합니다.
nl: Je `Button`-handler moet er nu als de onderstaande code uitzien.
no: Nå bør knappehåndtereren se ut som koden under.
pt: O código do controlador do botão deve ser parecido com o código abaixo.
sv: Nu bör knapphanteraren se ut som koden nedan.
th: ตอนนี้ตัวจัดการปุ่มของคุณควรมีลักษณะดังโค้ดด้านล่าง
tr: Şimdi düğme işleyicin aşağıdaki kod gibi görünmelidir.
vi: Bây giờ, trình xử lý nút của bạn sẽ trông giống mã bên dưới.
zh_cn: 按钮处理程序现在看起来应该像下面的代码这样。
zh_tw: 你的按鈕處理器現在看起來應該像下方的程式碼。

source: After checking your code carefully, tap or click the shutter button and wait!
de: Prüfe den Code gründlich, tippe oder klicke dann auf den Auslöser und warte ab!
es: Después de comprobar el código cuidadosamente, toca o haz clic en el botón del obturador y espera.
es_419: Después de revisar tu código atentamente, toca o presiona el botón de obturador y espera.
fr: Après avoir bien vérifié ton code, touche le bouton d’obturateur ou clique dessus, et patiente !
it: Dopo aver controllato attentamente il codice che hai scritto, seleziona il pulsante di scatto e aspetta!
ja: コードを入念にチェックしたら、シャッターボタンをタップまたはクリックして、待ちましょう!
ko: 작성한 코드를 주의 깊게 확인한 후 셔터 버튼을 탭 또는 클릭하고 기다려 보세요!
nl: Lees je code grondig door. Tik of klik vervolgens op de sluiterknop en wacht!
no: Når du har kontrollert koden grundig, trykker eller klikker du på utløserknappen og venter!
pt: Depois de conferir o código cuidadosamente, toque ou clique no botão obturador e espere!
sv: När du har kontrollerat koden noggrant trycker eller klickar du på slutarknappen och väntar!
th: หลังจากตรวจสอบโค้ดของคุณอย่างถี่ถ้วนแล้ว ให้แตะหรือคลิกปุ่มชัตเตอร์ แล้วรอก่อน!
tr: Kodunu dikkatlice denetledikten sonra deklanşör düğmesine dokun veya tıkla ve bekle!
vi: Sau khi kiểm tra mã của bạn cẩn thận, hãy chạm hoặc bấm nút chụp và đợi!
zh_cn: 仔细检查代码后，轻点或点按快门按钮，然后等一等！
zh_tw: 仔細檢查你的程式碼後，點按快門按鈕，然後等待！
