Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Your data model has a `camera` property that represents one of the physical cameras — or capture devices — available to your device.
de: Dein Datenmodell hat eine `camera`-Eigenschaft, die eine der physischen Kameras – oder Aufnahmegeräte – deines Geräts repräsentieren.
es: Tu modelo de datos tiene una propiedad `camera` que representa una de las cámaras físicas (o dispositivos de captura) disponibles en tu dispositivo.
es_419: Tu modelo de datos tiene una propiedad `camera` que representa una de las cámaras físicas, o dispositivos de captura, disponibles en tu dispositivo.
fr: Ton modèle de données possède une propriété `camera` qui représente un des appareils photo physiques, ou appareils de capture, disponibles sur ton appareil.
it: Il tuo modello di dati ha una proprietà `camera` che rappresenta una delle fotocamere fisiche o uno dei dispositivi di acquisizione delle foto disponibili.
ja: データモデルには、デバイスで使用可能な物理的なカメラ（キャプチャデバイス）のいずれかを表す`camera`（カメラ）プロパティがあります。
ko: 데이터 모델에는 사용자의 기기에서 사용할 수 있는 물리적 카메라 또는 캡처 기기 중 하나를 나타내는 `camera` 속성이 있습니다.
nl: Je gegevensmodel heeft een `camera`-eigenschap die een van de fysieke camera's, of opnameapparaten, vertegenwoordigt die beschikbaar zijn voor je apparaat.
no: Datamodellen din har en `camera`-egenskap som representerer ett av de fysiske kameraene – eller opptaksenhetene – som er tilgjengelige på enheten din.
pt: O modelo de dados tem uma propriedade `camera` que representa uma das câmeras físicas (ou dispositivos de captura) disponíveis ao dispositivo.
sv: Din datamodell har en `camera`-egenskap som representerar en av de fysiska kamerorna – eller insamlingsenheterna – som är tillgängliga för din enhet.
th: โมเดลข้อมูลของคุณมีคุณสมบัติ `camera` ที่แสดงถึงกล้องจริงตัวใดตัวหนึ่งหรืออุปกรณ์จับภาพเครื่องใดเครื่องหนึ่งที่มีให้สำหรับอุปกรณ์ของคุณ
tr: Veri modelinde, aygıtının kullanabileceği fiziksel kameralardan (veya yakalama aygıtlarından) birini temsil eden bir `camera` özelliği vardır.
vi: Mô hình dữ liệu của bạn có một thuộc tính `camera` biểu thị một trong các camera thực — hoặc thiết bị chụp ảnh — khả dụng với thiết bị của bạn.
zh_cn: 你的数据模型有一个 `camera` 属性，代表了设备上可用的其中一个实体相机或拍照设备。
zh_tw: 你的資料模型有一個 `camera` 屬性，代表其中一個裝置可用的實體相機或擷取裝置。

source: Your device may have access to several capture devices — for example, the front and back cameras on iPad — and you can switch between these using the camera’s `switchCaptureDevice()` method.
de: Dein Gerät kann auf mehrere Aufnahmegeräte zugreifen – z. B. die Kameras auf der Vorder- und Rückseite des iPad – und du kannst mit der Methode `switchCaptureDevice()` (Aufnahmegerät wechseln) der Kamera zwischen diesen wechseln.
es: Tu dispositivo puede tener acceso a varios dispositivos de captura (por ejemplo, las cámaras frontal y trasera del iPad) y puedes cambiar entre ellos usando el método `switchCaptureDevice()` de la cámara.
es_419: Es posible que tu dispositivo tenga acceso a varios dispositivos de captura, como las cámaras frontal y posterior del iPad, y que puedas cambiar entre ellos usando el método `switchCaptureDevice()` de la cámara.
fr: Votre appareil peut avoir accès à plusieurs appareils de capture. Par exemple, l’appareil photo avant et arrière sur l’iPad et tu peux basculer entre l’un et l’autre à lʼaide de la méthode `switchCaptureDevice()` de lʼappareil photo.
it: Il tuo dispositivo ha accesso a diversi dispositivi di acquisizione di foto come, ad esempio, la fotocamera anteriore o quella posteriore di iPad (puoi passare da una all’altra utilizzando il metodo `switchCaptureDevice()` della fotocamera).
ja: デバイスでは複数のキャプチャデバイス（iPadの前面カメラと背面カメラなど）にアクセスできる場合があります。それらは、カメラの`switchCaptureDevice()`を使って切り替えることができます。
ko: 사용자의 기기에서 여러 캡처 기기(예: iPad의 전면 및 후면 카메라)에 접근할 수 있으며 카메라의 `switchCaptureDevice()` 메소드를 사용하여 이들 간에 전환할 수 있습니다.
nl: Je apparaat heeft mogelijk toegang tot verschillende opnameapparaten, zoals de camera's aan de voor- en achterkant van de iPad, en je kunt tussen deze apparaten schakelen met de methode `switchCaptureDevice()` van de camera.
no: Enheten kan ha flere opptaksenheter, for eksempel kameraene på forsiden og baksiden av iPad, og du kan veksle mellom dem ved hjelp av kameraets `switchCaptureDevice()`-metode.
pt: O dispositivo pode ter acesso a diversos dispositivos de captura, como as câmera frontal e traseira no iPad, e você pode alternar entre elas com o método `switchCaptureDevice()` da câmera.
sv: Din enhet kan ha tillgång till flera insamlingsenheter – till exempel de främre och bakre kamerorna på iPad – och du kan växla mellan dem med kamerans `switchCaptureDevice()`-metod.
th: อุปกรณ์ของคุณอาจสามารถเข้าถึงอุปกรณ์จับภาพได้หลายเครื่อง ตัวอย่างเช่น กล้องด้านหน้าและกล้องด้านหลังบน iPad และคุณสามารถสลับระหว่างอุปกรณ์เหล่านี้โดยใช้วิธีการ `switchCaptureDevice()` ของกล้องได้
tr: Aygıtının birçok yakalama aygıtına (örneğin iPad’deki ön ve arka kamera) erişimi olabilir ve kameranın `switchCaptureDevice()` metodunu kullanarak bunların arasında geçiş yapabilirsin.
vi: Thiết bị của bạn có thể có quyền truy cập vào một số thiết bị ghi — ví dụ: camera mặt trước và mặt sau trên iPad — và bạn có thể chuyển đổi giữa chúng này bằng phương thức `switchCaptureDevice()` của camera.
zh_cn: 你的设备可能可以使用多个拍照设备，例如 iPad 的前置和后置相机。你可以使用相机的 `switchCaptureDevice()`(切换拍照设备)方法切换这两个相机。
zh_tw: 你的裝置可能會取用數種擷取裝置，例如 iPad 上的正面和背面相機，你可以使用相機的 `switchCaptureDevice()` 方法來切換這些裝置。

source: Learn more about capture devices in [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
de: In [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device) (Auswählen eines Aufnahmegeräts) erfährst du mehr über Aufnahmegeräte.
es: Obtén más información sobre los dispositivos de captura en [Seleccionar un dispositivo de captura](doc://com.apple.documentation/documentation/avfoundation/cameras_and_media_capture).
es_419: Obtén detalles sobre los dispositivos de captura en [Elegir un dispositivo de captura](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
fr: Obtiens davantage d’informations sur les appareils de capture dans [Choisir un appareil de capture](doc://com.apple.documentation/documentation/avfoundation/cameras_and_media_capture).
it: Scopri di più sui dispositivi di acquisizione in [Scegliere un dispositivo di acquisizione](doc://com.apple.documentation/documentation/avfoundation/cameras_and_media_capture).
ja: キャプチャデバイスについて詳しくは[キャプチャデバイスを選択する](doc://com.apple.documentation/documentation/avfoundation/cameras_and_media_capture)をご覧ください。
ko: [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device)에서 캡처 기기에 관해 더 알아보세요.
nl: Meer informatie over opnameapparaten vind je in [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
no: Lær mer om opptaksenheter i [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
pt: Saiba mais sobre dispositivos de captura em [Escolha de um Dispositivo de Captura](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device) (em inglês).
sv: Läs mer om tagningsenheter i [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
th: เรียนรู้เพิ่มเติมเกี่ยวกับอุปกรณ์จับภาพใน[การเลือกอุปกรณ์จับภาพ](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device)
tr: Yakalama aygıtları hakkında daha fazla bilgiyi [Yakalama Aygıtı Seçme](doc://com.apple.documentation/documentation/avfoundation/cameras_and_media_capture) bölümünde bulabilirsin.
vi: Tìm hiểu thêm về các thiết bị chụp ảnh trong [Chọn một thiết bị ghi](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device).
zh_cn: 在 [Choosing a Capture Device](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device)（选取捕捉设备）中进一步了解捕捉设备。
zh_tw: 在[選擇擷取裝置](doc://com.apple.documentation/documentation/avfoundation/capture_setup/choosing_a_capture_device)中瞭解更多擷裝置的相關資訊。

source: To start using the camera, you call its `start()` method:
de: Um die Kamera zu verwenden, rufst du ihre `start()`-Methode auf:
es: Para empezar a usar la cámara, llama a su método `start()`:
es_419: Para comenzar a usar la cámara, debes llamar a su método `start()`:
fr: Pour commencer à utiliser l’appareil photo, tu appelles sa méthode `start()` :
it: Per iniziare a usare la fotocamera, occorre richiamare il suo metodo `start()`:
ja: カメラを使い始めるには、その`start()`メソッドを呼び出します:
ko: 카메라 사용을 시작하려면 다음 `start()` 메소드를 호출합니다.
nl: Om te beginnen met het gebruik van de camera, roep je de `start()`-methode van de camera aan:
no: For å begynne å bruke kameraet kaller du kameraets `start()`-metode:
pt: Para começar a usar a câmera, você chama o método `start()`:
sv: När du vill börja använda kameran anropar du dess `start()`-metod:
th: ในการเริ่มใช้กล้อง ให้คุณเรียกวิธีการ `start()`:
tr: Kamerayı kullanmaya başlamak için `start()` metodunu çağırırsın:
vi: Để bắt đầu sử dụng camera, bạn gọi phương thức `start()`:
zh_cn: 若要开始使用相机，你可以调用它的 `start()`（开始）方法：
zh_tw: 若要開始使用相機，你要呼叫其 `start()` 方法：

source: Note that before you can use the device camera(s) in your own project, you must add the Camera capability.
de: Du musst zuerst die Möglichkeit zum Verwenden der Kamera hinzufügen, bevor du die Gerätekamera(s) in deinem Projekt verwenden kannst.
es: Ten en cuenta que antes de poder usar la(s) cámara(s) del dispositivo en tu propio proyecto, debes añadir la funcionalidad de la app Cámara.
es_419: Toma en cuenta que antes de que puedas usar las cámaras que tenga el dispositivo en tu propio proyecto, debes agregar la funcionalidad de cámara.
fr: Tu remarqueras quʼavant de pouvoir utiliser le ou les appareils photo de lʼappareil dans ton propre projet, tu dois ajouter la fonctionnalité Appareil photo.
it: Tieni presente che per poter utilizzare le fotocamere del dispositivo nel tuo progetto, devi prima aggiungere la funzionalità Fotocamera.
ja: 自分だけのプロジェクトでデバイスのカメラを使用するには、“カメラ”機能を追加する必要があります。
ko: 나만의 프로젝트에서 기기 카메라를 사용하려면 먼저 카메라 기능을 추가해야 합니다.
nl: Houd er rekening mee dat je de functionaliteit 'Camera' moet toevoegen voordat je de camera('s) van het apparaat in je eigen project kunt gebruiken.
no: Du må legge til kamerafunksjonen før du kan bruke enhetens kameraer i ditt eget prosjekt.
pt: Note que antes de usar a câmera ou câmeras do dispositivo em um projeto, você deve adicionar a capacidade de Câmera.
sv: Observera att du inte kan använda enhetens kamera eller kameror i ditt eget projekt, utan du måste lägga till kamerafunktionen.
th: โปรดทราบว่าก่อนที่คุณจะสามารถใช้กล้องของอุปกรณ์ในโปรเจ็กต์ของคุณเองได้ คุณจะต้องเพิ่มความสามารถกล้อง
tr: Aygıt kamerasını veya kameralarını kendi projende kullanabilmen için Kamera yeteneğini eklemen gerekir.
vi: Lưu ý rằng trước khi bạn có thể sử dụng (các) camera của thiết bị trong dự án của riêng mình, bạn phải thêm khả năng Camera.
zh_cn: 注意，必须先添加“相机”功能，才能在自己的项目中使用设备相机。
zh_tw: 請注意，在你能於計畫案中使用裝置的相機前，你必須先加入「相機」功能。

source: Find out more more in [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
de: Weitere Infos findest du unter [Requesting access to capabilities for your project (Zugriff auf Fähigkeiten für dein Projekt anfordern)](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
es: Encuentra más información en [Solicitar acceso a las funcionalidades de tu proyecto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
es_419: Obtén detalles en [Solicitar acceso a las funcionalidades para un proyecto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
fr: Découvre davantage dʼinformations dans [Demander lʼaccès aux fonctionnalités pour ton projet](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
it: Per ulteriori informazioni, consulta [Richiedere accesso alle funzionalità per il progetto](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
ja: 詳しくは、[Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)（英語）を確認してください。
ko: [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)에서 더 자세한 내용을 알아보세요.
nl: In [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) kun je meer informatie hierover vinden.
no: Du finner mer informasjon i [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
pt: Saiba mais em [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
sv: Du kan läsa mer i [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
th: ค้นหาเพิ่มเติมใน[การขอสิทธิ์เข้าถึงความสามารถต่างๆ สำหรับโปรเจ็กต์ของคุณ](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)
tr: [Projen için yeteneklere erişim isteme](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) bölümünde daha fazla bilgi edinebilirsin.
vi: Tìm hiểu thêm trong [Yêu cầu quyền truy cập vào các khả năng cho dự án của bạn](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities).
zh_cn: 在[为项目请求访问功能](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities)中进一步了解更多。
zh_tw: 請在 [Requesting access to capabilities for your project](https://developer.apple.com/documentation/swift-playgrounds/project-capabilities) 中瞭解更多資訊。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..TaskpreviewStream..title
source: Exploring the Preview Stream
de: Vorschau-Stream erkunden
es: Explorar la secuencia de vista previa
es_419: Explorar el flujo de imágenes de vista previa
fr: Exploration du flux d’aperçu
it: Esplorare il flusso di anteprime
ja: プレビューストリームを探求する
ko: 미리보기 스트림 살펴보기
nl: De voorvertoningsstroom verkennen
no: Utforske forhåndsvisningsstrømmen
pt: Explorando o Fluxo de Pré‑visualização
sv: Utforska förhandsvisningsströmmen
th: การสำรวจสตรีมการแสดงตัวอย่าง
tr: Önizleme Yayınını Keşfetme
vi: Khám phá Luồng xem trước
zh_cn: 探索预览流
zh_tw: 探索預覽串流

source: Learn about the stream of preview images from your camera.
de: Erfahre mehr über den Stream aus Vorschaubildern von deiner Kamera.
es: Aprende sobre la secuencia de imágenes de previsualización de la cámara.
es_419: Obtén detalles sobre los flujos de imágenes de vista previa pasados por tu cámara.
fr: Découvre le flux d’images d’aperçu de ton appareil photo.
it: Scopri di più sul flusso di immagini di anteprima dalla tua fotocamera.
ja: カメラから送信されるプレビューイメージのストリームについて学びましょう。
ko: 카메라의 미리보기 이미지 스트림에 대해 배워보세요.
nl: Leer meer over de stream met voorvertoningsbeelden uit de camera.
no: Lær mer om strømmen med forhåndsvisningsbilder fra kameraet.
pt: Saiba mais sobre o fluxo de imagens de pré‑visualização da sua câmera.
sv: Lär dig mer om strömmen med förhandsvisningsbilder från kameran.
th: เรียนรู้เกี่ยวกับสตรีมของภาพการแสดงตัวอย่างจากกล้องของคุณ
tr: Kamerandaki önizleme görüntülerinin akışı hakkında bilgi edin.
vi: Tìm hiểu về luồng hình ảnh xem trước từ camera của bạn.
zh_cn: 了解来自相机的预览图像流。
zh_tw: 瞭解來自相機的預覽影像串流。

source: After calling the camera’s `start()` method, its video output produces a stream of low-resolution preview images (video frames), at rates of up to 60 frames a second.
de: Sobald du die Kamera durch Aufrufen von `start()` startest, erzeugt die Videoausgabe einen Stream mit bis zu 60 Vorschaubilder (Einzelbilder des Films) pro Sekunde mit niedriger Auflösung.
es: Después de llamar al método `start()` de la cámara, su salida de vídeo produce una secuencia de imágenes de previsualización de baja resolución (fotogramas de vídeo), a una velocidad de hasta 60 fotogramas por segundo.
es_419: Después de llamar al método `start()` de la cámara, su salida de video produce un flujo de imágenes de previsualización de baja resolución (cuadros de video) de forma continua, a una velocidad de hasta 60 cuadros por segundo.
fr: Quand tu appelles la méthode `start()` de l’appareil photo, sa sortie vidéo produit un flux dʼimages d’aperçu (images vidéo) de basse résolution en continu, à un rythme pouvant atteindre 60 images par seconde.
it: Dopo aver richiamato il metodo `start()` della fotocamera, l’output video produce un flusso di immagini di anteprima a bassa risoluzione (fotogrammi video), a velocità che arrivano fino a 60 fotogrammi al secondo.
ja: カメラの`start()`メソッドを呼び出すと、カメラのビデオ出力によって、1秒あたり最大60フレームの速度で低解像度のプレビューイメージ（ビデオフレーム）のストリームが生成されます。
ko: 카메라의 `start()` 메소드를 호출한 후, 비디오 출력은 초당 최대 60프레임의 속도로 저해상도 미리보기 이미지의 스트림(비디오 프레임)을 생성합니다.
nl: Nadat je de `start()`-methode van de camera hebt aangeroepen, produceert de video-uitvoer een stream voorvertoningsbeelden met een lage resolutie (videobeelden), met snelheden tot 60 beelden per seconde.
no: Når du har kalt kameraets `start()`-metode, vil videoutdataene sende en strøm med lavoppløste forhåndsvisningsbilder (videobilder) i en hastighet på opptil 60 bilder i per sekund.
pt: Depois de chamar o método `start()` da câmera, a saída de vídeo produz um fluxo de imagens de pré‑visualização em baixa resolução (quadros de vídeo), a velocidades de até 60 quadros por segundo.
sv: När du har anropat kamerans `start()`-metod skickar dess videoutmatning en ström med lågupplösta förhandsvisningsbilder (videobildrutor) i en hastighet på upp till 60 bildrutor per sekund.
th: หลังจากเรียกใช้วิธีการ `start()` output วิดีโอจะสร้างสตรีมภาพการแสดงตัวอย่างความละเอียดต่ำ (เฟรมวิดีโอ) ในอัตราสูงสุด 60 เฟรมต่อวินาที
tr: Kameranın `start()` metodu çağrıldıktan sonra video çıktısı saniyede 60 kareye kadar olan hızlarda düşük çözünürlüklü önizleme görüntülerinden (video karelerinden) oluşan bir yayın üretir.
vi: Sau khi gọi phương thức `start()` của camera, đầu ra video tạo ra một luồng hình ảnh xem trước (khung hình video) độ phân giải thấp, ở tốc độ tối đa là 60 khung hình/giây.
zh_cn: 调用相机的 `start()` 方法后，它的视频输出会生成一系列低分辨率的预览图像（视频帧），速率为每秒最多 60 帧。
zh_tw: 呼叫了相機的 camera’s `start()` 方法之後，其影片輸出會以每秒高達 60 格的速率連續產生一連串的低解析度預覽影像（視訊影格）。

source: You receive these preview images through the camera’s `previewStream` property, as an [asynchronous stream](glossary://asynchronous%20stream) of [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image) objects.
de: Du erhältst diese Vorschaubilder durch die Eigenschaft `previewStream` (Vorschau-Stream) deiner Kamera in Form eines [asynchronen Streams](glossary://asynchronous%20stream) aus [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-Objekten (Core Image).
es: Las imágenes de previsualización se reciben a través de la propiedad `previewStream` de la cámara, como una [secuencia asíncrona](glossary://asynchronous%20stream) de objetos de [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image).
es_419: Estas imágenes de previsualización se reciben mediante la propiedad `previewStream` de la cámara, como un [flujo asincrónico](glossary://asynchronous%20stream) de objetos (Core Image) [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage).
fr: Tu reçois ces images d’aperçu via la propriété `previewStream` de l’appareil photo, sous forme de [flux asynchrone](glossary://asynchronous%20stream) d’objets [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image).
it: Riceverai le anteprime delle immagini tramite la proprietà della fotocamera `previewStream`, come [flusso asincrono](glossary://asynchronous%20stream) di oggetti (Core Image) [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage).
ja: これらのプレビューイメージをカメラの`previewStream`（プレビューストリーム）プロパティを通じて、[CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)（コアイメージ）オブジェクトの[非同期ストリーム](glossary://asynchronous%20stream)として受信します。
ko: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)(Core Image) 객체의 [비동기 스트림](glossary://asynchronous%20stream)과 같은 `previewStream` 카메라 속성을 통해 이러한 미리보기 이미지를 수신합니다.
nl: Je ontvangt deze voorvertoningsbeelden via de `previewStream`-eigenschap van de camera als een [asynchrone stroom](glossary://asynchronous%20stream) met [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-objecten (Core Image).
no: Du mottar disse forhåndsvisningsbildene via kameraets `previewStream`-egenskap som en [asynkron strøm](glossary://asynchronous%20stream) av [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image)-objekter.
pt: Você recebe essas imagens de pré‑visualização pela propriedade `previewStream` da câmera, na forma de um [fluxo assíncrono](glossary://asynchronous%20stream) de objetos [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image).
sv: Du tar emot förhandsvisningsbilderna via kamerans egenskap `previewStream` som en [asynkron ström](glossary://asynchronous%20stream) med [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image)-objekt.
th: คุณจะได้รับภาพการแสดงตัวอย่างเหล่านี้ผ่านคุณสมบัติ `previewStream` ของกล้องในรูปแบบ[สตรีมแบบอะซิงโครนัส](glossary://asynchronous%20stream)ของวัตถุ [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image)
tr: Bu önizleme görüntülerini kameranın `previewStream` özelliği yoluyla [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image) nesnelerinin [eşzamansız yayını](glossary://asynchronous%20stream) olarak alırsın.
vi: Bạn nhận được những hình ảnh xem trước này thông qua thuộc tính `previewStream` của camera, dưới dạng một [luồng không đồng bộ](glossary://asynchronous%20stream) gồm các đối tượng [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) (Core Image).
zh_cn: 你将通过相机的 `previewStream`（预览流）属性，将这些预览图像作为 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)（核心图像）对象的[异步流](glossary://asynchronous%20stream)接收。
zh_tw: 你透過相機的 `previewStream` 屬性來接收這些預覽影像，作為 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)的[非同步串流](glossary://asynchronous%20stream) (Core Image ) 物件。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..TaskprocessPreviews..title
source: Processing the Preview Stream
de: Vorschau-Stream verarbeiten
es: Procesar la secuencia de vista previa
es_419: Procesar el flujo de vista previa
fr: Traitement du flux d’aperçu
it: Elaborare il flusso di anteprime
ja: プレビューストリームを処理する
ko: 미리보기 스트림 처리하기
nl: De voorvertoningsstroom verwerken
no: Behandle forhåndsvisningsstrømmen
pt: Processando o Fluxo de Pré‑visualização
sv: Bearbeta förhandsvisningsströmmen
th: การประมวลผลสตรีมการแสดงตัวอย่าง
tr: Önizleme Yayınını İşleme
vi: Xử lý Luồng xem trước
zh_cn: 处理预览流
zh_tw: 處理預覽串流
