Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: To control when the camera’s preview stream is active, use the navigation link’s [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) modifier to pause it when the gallery appears, and [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) to resume it again when you navigate back to the camera.
de: Du kannst steuern, wann der Vorschau-Stream der Kamera aktiv ist. Verwende dafür den Modifikator [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) des Navigations-Links, um den Stream anzuhalten, wenn die Galerie angezeigt wird, und den Modifikator [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)), um ihn fortzusetzen, wenn du zurück zur Kamera wechselst.
es: Para controlar cuándo se activa la secuencia de vista previa de la cámara, usa el modificador [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) del enlace de navegación para ponerlo en pausa cuando aparezca la galería, y [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) para reanudarla de nuevo cuando vuelvas a navegar a la cámara.
es_419: Para controlar cuándo se activa el flujo de visualización de la cámara, usa el modificador [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) del enlace de navegación para pausarlo cuando la galería aparezca, y usa el modificador [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) para reanudarlo cuando regreses a la cámara.
fr: Pour contrôler le moment où le flux d’aperçu de l’appareil photo est actif, utilise le modificateur [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) du lien de navigation pour le mettre en pause lorsque la galerie s’affiche et [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) pour le reprendre quand tu retournes dans l’appareil photo.
it: Per controllare quando il flusso di anteprime della fotocamera è attivo, utilizza il modificatore del link di navigazione [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) per mettere in pausa il flusso quando viene mostrata la galleria e usa [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) per riavviarlo quando torni alla fotocamera.
ja: カメラのプレビューストリームのオン/オフを制御する場合、ギャラリーを表示するときはナビゲーションリンクの[onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:))（表示のとき）修飾子を使って一時停止し、カメラに戻るときは[onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:))（非表示のとき）修飾子を使って再開します。
ko: 카메라의 미리보기 스트림 활성화 시기를 제어하려면 탐색 링크의 [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) 제어자를 사용해 갤러리가 나타날 때 미리보기 스트림을 일시 정지하고, [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) 제어자를 사용해 카메라로 돌아갈 때 미리보기 스트림을 재개합니다.
nl: Je gebruikt de modifier [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) van de navigatielink om de voorvertoningsstroom van de camera te pauzeren wanneer de galerie verschijnt en je gebruikt [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) om de voorvertoningsstroom te hervatten wanneer je teruggaat naar de camera.
no: For å bestemme når kameraets forhåndsvisningsstrøm skal være aktiv bruker du navigeringslenkens [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:))-modifikator til å sette den på pause når galleriet vises, og [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) til å gjenoppta den når du navigerer tilbake til kameraet.
pt: Para controlar quando o fluxo de pré-visualização da câmera está ativo, use o modificador de link de navegação [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) para pausá-lo quando a galeria aparecer e [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) para retomá-lo quando você navegar de volta para a câmera.
sv: Du kan styra när kamerans förhandsvisningsström är aktiv genom att använda navigeringslänkens [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:))-modifierare till att pausa den när galleriet visas och [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) för att återuppta den när du navigerar tillbaka till kameran.
th: ในการควบคุมเวลาที่สตรีมการแสดงตัวอย่างของกล้องทำงาน ให้ใช้ปุ่มปรับค่า [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) ของลิงก์การนำทางเพื่อหยุดพักเมื่อแกลเลอรี่แสดงขึ้นมา และใช้ [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) เพื่อทำต่ออีกครั้งเมื่อคุณนำทางกลับไปยังกล้อง
tr: Kameranın önizleme yayınının ne zaman etkin olacağını denetlemek istiyorsan galeri göründüğünde duraklatmak için dolaşma bağlantısının [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) niteleyicisini ve kameraya geri döndüğünde yeniden sürdürmek için [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) niteleyicisini kullan.
vi: Để kiểm soát thời điểm luồng xem trước của camera hoạt động, hãy sử dụng trình sửa đổi [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) của liên kết điều hướng để tạm dừng luồng khi phòng trưng bày xuất hiện và [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) để tiếp tục lại luồng khi bạn điều hướng trở lại camera.
zh_cn: 若要控制相机预览流活跃的时间，可使用导航链接的 [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) 修饰符来在画廊显示时暂停预览流，使用 [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) 来在导航回相机时重新恢复预览流。
zh_tw: 若要控制相機的預覽串流何時啟用，請使用導覽連結的 [onAppear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/onappear(perform:)) 修飾符在顯示圖庫時暫停串流，並使用 [onDisappear(perform:)](doc://com.apple.documentation/documentation/swiftui/view/ondisappear(perform:)) 在你導覽回到相機時再次恢復串流。

source: Building the Photo Gallery
de: Fotogalerie aufbauen
es: Crear la galería de fotos
es_419: Crear una galería de fotos
fr: Création de la galerie de photos
it: Creare la galleria fotografica
ja: フォトギャラリーを作成する
ko: 사진 갤러리 만들기
nl: De fotogalerie bouwen
no: Bygge bildegalleriet
pt: Construindo a Galeria de Fotos
sv: Bygga bildgalleriet
th: การสร้างแกลเลอรี่รูปภาพ
tr: Fotoğraf Galerisi’ni Oluşturma
vi: Xây dựng phòng trưng bày ảnh
zh_cn: 构建照片画廊
zh_tw: 建構照片圖庫

source: Discover how to display your photos in a scrolling grid.
de: Erfahre, wie du deine Fotos in einem scrollbaren Raster anzeigst.
es: Descubre cómo mostrar tus fotos en una cuadrícula por la que te puedes desplazar.
es_419: Descubre cómo mostrar tus fotos en una cuadrícula desplazable
fr: Découvre comment afficher tes photos dans une grille défilante.
it: Scopri come visualizzare le tue foto in una griglia scorrevole.
ja: スクロールするグリッドに写真を表示する方法を学びましょう。
ko: 사진을 스크롤 격자에 표시하는 방법을 알아보세요.
nl: Ontdek hoe je je foto's in een scrolbaar raster weergeeft.
no: Finn ut hvordan du viser bildene dine i et rutenett som du kan rulle i.
pt: Descubra como mostrar suas fotos em uma grade rolável.
sv: Upptäck hur du visar bilder i ett rullningsbart rutnät.
th: ค้นพบวิธีแสดงรูปภาพของคุณในตารางแบบเลื่อนได้
tr: Fotoğraflarını kaydırılan bir kareli alanda nasıl görüntüleyeceğini keşfet.
vi: Khám phá cách hiển thị ảnh của bạn trong một lưới cuộn.
zh_cn: 探索如何在滚动网格中显示照片。
zh_tw: 探索如何在捲動式網格中顯示你的照片。

source: You use a `PhotoCollectionView` to display your photos in a scrolling grid, with the most recent photos at the top.
de: Du verwendest `PhotoCollectionView` (Ansicht der Fotosammlung), um deine Fotos in einem scrollbaren Raster anzuzeigen. Das zuletzt aufgenommene Foto befindet sich ganz oben.
es: Puedes usar una vista de la colección de fotos (`PhotoCollectionView`) para mostrar tus fotos en una cuadrícula por la que te puedes desplazar, con las fotos más recientes en la parte superior.
es_419: La visualización `"PhotoCollectionView"` te permite mostrar tus fotos en una cuadrícula desplazable, donde las fotos más recientes se muestran en el área superior.
fr: Tu utilises une vue `PhotoCollectionView` pour afficher tes photos dans une grille défilante, avec les photos les plus récentes en haut.
it: La vista `PhotoCollectionView` serve per visualizzare le foto in una griglia che scorre, con le foto più recenti in alto.
ja: スクロールするグリッドに最新の写真が一番上に来るようにして写真を表示するには、`PhotoCollectionView`（フォトコレクションビュー）を使います。
ko: `PhotoCollectionView`를 사용해 스크롤 격자에 사진을 표시하고 가장 최근의 사진은 상단에 배치합니다.
nl: Je gebruikt een `PhotoCollectionView` om de foto's in een scrolbaar raster weer te geven, met de recentste foto bovenaan.
no: Du kan bruke en `PhotoCollectionView` til å vise bildene i et rullende rutenett med de nyeste bildene øverst.
pt: Você usa uma `PhotoCollectionView` para mostrar suas fotos em uma grade rolável, com as fotos mais recentes no topo.
sv: Du kan använda en `PhotoCollectionView` till att visa bilder i ett rullande rutnät med de senaste bilderna överst.
th: ให้คุณใช้ `PhotoCollectionView` เพื่อแสดงรูปภาพของคุณในตารางแบบเลื่อนได้ โดยมีรูปภาพล่าสุดอยู่ด้านบนสุด
tr: Fotoğraflarını kayan bir kareli alanda, en son fotoğraflar en üstte olacak şekilde göstermek için `PhotoCollectionView` kullanırsın.
vi: Bạn sử dụng một `PhotoCollectionView` để hiển thị ảnh của mình trong một lưới cuộn, với các ảnh gần đây nhất ở trên cùng.
zh_cn: 你将使用 `PhotoCollectionView` 将照片显示在滚动网格中，最近的照片显示在顶部。
zh_tw: 你使用 `PhotoCollectionView` 在捲動式網格中顯示你的照片，最新的照片位於最上方。

source: When you create your `PhotoCollectionView`, the `photoCollection` property initializes with a reference to your model’s `photoCollection`. It provides all of the data you need to build your photo gallery.
de: Wenn du `PhotoCollectionView` erstellst, wird die Eigenschaft `photoCollection` mit einer Referenz zu `photoCollection` des Datenmodells initialisiert. Sie stellt alle Daten bereit, die zum Aufbau der Fotogalerie benötigt werden.
es: Cuando creas tu colección de fotos (`PhotoCollectionView`), la propiedad `photoCollection` se inicializa con una referencia a la colección de fotos (`photoCollection`) de tu modelo. Esta proporciona todos los datos que necesitas para crear tu galería de fotos.
es_419: Cuando creas tu visualización `PhotoCollectionView`, la propiedad `photoCollection` se inicializa con una referencia a la visualización `photoCollection` de tu modelo, la cual proporciona todos los datos que necesitas para construir tu galería de fotos.
fr: Lorsque tu crées ton paramètre `PhotoCollectionView`, la propriété `photoCollection` s’initialise avec une référence à la propriété `photoCollection` de ton modèle. Grâce à ça, tu disposes de toutes les données dont tu as besoin pour créer ta galerie de photos.
it: Quando crei la tua `PhotoCollectionView`, la proprietà `photoCollection` corrispondente si inizializza con un riferimento a `photoCollection` del tuo modello di dati. In questo modo, l’azione fornisce tutti i dati necessari per creare la galleria fotografica.
ja: `PhotoCollectionView`（フォトコレクションビュー）を作成すると、モデルの`photoCollection`（フォトコレクション）への参照を使って`photoCollection`プロパティが初期化されます。これにより、フォトギャラリーの作成に必要なすべてのデータが用意されます。
ko: `PhotoCollectionView`를 생성할 때 `photoCollection` 속성은 모델의 `photoCollection`을 참조하여 초기화됩니다. 이는 사진 갤러리를 만드는 데 필요한 모든 데이터를 제공합니다.
nl: Wanneer je de `PhotoCollectionView` aanmaakt, wordt de eigenschap `photoCollection` geïnitialiseerd met een verwijzing naar de `photoCollection` van je model. Deze eigenschap verschaft alle gegevens die je nodig hebt om de fotogalerie te bouwen.
no: Når du oppretter din `PhotoCollectionView`, vil `photoCollection`-egenskapen initieres med en referanse til modellens `photoCollection`. Den leverer alle data du trenger for å bygge bildegalleriet ditt.
pt: Quando você cria a `PhotoCollectionView`, a propriedade `photoCollection` é inicializada com uma referência à `photoCollection` do modelo. Ela fornece todos os dados que você precisa para construir sua galeria de fotos.
sv: När du skapar din `PhotoCollectionView` initieras `photoCollection`-egenskapen med en referens till modellens `photoCollection`. Den tillhandahåller alla data som du behöver för att bygga ditt bildgalleri.
th: เมื่อคุณสร้าง `PhotoCollectionView` ของคุณ คุณสมบัติ `photoCollection` จะสร้างค่าเริ่มต้นด้วยการอ้างอิงกับ `photoCollection` ของโมเดลของคุณ ซึ่งจะให้ข้อมูลทั้งหมดที่คุณต้องใช้ในการสร้างแกลเลอรี่รูปภาพของคุณ
tr: `PhotoCollectionView`’unu yaratırken `photoCollection` özelliği modelinin `photoCollection` referansı ile ilk değer atar. Fotoğraf galerini oluşturmak için gereken tüm verileri sağlar.
vi: Khi bạn tạo ra `PhotoCollectionView`, thuộc tính `photoCollection` khởi tạo một tham chiếu đến `photoCollection` của mô hình. Tham chiếu này cung cấp tất cả dữ liệu mà bạn cần để xây dựng phòng trưng bày ảnh của mình.
zh_cn: 创建 `PhotoCollectionView` 时，`photoCollection` 属性将通过引用模型的 `photoCollection` 进行初始化。它提供了构建照片画廊所需的所有数据。
zh_tw: 當你建立 `PhotoCollectionView` 時，`photoCollection` 屬性會使用對模型的 `photoCollection` 的參照進行初始化。它提供了建構照片圖庫所需的全部資料。

source: By making `photoCollection` an [observed object](glossary://observed%20object), SwiftUI updates your photo collection view in response to changes in the collection’s [published values](glossary://published%20value).
de: Wenn du `photoCollection` zu einem [beobachtbaren Objekt](glossary://observed%20object) machst, aktualisiert SwiftUI die Fotosammlungsansicht, wenn sich die [veröffentlichten Werte](glossary://published%20value) der Sammlung ändern.
es: Al hacer de `photoCollection` un [objeto observado](glossary://observed%20object), SwiftUI actualiza la vista de tu colección de fotos en respuesta a los cambios en los [valores publicados](glossary://published%20value) de la colección.
es_419: Al convertir la visualización `photoCollection` en un [objeto observado](glossary://observed%20object), SwiftUI la actualiza según los cambios en los [valores publicados](glossary://published%20value) de la colección.
fr: En faisant d’une propriété `photoCollection` un [objet observé](glossary://observed%20object), SwiftUI met à jour ta présentation par collection de photos en réponse à des changements dans les [valeurs publiées](glossary://published%20value) de la collection.
it: Rendendo `photoCollection` un [oggetto osservato](glossary://observed%20object), SwiftUI aggiorna la vista della tua raccolta fotografica in risposta ai cambiamenti dei [valori pubblicati](glossary://published%20value) della raccolta.
ja: `photoCollection`（フォトコレクション）を[オブザーブドオブジェクト](glossary://observed%20object)にすると、コレクションの[公開値](glossary://published%20value)の変化に応じて、SwifUIによってフォトコレクションビューがアップデートされます。
ko: `photoCollection`을 [관찰 가능한 객체](glossary://observed%20object)로 만듦으로써 SwiftUI는 모음의 [게시된 값](glossary://published%20value)에 있는 변경 사항에 따라 사진 모음 보기를 업데이트합니다.
nl: Door van `photoCollection` een [geobserveerd object](glossary://observed%20object) te maken, werkt SwiftUI de fotoverzameling bij in reactie op wijzigingen in de [gepubliceerde waarden](glossary://published%20value) van de verzameling.
no: Ved å gjøre `photoCollection` til et [observert objekt](glossary://observed%20object) oppdaterer SwiftUI bildesamlingsvisningen når samlingens [publiserte verdier](glossary://published%20value) endres.
pt: Ao transformar `photoCollection` em um [objeto observado](glossary://observed%20object), a SwiftUI atualiza a visualização de coleção de fotos em resposta às mudanças nos [valores publicados](glossary://published%20value) da coleção.
sv: När du gör `photoCollection` till ett [observerbart objekt](glossary://observed%20object) uppdaterar SwiftUI bildsamlingsvyn som svar på förändringar av samlingens [publicerade värden](glossary://published%20value).
th: เมื่อทำให้ `photoCollection` เป็น[วัตถุที่สังเกตการณ์](glossary://observed%20object) SwiftUI จะอัปเดตมุมมองคอลเลกชั่นรูปภาพของคุณตามการเปลี่ยนแปลงใน[ค่าที่เผยแพร่](glossary://published%20value)ของคอลเลกชั่น
tr: SwiftUI, `photoCollection`'ı [gözlemlenebilir nesne](glossary://observed%20object) hâline getirerek fotoğraf koleksiyonu görüntünü koleksiyonun [yayımlanan değerlerindeki](glossary://published%20value) değişikliklere yanıt olarak günceller.
vi: Bằng việc biến `photoCollection` thành một [đối tượng được quan sát](glossary://observed%20object), SwiftUI cập nhật chế độ xem bộ sưu tập ảnh của bạn tương ứng với các thay đổi trong các [giá trị đã đăng](glossary://published%20value) của bộ sưu tập.
zh_cn: 通过将 `photoCollection` 设为[被观测对象](glossary://observed%20object)，SwiftUI 会更新照片集视图来响应照片集[发布值](glossary://published%20value)的更改。
zh_tw: 透過將 `photoCollection` 設為[觀察的物件](glossary://observed%20object)，SwiftUI 會更新你的照片集顯示區以回應集合的[發佈數值](glossary://published%20value)的更動。
