Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: In this case you use the stream’s [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) function to convert each element — `$0` — into an [Image](doc://com.apple.documentation/documentation/swiftui/image) instance using an `image` property extension of `CIImage`. This transforms the stream of [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) instances into a stream of [Image](doc://com.apple.documentation/documentation/swiftui/image) instances.
de: In diesem Fall verwendest du die [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map)-Funktion (Zuordnung) des Streams, um jedes Element (`$0`) in eine [Image](doc://com.apple.documentation/documentation/swiftui/image)-Instanz (Bild) zu konvertieren. Dazu verwendest du eine `image`-Eigenschaftserweiterung von `CIImage`. Damit transformierst du den Stream aus [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-Instanzen in einen Stream aus [Image](doc://com.apple.documentation/documentation/swiftui/image)-Instanzen.
es: En este caso, usas la función [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) de la secuencia para convertir cada elemento (`$0`) en una instancia de [imagen](doc://com.apple.documentation/documentation/swiftui/image) usando una extensión de propiedad `image` de `CIImage`. Esto transforma la secuencia de instancias de [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) en una secuencia de instancias de [imagen](doc://com.apple.documentation/documentation/swiftui/image).
es_419: En este caso, se usa la función [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) del flujo para convertir cada elemento (`$0`) en una instancia de [Image](doc://com.apple.documentation/documentation/swiftui/image) utilizando una propiedad de extensión `image` de `CIImage`. Esto transforma el flujo de instancias de [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) en un flujo de instancias de [Image](doc://com.apple.documentation/documentation/swiftui/image).
fr: Dans ce cas, tu utilises la fonction [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) du flux pour convertir chaque élément — `$0` — en instance [Image](doc://com.apple.documentation/documentation/swiftui/image) à l’aide d’une extension de propriété `image` de `CIImage`. Ceci transforme le flux d’instances [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) en flux d’instances [Image](doc://com.apple.documentation/documentation/swiftui/image).
it: In questo caso, utilizzerai la funzione [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) del flusso per convertire ciascun elemento (`$0`) in un’istanza di [Image](doc://com.apple.documentation/documentation/swiftui/image), utilizzando un’estensione della proprietà `image` di `CIImage`. Questa operazione trasforma il flusso di istanze di [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) in un flusso di istanze di [Image](doc://com.apple.documentation/documentation/swiftui/image).
ja: ここでは、ストリームの[map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map)関数を使って、それぞれの要素（`$0`）を`CIImage`（コアイメージ）の`image`（イメージ）プロパティ拡張機能を使った[Image](doc://com.apple.documentation/documentation/swiftui/image)インスタンスに変換します。これにより、[CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)インスタンスが[Image](doc://com.apple.documentation/documentation/swiftui/image)インスタンスのストリームに変換されます。
ko: 이 예제에서는 스트림의 [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) 함수는 `CIImage`의 `image` 속성 확장자를 사용하여 각 요소(`$0`)를 [Image](doc://com.apple.documentation/documentation/swiftui/image) 인스턴스로 변환하는 데 사용됩니다. 이렇게 하면 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 인스턴스의 스트림이 [Image](doc://com.apple.documentation/documentation/swiftui/image) 인스턴스의 스트림으로 변환됩니다.
nl: In dit geval gebruik je de functie [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) van de stream om elk element (`$0`) om te zetten in een [Image](doc://com.apple.documentation/documentation/swiftui/image)-instantie met de `image`-eigenschapsextensie van `CIImage`. Hiermee transformeer je de stream met [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-instanties in een stream met [Image](doc://com.apple.documentation/documentation/swiftui/image)-instanties.
no: I dette tilfellet bruker du strømmens [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map)-funksjon til å konvertere hvert element – `$0` – til en [Image](doc://com.apple.documentation/documentation/swiftui/image)-instans ved hjelp av et `image`-egenskapstillegg for `CIImage`. Dette gjør om strømmen med [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-instanser til en strøm med [Image](doc://com.apple.documentation/documentation/swiftui/image)-instanser.
pt: Neste caso, use a função [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) do fluxo para converter cada elemento — `$0` — em uma instância [Image](doc://com.apple.documentation/documentation/swiftui/image) ao usar a extensão de propriedade `image` de `CIImage`. Isso transforma o fluxo de instâncias [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) em um fluxo de instâncias [Image](doc://com.apple.documentation/documentation/swiftui/image).
sv: I det här fallet använder du strömmens [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map)-funktion till att konvertera vartenda element – `$0` – till en [Image](doc://com.apple.documentation/documentation/swiftui/image)-instans med hjälp av ett `image`-egenskapstillägg för `CIImage`. Det här omvandlar strömmen med [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)-instanser till en ström med [Image](doc://com.apple.documentation/documentation/swiftui/image)-instanser.
th: ในกรณีนี้ คุณใช้ฟังก์ชั่น [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) ของสตรีมเพื่อแปลงองค์ประกอบแต่ละรายการ นั่นคือ `$0` เป็นชื่อแทนประเภท [Image](doc://com.apple.documentation/documentation/swiftui/image) โดยใช้ส่วนขยายคุณสมบัติ `image` ของ `CIImage` การทำงานนี้จะแปลงสตรีมของชื่อแทนประเภท [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) เป็นสตรีมของชื่อแทนประเภท [Image](doc://com.apple.documentation/documentation/swiftui/image)
tr: Bu durumda, `CIImage`’ın `image` özellik genişletmesini kullanarak her bir öğeyi (`$0`) bir [Görüntü](doc://com.apple.documentation/documentation/swiftui/image) örneğine dönüştürmek için yayının [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) fonksiyonunu kullanırsın. Bu, [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) örnekleri yayınını [Görüntü](doc://com.apple.documentation/documentation/swiftui/image) örnekleri yayınına dönüştürür.
vi: Trong trường hợp này, bạn sử dụng hàm [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) của luồng để chuyển đổi từng phần tử — `$0` — thành một thể hiện [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image) bằng một phần mở rộng thuộc tính `image` của `CIImage`. Việc này biến đổi luồng gồm các thể hiện [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) thành một luồng gồm các thể hiện [Hình ảnh](doc://com.apple.documentation/documentation/swiftui/image).
zh_cn: 在这种情况下，你将使用流的 [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map)（映射）函数，并通过 `CIImage` 的 `image` 属性扩展将每个元素 (即 `$0`) 转换为 [Image](doc://com.apple.documentation/documentation/swiftui/image) 实例。这个操作会将 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 实例流转换为 [Image](doc://com.apple.documentation/documentation/swiftui/image) 实例流。
zh_tw: 在這個例子中，你使用串流的 [map(_:)](doc://com.apple.documentation/documentation/swift/asyncsequence/3814580-map) 函數以及 `CIImage`’ 的 `image` 屬性延伸功能來將每一個元件 `$0` 轉換成 [Image](doc://com.apple.documentation/documentation/swiftui/image) 實例。這會將 [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 實例串流轉換為 [Image](doc://com.apple.documentation/documentation/swiftui/image) 實例串流。

source: Your `for`-`await` loop waits for each image in your transformed `imageStream` before doing something with it.
de: Deine `for`-`await`-Schleife (warten auf etwas für) wartet auf die einzelnen Bilder in deinem transformierten `imageStream`, bevor sie die Bilder verarbeitet.
es: El bucle `for`-`await` espera a cada imagen de la secuencia de imágenes (`imageStream`) transformadas antes de hacer algo con ello.
es_419: Tu ciclo `for`-`await` espera a cada imagen en tu flujo `imageStream` transformado antes de hacer algo con ella.
fr: Ta boucle `for`-`await` attend chaque image dans ton flux `imageStream` transformé avant de faire quelque chose avec.
it: Il ciclo `for`-`await` attende ciascuna immagine nel flusso `imageStream` trasformato prima di effettuare operazioni con ognuna di esse.
ja: `for`-`await`ループで、それぞれのイメージが変換後の`imageStream`（イメージストリーム）で届くのを待ってから、届いたイメージを使って処理を行います。
ko: `for`-`await` 루프는 변환된 `imageStream`의 각 이미지를 기다린 후, 이를 사용하여 작업을 수행합니다.
nl: Je `for`-`await`-lus wacht op elke afbeelding in je getransformeerde `imageStream` alvorens er iets mee te doen.
no: `for`-`await`-løkken venter på hvert bilde i den transformerte `imageStream` før den gjør noe med den.
pt: O loop `for`-`await` espera por cada imagem no `imageStream` transformado antes de fazer algo com isso.
sv: `for`-`await`-loopen väntar på varje bild i din omvandlade `imageStream` innan den gör något med den.
th: `for`-`await` loop ของคุณจะรอแต่ละภาพใน `imageStream` ที่แปลงแล้วของคุณก่อนจะทำบางอย่างกับภาพ
tr: `for`-`await` döngüsü, dönüştürülmüş `imageStream`’inle bir şey yapmadan önce tüm görüntüleri bekler.
vi: Vòng lặp `for`-`await` đợi từng hình ảnh trong `imageStream` được biến đổi của bạn trước khi thực hiện tác vụ nào đó.
zh_cn: `for`-`await`（等待中）循环会等待转换后的 `imageStream`（图像流）中的每张图像，然后才对它们执行一些操作。
zh_tw: 你的 `for`-`await` 迴圈在等待轉換後的 `imageStream` 中的每一個影像，然後對其進行處理。

source: Learn more about working with asynchronous sequences in the [Swift Programming Language Guide](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
de: In der [Swift-Programmiersprachenanleitung](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences) erfährst du mehr über das Arbeiten mit asynchronen Sequenzen.
es: Obtén más información sobre cómo trabajar con las secuencias asíncronas en el [Manual del lenguaje de programación de Swift](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
es_419: Obtén detalles sobre cómo trabajar con secuencias asincrónicas en el [Manual del lenguaje de programación Swift](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
fr: Obtiens d’avantage d’informations sur l’utilisation de séquences asynchrones dans le [guide du langage de programmation Swift](https://docs.swift.org/swift-book/LanguageGuide/Concurrency.html#ID640).
it: Puoi trovare ulteriori informazioni sulle sequenze asincrone nel [manuale del linguaggio di programmazione Swift](https://docs.swift.org/swift-book/LanguageGuide/Concurrency.html#ID640).
ja: 非同期シーケンスを操作する方法について詳しくは、[Swiftプログラミング言語ガイド](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences)を参照してください。
ko: [Swift 프로그래밍 언어 설명서](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences)에서 비동기 시퀀스 작업이 어떻게 작동하는지 더 알아보세요.
nl: Leer meer over het werken met asynchrone reeksen in de [Swift Programming Language Guide](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
no: Les mer om å arbeide med asynkrone sekvenser i [Swift Programming Language Guide](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
pt: Saiba mais sobre como trabalhar com sequências assíncronas no [Guia da Linguagem de Programação Swift](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences) (em inglês).
sv: Läs mer om att arbeta med asynkrona sekvenser i [Swift Programming Language Guide](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
th: เรียนรู้เพิ่มเติมเกี่ยวกับการทำงานกับลำดับแบบอะซิงโครนัสใน[คู่มือใช้ภาษาการเขียนโปรแกรมภาษา Swift](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences)
tr: [Swift Programlama Dili Kılavuzu’nda](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences) eşzamansız dizilişlerle çalışma hakkında daha fazla bilgi edin.
vi: Tìm hiểu thêm về cách làm việc với các trình tự không đồng bộ trong [Hướng dẫn ngôn ngữ lập trình Swift](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences).
zh_cn: 在 [Swift 编程语言指南](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences)中进一步了解使用异步序列。
zh_tw: 在 [Swift Programming Language Guide](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Asynchronous-Sequences) 中進一步瞭解使用非同步序列的相關資訊。

source: You use the image from the preview stream to update your data model’s `viewfinderImage` property.
de: Verwende das Bild aus dem Vorschau-Stream, um die Eigenschaft `viewfinderImage` (Sucherbild) deines Datenmodells zu aktualisieren.
es: Se utiliza la imagen de la secuencia de vista previa para actualizar la propiedad `viewfinderImage` de tu modelo de datos.
es_419: Usa la imagen del flujo de vista previa para actualizar la propiedad `"viewfinderImage"` de tu modelo de datos.
fr: Tu utilises l’image du flux d’aperçu pour mettre à jour la propriété `viewfinderImage` de ton modèle de données.
it: Utilizzerai l’immagine del flusso di anteprime per aggiornare la proprietà `viewfinderImage` del tuo modello di dati.
ja: プレビューストリームのイメージを使って、データモデルの`viewfinderImage`（ファインダーイメージ）プロパティをアップデートします。
ko: 미리보기 스트림의 이미지를 사용하여 데이터 모델의 `viewfinderImage` 속성을 업데이트합니다.
nl: Je gebruikt het beeld uit de voorvertoningsstroom om de eigenschap `viewfinderImage` van je gegevensmodel bij te werken.
no: Du bruker bildene fra forhåndsvisningsstrømmen til å oppdatere datamodellens `viewfinderImage`-egenskap.
pt: Você deve usar a imagem do fluxo de pré‑visualização para atualizar a propriedade `viewfinderImage` do modelo de dados.
sv: Du använder bilden från förhandsvisningsströmmen till att uppdatera datamodellens `viewfinderImage`-egenskap.
th: คุณใช้ภาพจากสตรีมการแสดงตัวอย่างเพื่ออัปเดตคุณสมบัติ `viewfinderImage` ของโมเดลข้อมูลของคุณ
tr: Veri modelinin `viewfinderImage` özelliğini güncellemek için önizleme yayınındaki resmi kullanırsın.
vi: Bạn sử dụng hình ảnh từ luồng xem trước để cập nhật thuộc tính `viewfinderImage` của mô hình dữ liệu.
zh_cn: 你将使用来自预览流的图像更新数据模型的 `viewfinderImage`（取景器图像）属性。
zh_tw: 你使用預覽串流中的影像來更新資料模型的 `viewfinderImage` 屬性。

source: SwiftUI makes sure that any views using this property get updated when the `viewfinderImage` value changes.
de: SwiftUI stellt sicher, dass alle Ansichten, die diese Eigenschaft verwenden, bei Änderungen am `viewfinderImage`-Wert aktualisiert werden.
es: SwiftUI se asegura de que cualquier vista que utilice esta propiedad se actualice cuando el valor `viewfinderImage` cambie.
es_419: SwiftUI se asegura de que las visualizaciones que usan esta propiedad se actualicen cuando haya cambios en el valor de `viewfinderImage`.
fr: SwiftUI s’assure que toutes les vues utilisant cette propriété sont mises à jour lorsque la valeur `viewfinderImage` change.
it: SwiftUI verifica che tutte le viste che utilizzano la proprietà vengano aggiornate quando il valore di `viewfinderImage` cambia.
ja: `viewfinderImage`（ファインダーイメージ）の値が変わると、SwiftUIによって、このプロパティを使用しているすべてのビューが確実にアップデートされます。
ko: SwiftUI는 `viewfinderImage` 값이 변경될 때 이 속성을 사용하는 모든 보기가 업데이트되도록 합니다.
nl: SwiftUI zorgt ervoor dat weergaven die deze eigenschap gebruiken, worden bijgewerkt wanneer de waarde van `viewfinderImage` verandert.
no: SwiftUI sørger for at alle visninger som bruker denne egenskapen, blir oppdatert når `viewfinderImage`-verdien endres.
pt: A SwiftUI garante que qualquer visualização que use essa propriedade seja atualizada quando o valor de `viewfinderImage` muda.
sv: SwiftUI ser till att alla vyer som använder den här egenskapen blir uppdaterade när `viewfinderImage`-värdet ändras.
th: SwiftUI จะตรวจสอบให้แน่ใจว่ามุมมองที่ใช้คุณสมบัตินี้ได้รับการอัปเดตเมื่อค่า `viewfinderImage` เปลี่ยนแปลง
tr: SwiftUI, bu özelliği kullanan görüntülerin `viewfinderImage` değeri değiştiğinde güncellendiğinden emin olur.
vi: SwiftUI đảm bảo rằng bất kỳ chế độ xem nào sử dụng thuộc tính này đều được cập nhật khi giá trị `viewfinderImage` thay đổi.
zh_cn: SwiftUI 会确保在 `viewfinderImage` 值更改时，使用这个属性的任何视图都会更新。
zh_tw: SwiftUI 可確保使用此屬性的任何顯示區在 `viewfinderImage` 值改變時都會進行更新。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup0..TaskviewPreviews..title
source: Viewing the Preview Stream
de: Vorschau-Stream anzeigen
es: Ver la secuencia de vista previa
es_419: Mostrar el flujo de vista previa
fr: Affichage du flux d’aperçu
it: Visualizzare il flusso di anteprime
ja: プレビューストリームを表示する
ko: 미리보기 스트림 보기
nl: De voorvertoningsstroom bekijken
no: Vise forhåndsvisningsstrømmen
pt: Visualizando o Fluxo de Pré‑visualização
sv: Visa förhandsvisningsströmmen
th: การดูสตรีมการแสดงตัวอย่าง
tr: Önizleme Yayınını Görüntüleme
vi: Xem Luồng xem trước
zh_cn: 查看预览流
zh_tw: 檢視預覽串流

source: See how you can connect your viewfinder view to the processed preview stream.
de: Sieh dir an, wie du deine Sucheransicht mit dem verarbeiteten Vorschau-Stream verbinden kannst.
es: Descubre cómo puedes conectar la vista del visor con la secuencia de vista previa procesada.
es_419: Descubre cómo conectar tu visor con el flujo de vista previa procesado.
fr: Découvre comment tu peux connecter la vue de ton viseur au flux d’aperçu traité.
it: Impara a collegare la vista del mirino al flusso di anteprime elaborato.
ja: ファインダービューを処理済みのプレビューストリームに接続する方法を見てみましょう。
ko: 뷰파인더 보기를 처리된 미리보기 스트림에 연결하는 방법을 확인해 보세요.
nl: Ontdek hoe je de zoekerweergave kunt koppelen aan de verwerkte voorvertoningsstroom.
no: Se hvordan du kan koble søkervisningen til den behandlede forhåndsvisningsstrømmen.
pt: Veja como você pode conectar a visualização do visor ao fluxo de pré‑visualização processado.
sv: Se hur du kan ansluta sökarvyn till den bearbetade förhandsvisningsströmmen.
th: ดูวิธีที่คุณสามารถเชื่อมต่อมุมมองช่องมองภาพของคุณกับสตรีมการแสดงตัวอย่างที่ประมวลผลแล้ว
tr: Vizör görüntünü işlenen önizleme yayınına nasıl bağlayabileceğini gör.
vi: Xem cách bạn có thể kết nối chế độ xem kính ngắm với luồng xem trước được xử lý.
zh_cn: 了解如何将取景器视图连接到处理后的预览流。
zh_tw: 瞭解如何將觀景窗顯示區連接到已處理的預覽串流。

source: Your `CameraView` has a `ViewfinderView` that it uses to display live video from the camera.
de: Die Ansicht `CameraView` enthält die Ansicht `ViewfinderView`, die Livevideo von der Kamera anzeigt.
es: `CameraView` tiene una propiedad `ViewfinderView` que usa para mostrar el vídeo en directo de la cámara.
es_419: Tu propiedad `CameraView` tiene una visualización `ViewfinderView` que usa para mostrar el video en vivo de la cámara.
fr: Ta `CameraView` possède une `ViewfinderView`, qu’elle utilise pour afficher la vidéo en direct provenant de l’appareil photo.
it: `CameraView` ha un valore `ViewfinderView` che viene utilizzato per mostrare il video dal vivo dalla fotocamera.
ja: `CameraView`（カメラビュー）には、カメラからのライブ映像を表示するために使用する`ViewfinderView`（ファインダービュー）があります。
ko: `CameraView`에는 카메라의 라이브 영상을 표시하는 데 사용되는 `ViewfinderView`가 있습니다.
nl: Je `CameraView` heeft een `ViewfinderView` voor het weergeven van de livevideo van de camera.
no: `CameraView` har en `ViewfinderView` som den bruker til å vise direktestrømmet video fra kameraet.
pt: `CameraView` tem uma `ViewfinderView`, usada para mostrar o vídeo ao vivo da câmera.
sv: `CameraView` har en `ViewfinderView` som den använder till att visa den direktströmmande videon från kameran.
th: `CameraView` ของคุณมี `ViewfinderView` ที่ใช้สำหรับแสดงผลวิดีโอสดจากกล้อง
tr: `CameraView`’unda kameradan canlı video görüntülemek için kullandığı bir `ViewfinderView` vardır.
vi: `CameraView` của bạn có một `ViewfinderView` được sử dụng để hiển thị video trực tiếp từ camera.
zh_cn: `CameraView`（相机视图）有一个 `ViewfinderView`（取景器视图），用于显示来自相机的实时视频。
zh_tw: 你的 `CameraView` 有一個 `ViewfinderView` 可用來顯示來自相機的即時影片。
