Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: When you take a photo, the camera captures image data from its sensor. Learn how to initiate this, and handle the resulting captured photo.
de: Wenn du ein Foto aufnimmst, zeichnet die Kamera Bilddaten von ihrem Sensor auf. Lerne, wie du diesen Vorgang auslöst und das aufgenommene Foto verarbeitest.
es: Cuando haces una foto, la cámara captura los datos de la imagen de su sensor. Aprende a iniciar esto y a gestionar la foto capturada resultante.
es_419: Cuando tomas una foto, la cámara usa su sensor para capturar los datos de la imagen. Descubre cómo iniciar esto, y cómo administrar la foto capturada.
fr: Quand tu prends une photo, l’appareil photo capture des données d’image provenant de son capteur. Découvre comment initier ce processus et gérer la photo qui a été prise.
it: Quando scatti una foto, la fotocamera acquisisce i dati dell’immagine dal sensore. Scopri come iniziare il processo e gestire la foto acquisita che ne risulta.
ja: 写真を撮影すると、カメラのセンサーからイメージデータが取り込まれます。この処理を開始する方法、および結果として取り込まれた写真を処理する方法を学びましょう。
ko: 사진을 촬영할 때, 카메라는 센서에서 이미지 데이터를 캡처합니다. 이 작업을 시작하는 방법과 캡처된 사진을 처리하는 방법을 배워보세요.
nl: Wanneer je een foto maakt, legt de camera beeldgegevens uit de sensor vast. Lees hoe je dit proces start en hoe je de resulterende vastgelegde foto verwerkt.
no: Når du tar et bilde, samler kameraet inn bildedata fra sensoren. Finn ut hvordan du utfører dette, og hvordan du behandler bildet som tas.
pt: Quando você tira uma foto, a câmera captura dados de imagem a partir do sensor. Saiba como iniciar isso e controlar a foto capturada resultante.
sv: När du tar en bild samlar kameran in bilddata från dess sensor. Lär dig hur du initierar detta och hanterar bilden som tas till en följd av detta.
th: เมื่อคุณถ่ายรูป กล้องจะจับภาพข้อมูลภาพจากเซ็นเซอร์ของกล้อง เรียนรู้วิธีเริ่มต้นการทำงานนี้และจัดการรูปภาพที่ถ่าย
tr: Fotoğraf çektiğinde, kamera sensöründen resim verilerini yakalar. Bunu nasıl başlatacağını öğren ve sonuçta yakalanan fotoğrafı işle.
vi: Khi bạn chụp ảnh, camera ghi lại dữ liệu hình ảnh từ cảm biến. Tìm hiểu cách khởi tạo việc này và xử lý kết quả ảnh được ghi lại.
zh_cn: 拍摄照片时，相机会从传感器捕捉图像数据。了解如何启动这个过程，以及如何处理捕捉到的照片。
zh_tw: 當你拍照時，相機會從其感測器擷取影像資料。瞭解如何啟動此操作，並處理產生的擷取照片。

source: When you take a photo, you want to capture an image with the highest possible resolution. This contrasts with the preview images, which tend to have a lower resolution to facilitate rapidly updating previews in the viewfinder.
de: Wenn du ein Foto aufnimmst, soll es im Gegensatz zu den Vorschaubildern die bestmögliche Auflösung haben. Die Vorschaubilder haben eine geringere Auflösung, damit die Vorschau im Sucher schneller aktualisiert werden kann.
es: Cuando haces una foto, quieres capturar una imagen con la mayor resolución posible. Esto contrasta con las imágenes de previsualización, que suelen tener una resolución menor para facilitar la actualización rápida de la previsualización en el visor.
es_419: Cuando tomas una foto, quieres capturar una imagen con la mayor resolución posible. Esto contrasta con las imágenes de vista previa, que suelen ser de menor resolución para permitir que se actualicen rápidamente las vistas previas en el visor.
fr: Quand tu prends une photo, tu veux capturer une image avec la meilleure résolution possible. Cela contraste avec les images d’aperçu, qui ont tendance à avoir une moins bonne résolution pour faciliter la mise à jour rapide des aperçus dans le viseur.
it: Quando scatti una foto, di solito vuoi un’immagine con la più alta risoluzione possibile. Questo è in contrasto con ciò che avviene per le immagini di anteprima, le quali, invece, tendono ad avere una risoluzione inferiore per facilitare l’aggiornamento rapido delle anteprime nel mirino.
ja: 写真を撮影するときは、可能な限り高い解像度のイメージを取り込みたいでしょう。これは、ファインダーのプレビューを素早くアップデートしやすくするために解像度が低くなる傾向があるプレビューイメージとは対照的です。
ko: 사진을 촬영할 때 가능한 한 가장 높은 해상도의 이미지를 캡처하고자 합니다. 이에 비해 미리보기 이미지는 해상도가 낮아 뷰파인더에서 미리보기를 빠르게 업데이트할 수 있습니다.
nl: Wanneer je een foto maakt, wil je een afbeelding met de hoogst mogelijke resolutie. Dit in tegenstelling tot de voorvertoningsbeelden die doorgaans een lagere resolutie hebben voor het snel bijwerken van voorvertoningen in de zoeker.
no: Når du tar et bilde, vil du vanligvis ha et bilde med så høy oppløsning som mulig. Det skiller seg fra forhåndsvisningsbildene som vanligvis har lavere oppløsning, slik at forhåndsvisningene i søkeren kan oppdateres raskt.
pt: Ao tirar uma foto, você quer capturar uma imagem com a resolução mais alta possível. Isso contrasta com as imagens de pré‑visualização, que tendem a ter uma resolução mais baixa para facilitar a atualização rápida das pré‑visualizações no visor.
sv: När du tar en bild vill du vanligtvis ha en bild med högsta möjliga upplösning. De bilderna skiljer sig från förhandsvisningsbilderna som ofta har lägre upplösning så att de kan användas till att snabbt uppdatera förhandsvisningarna i sökaren.
th: เมื่อคุณถ่ายรูป คุณต้องการถ่ายรูปที่มีความละเอียดสูงสุดเท่าที่จะเป็นไปได้ ซึ่งจะแตกต่างจากภาพการแสดงตัวอย่างที่มีแนวโน้มที่จะมีความละเอียดต่ำลงเพื่อช่วยให้อัปเดตการแสดงตัวอย่างในช่องมองภาพได้อย่างรวดเร็ว
tr: Fotoğraf çekerken olabilecek en yüksek çözünürlüğe sahip bir görüntü yakalamak istersin. Bu, vizördeki önizlemelerin hızlı bir şekilde güncellenmesine yardımcı olması için çözünürlüğü daha düşük tutulan önizleme görüntüleriyle çelişir.
vi: Khi chụp một bức ảnh, bạn muốn ghi lại hình ảnh với độ phân giải cao nhất có thể. Việc này trái ngược với hình ảnh xem trước, có xu hướng có độ phân giải thấp hơn để dễ dàng cập nhật nhanh bản xem trước trong kính ngắm.
zh_cn: 拍摄照片时，你通常希望以尽可能高的分辨率捕捉图像。但预览图像与此相反，它们往往分辨率较低，以便在取景器中快速更新预览。
zh_tw: 當你拍照時，會想要盡可能得到最高解析度的影像。這與預覽影像形成對比，低解析度影像方便用來快速更新觀景窗中的預覽。

source: Your camera has a special photo output that its `takePhoto()` method uses to capture high-resolution images of what you see in the viewfinder.
de: Deine Kamera verfügt über eine spezielle Fotoausgabe, die von der Methode `takePhoto()` (Foto aufnehmen) genutzt wird, um hochaufgelöste Bilder davon aufzunehmen, was du im Sucher siehst.
es: Tu cámara tiene una salida fotográfica especial que su método `takePhoto()` usa para capturar imágenes de alta resolución de lo que ves en el visor.
es_419: Tu cámara tiene una salida de foto especial que su método `takePhoto()` usa para capturar imágenes de alta resolución de lo que se ve en el visor.
fr: Ton appareil photo possède une sortie photo spéciale qui est utilisée par sa méthode `takePhoto()` pour capturer des images en haut résolution de ce que tu vois dans le viseur.
it: La fotocamera è dotata di uno speciale output fotografico, utilizzato dal metodo `takePhoto()` per acquisire immagini ad alta risoluzione di ciò che vedi nel mirino.
ja: カメラには、ファインダーで見ているものの高解像度のイメージを取り込むために`takePhoto()`（写真を撮影）メソッドで使用する特殊な写真出力があります。
ko: 이 카메라는 뷰파인더에 보이는 것을 고해상도 이미지로 캡처하기 위해 `takePhoto()` 메소드에서 사용하는 특별한 사진 출력 기능을 제공합니다.
nl: Je camera heeft een speciale foto-uitvoer die door de `takePhoto()`-methode van de camera wordt gebruikt om wat je in de zoeker ziet in afbeeldingen een hoge resolutie vast te leggen.
no: Kameraet har spesielle bildeutdata som `takePhoto()`-metoden bruker til å ta høyoppløste bilder av det du ser i søkeren.
pt: A câmera tem uma saída de fotos especial que o método `takePhoto()` usa para capturar imagens em alta resolução daquilo que você vê no visor.
sv: Kameran har en särskild bildutmatning som använder metoden `takePhoto()` till att ta högupplösta bilder av det som visas i sökaren.
th: กล้องของคุณมี output รูปภาพแบบพิเศษที่วิธีการ `takePhoto()` ของกล้องใช้เพื่อจับภาพความละเอียดสูงของสิ่งที่คุณเห็นในช่องมองภาพ
tr: Kameranda, `takePhoto()` metodunu vizörde gördüklerinin yüksek çözünürlüklü görüntülerini yakalamak için kullanan özel bir fotoğraf çıktısı vardır.
vi: Camera của bạn có một đầu ra ảnh đặc biệt mà phương thức `takePhoto()` sử dụng để ghi lại hình ảnh có độ phân giải cao của những gì mà bạn nhìn thấy trong kính ngắm.
zh_cn: 相机有一个特殊的照片输出，它的 `takePhoto()` 方法会使用这个输出，将你在取景器中看到的景象捕捉为高分辨率的图像。
zh_tw: 你的相機有一項特殊的照片輸出，它的 `takePhoto()` 方法用來擷取你在觀景窗中看到的高解析度影像。

source: You start the real work of taking the photo by requesting the photo output to capture a photo.
de: Die tatsächliche Arbeit beim Aufnehmen eines Fotos beginnt, wenn du die Fotoausgabe anweist, ein Foto aufzunehmen.
es: El verdadero trabajo de hacer la foto se inicia solicitando a la salida fotográfica que capture una foto.
es_419: Para empezar a tomar fotos, solicita a la salida de foto que capture una foto.
fr: Le véritable processus de prise d’une photo commence lorsque tu demandes à la sortie photo de prendre une photo.
it: La proceduta per scattare una foto inizia davvero quando richiedi all’output fotografico di acquisire una foto.
ja: 写真撮影の実際の作業は、写真を取り込むために写真出力をリクエストすることから始まります。
ko: 사진을 촬영하는 실제 작업은 사진을 캡처하기 위해 사진 출력을 요구하는 것으로 시작됩니다.
nl: Als je daadwerkelijk een foto wilt gaan maken, vraag je om te beginnen de foto-uitvoer om een foto vast te leggen.
no: Det virkelige arbeidet med å ta bildet begynner med å be bildeutdataene om å ta et bilde.
pt: O verdadeiro trabalho de tirar a foto começa quando se pede que a saída de foto capture uma foto.
sv: Det verkliga arbetet med att ta en bild startar med att begära att bildutmatningen tar en bild.
th: คุณเริ่มการทำงานของการถ่ายรูปอย่างแท้จริงโดยส่งคำขอให้ output รูปภาพถ่ายรูป
tr: Fotoğrafı yakalamak için fotoğraf çıktısını isteyerek gerçek fotoğraf çekme işine başlarsın.
vi: Bạn bắt đầu công việc chụp ảnh thực tế bằng cách yêu cầu đầu ra ảnh ghi lại một bức ảnh.
zh_cn: 请求这个照片输出捕捉照片，这样就能真正开始拍照了。
zh_tw: 你可以透過要求照片輸出來擷取照片，進而開始真正的拍照工作。

source: If all goes well, this is when you hear a reassuring shutter sound to let you — and anyone nearby — know that you’ve just taken a photo.
de: Wenn alles gut geht, hörst du jetzt zur Bestätigung ein Geräusch des Verschlusses. Dies bestätigt dir und allen Personen in deiner Umgebung, dass du gerade ein Foto aufgenommen hast.
es: Si todo va bien, en ese momento se oye un sonido tranquilizador del obturador para que tú (y todos los que estén cerca) sepan que acabas de hacer una foto.
es_419: Si todo sale bien, tú y todos los que están cerca escucharán el familiar sonido del obturador que indicará que acabas de tomar una foto.
fr: Si tout se passe bien, c’est le moment où tu entends le son rassurant de l’obturateur pour t’indiquer, ainsi qu’aux personnes à proximité, que tu viens de prendre une photo.
it: Se tutto va come previsto, sentirai il rumore rassicurante dell’otturatore, che segnala a te e a coloro che si trovano nelle vicinanze che hai appena scattato una foto.
ja: すべてがうまくいけば、このタイミングで再確認のシャッター音が聞こえ、あなた（および近くにいる人）に写真が撮影されたことが知らされます。
ko: 모든 것이 계획대로 진행되면 셔터 소리가 들리며, 이로 인해 여러분과 주변 사람은 방금 사진을 촬영했음을 알게 됩니다.
nl: Als alles goed gaat, hoor je nu het geruststellende geluid van de sluiter, zodat jij en anderen in de buurt weten dat je net een foto hebt gemaakt.
no: Hvis alt går som det skal, hører du en lukkerlyd som forteller deg – og alle i nærheten – at du nettopp har tatt et bilde.
pt: Se tudo estiver certo, esse é o momento quando você ouve um som que confirma a abertura do obturador, para que você (e qualquer pessoa por perto) saiba que a foto acabou de ser tirada.
sv: Om allt går som det ska hör du nu slutarljudet så att du – och alla i närheten – hör att du precis har tagit en bild.
th: ถ้าทุกอย่างผ่านไปได้ด้วยดี คุณก็จะได้ยินเสียงชัตเตอร์ที่น่าอุ่นใจที่บอกให้คุณและทุกคนที่อยู่ใกล้เคียงรู้ว่าคุณเพิ่งถ่ายรูปไป
tr: Her şey yolunda giderse tam bu anda senin ve yakındaki kişilerin bir fotoğraf çektiğini öğrenmenizi sağlayacak, tekrarlayan bir deklanşör sesi duyarsın.
vi: Nếu mọi việc diễn ra thuận lợi, đó là khi bạn nghe thấy âm thanh chụp khẳng định để cho phép bạn — và bất kỳ người nào ở gần — biết rằng bạn vừa chụp một bức ảnh.
zh_cn: 如果一切顺利，这时你会听到意料中的快门声，告诉你和周围的所有人，你刚刚拍了一张照片。
zh_tw: 如果一切順利，這時你會聽到令人放心的快門聲，讓你和附近的任何人都知道你剛剛拍了一張照片。

source: You might wonder why `capturePhoto` doesn’t just return the photo. That’s because capturing a photo takes time: the camera may need to focus, or wait for the flash, and then there’s the exposure time. The `capturePhoto` method is [asynchronous](glossary://asynchronous%20process), with the captured photo typically arriving a short time after you tap or click the shutter button.
de: Möglicherweise fragst du dich, warum `capturePhoto` (Foto aufnehmen) kein Foto ausgibt. Das liegt daran, dass das Aufnehmen eines Fotos Zeit benötigt: die Kamera muss scharf stellen, auf den Blitz warten und dazu kommt noch die Belichtungszeit. Die Methode `capturePhoto` ist [asynchron](glossary://asynchronous%20process) und das aufgenommene Foto trifft üblicherweise kurz nach dem Tippen oder Klicken des Auslösers ein.
es: Te preguntarás por qué `capturePhoto` no devuelve la foto sin más. Eso es porque capturar una foto lleva tiempo: es posible que la cámara tenga que enfocar, o esperar al flash, y luego está el tiempo de exposición. El método `capturePhoto` es [asíncrono](glossary://asynchronous%20process), por lo que la foto capturada suele llegar poco después de tocar o pulsar el botón del obturador.
es_419: Quizá te preguntes por qué `capturePhoto` no simplemente devuelve la foto. Esto se debe a que capturar una foto lleva tiempo: la cámara puede necesitar enfocar, esperar al flash o tener un tiempo de exposición mayor. El método `capturePhoto` es [asincrónico](glossary://asynchronous%20process), y la foto capturada suele tardar un breve momento en llegar después de tocar o presionar el obturador.
fr: Tu te demandes peut-être pourquoi `capturePhoto` ne renvoie pas simplement la photo. C’est dû au fait que prendre une photo, ça prend du temps : l’appareil photo a peut-être besoin de faire une mise au point ou attendre le flash, sans compter le temps d’exposition. La méthode `capturePhoto` est [asynchrone](glossary://asynchronous%20process). La photo capturée arrive généralement peu de temps après que tu touches le bouton d’obturateur ou cliques dessus.
it: Potresti chiederti come mai `capturePhoto` non restituisce nessuna foto. Questo succede perché acquisire una foto richiede un certo tempo: la fotocamera deve mettere a fuoco l’immagine o attendere il flash, senza considerare il tempo di esposizione. Il metodo `capturePhoto` è [asincrono](glossary://asynchronous%20process), quindi, la foto acquisita tipicamente arriva poco dopo aver selezionato il pulsante di scatto.
ja: なぜ`capturePhoto`（写真を撮影）からすぐに写真が返されないのか不思議に思うかもしれません。それは、写真の取り込みには時間がかかるからです。場合によってはピントを合わせたりフラッシュが光るのを待ったりする必要があり、そのあとには露光時間があります。`capturePhoto`（写真を取り込む）メソッドは[非同期](glossary://asynchronous%20process)で、取り込まれた写真は、通常はシャッターボタンをタップまたはクリックして少したってから到着します。
ko: 왜 `capturePhoto`에서 즉시 사진이 반환되지 않는지 궁금해할 수 있습니다. 그 이유는 경우에 따라서 초점을 맞추거나 플래시를 기다려야 하며, 그 후에는 노출 시간으로 인해 사진을 캡처하는 데 시간이 걸리기 때문입니다. `capturePhoto` 메소드는 [비동기](glossary://asynchronous%20process)이며, 일반적으로 캡처된 사진은 셔터 버튼을 탭 또는 클릭한 후 잠시 후에 나타나게 됩니다.
nl: Je vraagt je misschien af waarom `capturePhoto` niet simpelweg de foto retourneert. Dat komt omdat het maken van een foto tijd kost: de camera moet mogelijk scherpstellen, of wachten op de flitser, en dan is er nog de belichtingstijd die in aanmerking moet worden genomen. De `capturePhoto`-methode is een [asynchroon](glossary://asynchronous%20process) proces, waarbij de vastgelegde foto doorgaans een korte tijd nadat je op de sluiterknop hebt getikt of geklikt, arriveert.
no: Det kan hende du lurer på hvorfor `capturePhoto` ikke bare returnerer bildet. Det skyldes at det tar tid å ta et bilde. Det kan hende at kameraet må fokusere eller vente på blitsen, og deretter kreves det en viss eksponeringstid. `capturePhoto`-metoden er [asynkron](glossary://asynchronous%20process), og bildet som tas, kommer vanligvis en kort tid etter at du trykker eller klikker på utløserknappen.
pt: Talvez você esteja se perguntando por que `capturePhoto` não retorna a foto logo. A captura de uma foto leva tempo: a câmera precisa focar ou esperar pelo flash e, depois disso, há o tempo de exposição. O método `capturePhoto` é [assíncrono](glossary://asynchronous%20process), o que faz com que a foto capturada chague pouco tempo depois de tocar ou clicar no botão obturador.
sv: Du kanske undrar varför `capturePhoto` inte bara returnerar bilden. Det beror på att det tar tid att ta en bild: kameran kanske måste fokusera, eller vänta på blixten, och sedan krävs en viss exponeringstid. `capturePhoto`-metoden är [asynkron](glossary://asynchronous%20process) och den tagna bilden anländer vanligtvis en aning efter att du har tryckt eller klickat på slutarknappen.
th: คุณอาจสงสัยว่าทำไม `capturePhoto` ถึงไม่คืนค่ารูปภาพกลับมาเลย นั่นเป็นเพราะว่าการถ่ายรูปใช้เวลาพอสมควร กล้องอาจต้องการโฟกัสหรือรอแฟลช จากนั้นก็จะมีเวลาการเปิดรับแสงอีก วิธีการ `capturePhoto` จึงเป็นแบบ[อะซิงโครนัส](glossary://asynchronous%20process) ซึ่งโดยปกติแล้วรูปภาพที่ถ่ายจะมาถึงในระยะเวลาสั้นๆ หลังจากที่คุณแตะหรือคลิกปุ่มชัตเตอร์
tr: `capturePhoto`'nun neden yalnızca fotoğraf döndürmediğini merak ediyor olabilirsin. Bunun nedeni, fotoğraf yakalamanın zaman almasıdır: Kameranın odaklanması veya flaşı beklemesi gerekebilir, sonra da pozlama süresi gelir. `capturePhoto`, yakalanan fotoğrafın genellikle sen deklanşör düğmesine dokunduktan veya tıkladıktan kısa bir süre sonra ulaştığı [eşzamansız](glossary://asynchronous%20process) bir metottur.
vi: Có thể bạn thắc mắc tại sao `capturePhoto` không chỉ đơn giản trả về bức ảnh. Đó là vì việc ghi lại một bức ảnh cần thời gian: camera có thể cần lấy nét hoặc đợi đèn flash và sau đó là thời gian phơi sáng. `capturePhoto` là một phương thức [không đồng bộ](glossary://asynchronous%20process), với ảnh được ghi lại thường xuất hiện sau một khoảng thời gian ngắn sau khi bạn chạm hoặc bấm nút chụp.
zh_cn: 你可能会想，`capturePhoto`（捕捉照片）为什么不直接返回照片。这是因为捕捉照片需要时间：相机可能需要对焦或者等待闪光灯亮起，然后曝光也需要时间。`capturePhoto` 方法是[异步](glossary://asynchronous%20process)进行的，捕捉到的照片通常将在你轻点或点按快门按钮的一小段时间之后到达。
zh_tw: 你可能想知道為什麼 `capturePhoto` 不只是傳回照片。那是因為拍攝照片需要時間：相機可能需要對焦，或者等待閃光燈，然後是曝光的時間。`capturePhoto` 方法是[非同步](glossary://asynchronous%20process)的，拍攝的照片通常會在你點按快門按鈕的稍後到達。

source: After the photo capture has completed, you receive a [callback](glossary://callback) to another method in your camera object: `photoOutput(_:didFinishProcessingPhoto:error:)`.
de: Nachdem die Fotoaufnahme abgeschlossen wurde, erhältst du einen [Callback](glossary://callback) an eine Stellvertretermethode in deinem Kameraobjekt: `photoOutput(_:didFinishProcessingPhoto:error:)`.
es: Una vez completada la captura de la foto, recibes una acción de [callback](glossary://callback) a otro método en el objeto de tu cámara: `photoOutput(_:didFinishProcessingPhoto:error:)`.
es_419: Cuando se complete la captura de la foto, recibirás una [devolución de llamada](glossary://callback) a otro método en tu objeto de cámara: `photoOutput(_:didFinishProcessingPhoto:error:)`.
fr: Après que la photo a été prise, tu reçois un [rappel](glossary://callback) vers une autre méthode dans l’objet de ton appareil photo : `photoOutput(_:didFinishProcessingPhoto:error:)`.
it: Dopo che la foto sarà stata acquisita, riceverai una [richiamata](glossary://callback) a un altro metodo nel tuo oggetto fotocamera `photoOutput(_:didFinishProcessingPhoto:error:)`.
ja: 写真の取り込みが完了すると、カメラオブジェクトの別のメソッドへの[コールバック](glossary://callback)である`photoOutput(_:didFinishProcessingPhoto:error:)`（写真出力）が返されます。
ko: 사진 캡처가 완료된 후, 카메라 객체의 다른 메소드인 `photoOutput(_:didFinishProcessingPhoto:error:)`에 대한 [콜백](glossary://callback)을 받게 됩니다.
nl: Nadat het vastleggen van de foto is voltooid, ontvang je een [callback](glossary://callback) naar een andere methode in je camera-object: `photoOutput(_:didFinishProcessingPhoto:error:)`.
no: Når bildet er tatt, får du en [callback](glossary://callback) til en annen metode i kameraobjektet: `photoOutput(_:didFinishProcessingPhoto:error:)`.
pt: Depois que a captura da foto for concluída, você receberá um [retorno](glossary://callback) para outro método no objeto de câmera: `photoOutput(_:didFinishProcessingPhoto:error:)`.
sv: När bildtagningen är klar får du en [callback](glossary://callback) till en annan metod i kameraobjektet: `photoOutput(_:didFinishProcessingPhoto:error:)`.
th: หลังจากถ่ายรูปเสร็จแล้ว คุณจะได้รับ[การเรียกกลับ](glossary://callback)ไปยังอีกวิธีการหนึ่งในวัตถุกล้องของคุณ: `photoOutput(_:didFinishProcessingPhoto:error:)`
tr: Fotoğraf yakalama tamamlandıktan sonra kamera nesnendeki başka bir metoda [geri çağırma](glossary://callback) alırsın: `photoOutput(_:didFinishProcessingPhoto:error:)`.
vi: Sau khi quá trình ghi lại ảnh hoàn tất, bạn nhận được một [gọi lại](glossary://callback) cho một phương thức khác trong đối tượng camera: `photoOutput(_:didFinishProcessingPhoto:error:)`.
zh_cn: 照片捕捉完成后，你会收到对相机对象中另一个方法 `photoOutput(_:didFinishProcessingPhoto:error:)` 的[回调](glossary://callback)。
zh_tw: 完成拍照後，你會在相機物件中接收到一個目標為另一個方法的[回呼](glossary://callback)：`photoOutput(_:didFinishProcessingPhoto:error:)`。

source: Its first argument receives the captured photo as an instance of [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
de: Das erste Argument erhält das aufgenommene Foto als Instanz von [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
es: Su primer argumento recibe la foto capturada como una instancia de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
es_419: Su primer argumento recibe la foto capturada como una instancia de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
fr: Son premier argument reçoit la photo prise comme instance de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
it: Il suo primo argomento riceve la foto acquisita come istanza di [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
ja: 最初の引数では、[AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)のインスタンスとして取り込まれた写真を受け取ります。
ko: 첫 번째 인수는 캡처된 사진을 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)의 인스턴스로 수신합니다.
nl: Het eerste argument ervan ontvangt de vastgelegde foto als een instantie van [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
no: Dens første argument mottar bildet som en instans av [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
pt: Seu primeiro argumento recebe a foto capturada como uma instância de [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
sv: Dess första argument tar emot den tagna bilden som en instans av [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
th: อาร์กิวเมนต์แรกจะรับรูปภาพที่ถ่ายเป็นชื่อแทนประเภทของ [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/)
tr: İlk argümanı, yakalanan fotoğrafı bir [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) örneği olarak alır.
vi: Đối số đầu tiên nhận được ảnh đã ghi dưới dạng một thể hiện của [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/).
zh_cn: 它的第一个实参会接收捕捉到的照片，作为 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 的实例。
zh_tw: 它的第一個引數會接收擷取的照片作為 [AVCapturePhoto](doc://com.apple.documentation/documentation/avfoundation/avcapturephoto/) 的一個實例。
