Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: And that’s fine! The data model’s job is to coordinate data flow between the app’s data objects.
de: Und das ist gut! Die Aufgabe des Datenmodells besteht darin, den Datenfluss zwischen den Datenobjekten der App zu koordinieren.
es: ¡Y eso está bien! El trabajo de tu modelo de datos es coordinar el flujo de datos entre los objetos de datos de la app.
es_419: Pero eso está bien, porque el trabajo del modelo de datos es coordinar el flujo de datos entre los objetos de datos de la app.
fr: Aucun problème avec ça ! Le travail de ton modèle de données consiste à coordonner le flux de données entre les objets de données dans ton app.
it: Va benissimo così! La funzione del modello di dati è coordinare il flusso di dati tra i diversi oggetti di dati dell’app.
ja: でも、それでいいんです! データモデルの仕事は、Appのデータオブジェクト間のデータフローを調整することです。
ko: 그래도 괜찮습니다. 데이터 모델의 역할은 앱의 데이터 객체 사이의 데이터 흐름을 조정하는 것이니까요.
nl: En dat is prima: het is de taak van het gegevensmodel om de gegevensstroom tussen de gegevensobjecten van de app te coördineren.
no: Og det er helt greit! Datamodellens oppgave er å koordinere dataflyten mellom appens dataobjekter.
pt: Mas tudo bem! O trabalho do modelo de dados é coordenar o fluxo de dados entre os objetos de dados do app.
sv: Det är OK! Datamodellens jobb är att koordinera dataflödet mellan appens dataobjekten.
th: แต่ไม่เป็นไร! หน้าที่ของโมเดลข้อมูลของคุณคือประสานลำดับข้อมูลระหว่างวัตถุข้อมูลในแอป
tr: Sorun değil! Veri modelinin işi, uygulamadaki veri nesneleri arasında veri akışını koordine etmektir.
vi: Và như vậy là ổn rồi! Công việc của mô hình dữ liệu là điều phối luồng dữ liệu giữa các đối tượng dữ liệu của ứng dụng.
zh_cn: 没关系！数据模型的工作就是协调 App 的数据对象之间的数据流。
zh_tw: 這樣很好！資料模型的工作是協調 App 資料物件之間的資料流。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..TaskdelayedShutter..title
source: Add a Delayed Shutter
de: Verzögerten Auslöser hinzufügen
es: Añadir un obturador con retardo
es_419: Agregar un botón de obturador con retraso
fr: Ajouter un obturateur retardé
it: Aggiungi uno scatto con ritardo
ja: 少し遅れて作動するシャッターを追加する
ko: 지연 모드 셔터 추가하기
nl: Een vertraagde sluiter toevoegen
no: Legg til en forsinket utløser
pt: Adicione um Obturador Atrasado
sv: Lägg till en fördröjd slutarknapp
th: เพิ่มชัตเตอร์แบบหน่วงเวลา
tr: Gecikmeli Deklanşör Ekleme
vi: Thêm nút chụp được trì hoãn
zh_cn: 添加有延迟的快门
zh_tw: 加入延遲快門

source: Experiment with your camera by adding a delay to its shutter button.
de: Experimentiere mit der Kamera, indem du eine Taste für einen verzögerten Auslöser hinzufügst.
es: Experimenta con tu cámara añadiendo un retardo al botón del obturador.
es_419: Para experimentar con tu cámara, agrégale un retraso a su botón de obturador.
fr: Fais tes expériences avec l’appareil photo en ajoutant un retard à son bouton d’obturateur.
it: Sperimenta con la tua fotocamera aggiungendo un ritardo al pulsante di scatto.
ja: カメラのシャッターボタンに遅延を追加してみましょう。
ko: 셔터 버튼에 지연 기능을 추가해 카메라를 실험해 보세요.
nl: Experimenteer met je camera door een vertraging aan de sluiterknop toe te voegen.
no: Eksperimenter med kameraet ditt ved å legge til en forsinkelse for utløserknappen.
pt: Faça uma experiência com a sua câmera: adicione um atraso ao botão obturador.
sv: Experimentera med kameran genom att lägga till en fördröjning i dess slutarknapp.
th: ทดลองใช้กล้องของคุณโดยเพิ่มการหน่วงเวลาให้กับปุ่มชัตเตอร์
tr: Deklanşör düğmesine bir gecikme ekleyerek kameranla deneme yap.
vi: Thử nghiệm với camera của bạn bằng cách thêm một khoảng trễ vào nút chụp.
zh_cn: 尝试给相机的快门按钮添加延迟。
zh_tw: 在快門按鈕上加入延遲來試驗你的相機。

source: Imagine setting the camera up somewhere — like on a tripod, tapping or clicking the button, and having enough time to run around and leap into the frame before the photo is taken!
de: Stelle dir vor, die Kamera befände sich beispielsweise auf einem Stativ, du würdest auf die Taste tippen oder klicken und hättest genug Zeit, ins Bild zu rennen, bevor das Foto aufgenommen wird!
es: Imagina que colocas la cámara en algún sitio, como un trípode, tocas o haces clic en el botón y tienes tiempo suficiente para correr y saltar en el encuadre antes de que se haga la foto.
es_419: ¡Imagina que colocas la cámara en un lugar, como un tripié, y luego presionas el botón y tienes tiempo suficiente para correr y meterte en la toma antes de que se capture la foto!
fr: Imagine placer l’appareil photo quelque part, comme sur un trépied, toucher le bouton ou cliquer dessus, et avoir assez de temps pour vite courir te placer dans le cadre avant que la photo ne soit prise !
it: Immagina di posizionare la fotocamera, ad esempio, su un treppiede, di premere il pulsante e di avere tempo a sufficienza per tuffarti nell’inquadratura prima dello scatto.
ja: どこか（三脚など）にカメラを設置して、ボタンをタップまたはクリックし、あわてて走って自分がフレームに収まってから写真が撮影されるという場面を想像してみましょう!
ko: 예를 들어 카메라를 삼각대 위에 놓고 버튼을 탭하거나 클릭한 다음, 사진이 촬영되기 전에 뛰어서 프레임 안으로 들어올 충분한 시간이 있다고 상상해 보세요.
nl: Stel je voor dat je de camera ergens opstelt, bijvoorbeeld op een statief, en dat je voldoende tijd hebt om om de camera heen te lopen nadat je op de knop hebt getikt of geklikt zodat je in beeld bent als de foto wordt genomen!
no: Se for deg at du plasserer kameraet et sted, for eksempel på et stativ, at du trykker eller klikker på knappen, og at du har nok tid til å løpe rundt og hoppe inn i bildet før det tas!
pt: Imagine posicionar a câmera em algum lugar, como em um tripé, tocar ou clicar no botão e ter tempo para correr e aparecer no enquadramento antes da foto ser tirada!
sv: Föreställ dig att du placerar kameran någonstans (som på ett stativ), trycker eller klickar på knappen och har tid att hoppa in i bildramen innan bilden tas!
th: ลองจินตนาการว่าตั้งกล้องไว้ที่ใดที่หนึ่ง เช่น บนขาตั้งกล้อง แล้วแตะหรือคลิกปุ่ม จากนั้นมีเวลามากพอที่จะวิ่งไปรอบๆ แล้วกระโดดเข้าไปในกรอบก่อนที่จะถ่ายรูปดูสิ!
tr: Kamerayı tripod gibi bir yere koyduğunu, düğmeye dokunduğunu veya tıkladığını ve fotoğraf çekilmeden önce koşup kareye girebilecek kadar zamanın olduğunu hayal et!
vi: Hãy tưởng tượng thiết lập camera ở một nơi nào đó — như trên một giá đỡ ba chân, chạm hoặc bấm nút và có đủ thời gian để chạy và tiến vào khung hình trước khi ảnh được chụp!
zh_cn: 想像你将相机架设在某个地方（比如三脚架上），轻点或点按按钮，在照片拍摄之前还有足够的时间跑一圈再跃入画面！
zh_tw: 想像一下把相機放在某個地方，比如放在三腳架上，點按按鈕，在拍照之前有足夠的時間四處跑然後跳進畫面！

source: To do that you’ll need to add a short delay after you tap or click the shutter button before the camera takes the photo.
de: Dafür musst du eine kleine Verzögerung hinzufügen. So nimmt die Kamera das Foto nicht gleich auf, wenn du auf den Auslöser tippst oder klickst.
es: Para ello, tendrás que añadir un breve retardo después de tocar o hacer clic en el botón del obturador, antes de que la cámara haga la foto.
es_419: Para esto, deberás agregar un breve retraso después de tocar o presionar el obturador y antes de que la cámara tome la foto.
fr: Pour ce faire, tu devras ajouter un léger délai après avoir touché ou cliqué sur le bouton d’obturateur, avant que la photo ne soit prise par l’appareil photo.
it: Per farlo, hai bisogno di aggiungere un breve ritardo tra il momento in cui premi il pulsante e quello in cui la fotocamera effettivamente scatta la foto.
ja: そのためには、シャッターボタンをタップまたはクリックしたあと、カメラで写真が撮影されるまでの間に若干の遅延を追加する必要があります。
ko: 이렇게 하려면 셔터 버튼을 탭 또는 클릭한 후 카메라가 사진을 촬영하기 전까지 약간의 지연을 추가해야 합니다.
nl: Om dit te kunnen doen, moet je een korte vertraging toevoegen tussen het moment dat je op de sluiterknop tikt of klikt en het moment dat de camera de foto maakt.
no: For å kunne gjøre det må du legge til en kort forsinkelse før kameraet tar bildet etter at du trykker eller klikker på utløseren.
pt: Para fazer isso, você precisa adicionar um pequeno atraso depois de tocar ou clicar no botão obturador antes da foto ser tirada.
sv: För att kunna göra det måste du lägga till en kort fördröjning efter att du trycker eller klickar på slutarknappen och innan kameran tar bilden.
th: ในการทำเช่นนั้น คุณจะต้องเพิ่มความหน่วงเวลาสั้นๆ หลังจากที่คุณแตะหรือคลิกปุ่มชัตเตอร์ก่อนที่กล้องจะถ่ายรูป
tr: Bunu yapmak için deklanşör düğmesine dokunduktan veya tıkladıktan sonra, kamera fotoğrafı çekmeden önce kısa bir gecikme eklemen gerekecek.
vi: Để thực hiện việc đó, bạn sẽ cần thêm một khoảng trễ ngắn sau khi chạm hoặc bấm nút chụp trước khi camera chụp ảnh.
zh_cn: 若要实现，你需要在轻点或点按快门按钮之后、相机拍摄照片之前添加短暂的延迟。
zh_tw: 為此，你需要在點按快門按鈕後，於相機拍照前加入一個短暫的延遲。

source: Looking at your code for handling the shutter button action, think about how you might implement this.
de: Schau dir den Code zum Verarbeiten der Auslösertastenaktion an und überlege dir, wie du das Ganze implementieren könntest.
es: Mirando el código para gestionar la acción del botón del obturador, piensa en cómo podrías implementar esto.
es_419: Fíjate en el código que administra la acción del botón obturador, ¿qué harías para implementar esto?
fr: Quand tu regardes ton code permettant de gérer l’action du bouton d’obturateur, pense à la façon dont tu peux l’implémenter.
it: Osservando il codice che hai creato per la gestione dell’azione del pulsante di scatto, pensa a come potresti implementare l’operazione.
ja: シャッターボタンのアクションを処理するコードを見て、これをどのように実装するか考えてみましょう。
ko: 셔터 버튼 동작을 처리하기 위한 코드를 살펴보고 이것을 구현하는 방법에 대해 생각해 보세요.
nl: Bekijk de code voor het verwerken van de sluiterknopactie en bedenk hoe je dit kunt implementeren.
no: Se på koden for å håndtere utløserknapphandlingen, og tenk på hvordan du kan implementere dette.
pt: Veja o código para controle da ação do botão obturador e pense em como você poderia implementar isso.
sv: Fundera på hur du kan implementera detta genom att gå igenom koden för hantering av slutarknappsåtgärden.
th: ดูโค้ดของคุณสำหรับการจัดการกับการทำงานของปุ่มชัตเตอร์ แล้วคิดว่าคุณอาจใช้งานโค้ดนี้อย่างไร
tr: Deklanşör düğmesi eylemini işlemeye yönelik koduna bak ve bunu nasıl uygulayabileceğini düşün.
vi: Nhìn vào mã để xử lý tác vụ nút chụp của bạn, hãy nghĩ về cách mà bạn có thể triển khai việc này.
zh_cn: 查看处理快门按钮操作的代码，想想应该如何实施。
zh_tw: 查看用來處理快門按鈕動作的程式碼，想一想如何做到這點。

source: You quickly come up with a plan:
de: So sieht dein Plan ungefähr aus:
es: No tardas en idear un plan:
es_419: Se te ocurre un plan rápidamente:
fr: Tu imagines rapidement un plan :
it: Devi trovare una soluzione rapidamente:
ja: すぐに次のような計画を思いつきますよね:
ko: 구현 방법은 어렵지 않습니다.
nl: Je bedenkt snel een plan:
no: Du kan lage en plan raskt:
pt: Você rapidamente bola um plano:
sv: Du kan snabbt skapa en plan:
th: คุณคิดแผนออกมาได้อย่างรวดเร็ว:
tr: Hızlıca bir plan yapacaksın:
vi: Bạn có một kế hoạch nhanh chóng:
zh_cn: 你很快想出了一个计划：
zh_tw: 你很快想出了一個計畫：

source: Add a [state property](glossary://state%20value) `delayCount` to count down the seconds until you take the photo.
de: Füge die [Statuseigenschaft](glossary://state%20value) `delayCount` (Verzögerungszähler) hinzu, um die Sekunden zu zählen, bis das Foto aufgenommen wird.
es: Añade una [propiedad de estado](glossary://state%20value) `delayCount` para iniciar una cuenta atrás de los segundos que faltan para hacer la foto.
es_419: Agrega una [propiedad de estado](glossary://state%20value) `"delayCount"` para iniciar una cuenta regresiva en segundos antes de que se tome la foto.
fr: Ajoute une [propriété d’état](glossary://state%20value) `delayCount` pour faire le décompte des secondes jusqu’à ce que tu prennes la photo.
it: Aggiungi una [proprietà di stato](glossary://state%20value) `delayCount` per effettuare il conto alla rovescia fino al momento in cui scatterai la foto.
ja: 写真を撮影するまでの秒数をカウントダウンするために、`delayCount`（遅延カウント）という[状態プロパティ](glossary://state%20value)を追加します。
ko: 사진이 촬영될 때까지 초를 카운트다운할 수 있도록 [상태 속성](glossary://state%20value) `delayCount`를 추가합니다.
nl: Voeg de [statuseigenschap](glossary://state%20value) `delayCount` toe om de seconden af te tellen totdat de foto wordt gemaakt.
no: Legg til [statusegenskapen](glossary://state%20value) `delayCount` for å telle ned sekundene til bildet tas.
pt: Adicionar uma [propriedade de estado](glossary://state%20value) `delayCount` para fazer a contagem regressiva até você tirar a foto.
sv: Lägg till [statusegenskapen](glossary://state%20value) `delayCount` för att räkna ned sekunderna tills bilden tas.
th: เพิ่ม[คุณสมบัติสถานะ](glossary://state%20value) `delayCount` เพื่อนับถอยหลังเป็นวินาทีจนกว่าคุณจะถ่ายรูป
tr: Fotoğrafı çekene kadar saniyeleri geri saymak için bir [durum özelliği](glossary://state%20value) (`delayCount`) ekle.
vi: Thêm một [thuộc tính trạng thái](glossary://state%20value) `delayCount` để đếm số giây đến khi bạn chụp ảnh.
zh_cn: 添加[状态属性](glossary://state%20value) `delayCount`（延迟量），来在拍摄照片前倒计时特定秒数。
zh_tw: 加入[狀態屬性](glossary://state%20value) `delayCount` 來倒數讀秒，直到你拍照為止。

source: When you tap or click the shutter button, set `delayCount` to the number of seconds you want the camera to wait before taking the photo.
de: Wenn du auf den Auslöser tippst oder klickst, lege `delayCount` auf die Sekundenzahl fest, die die Kamera abwarten soll, bevor das Foto aufgenommen wird.
es: Al tocar o hacer clic en el botón del obturador, establece `delayCount` en el número de segundos que quieres que la cámara espere antes de hacer la foto.
es_419: Cuando toques o presiones el botón de obturador, establece `delayCount` al número de segundos que quieres que la cámara espere antes de tomar la foto.
fr: Quand tu touches ou cliques sur le bouton d’obturateur, définis `delayCount` sur le nombre de secondes qui vont s’écouler avant que l’appareil photo ne puisse prendre la photo.
it: Quando selezioni il pulsante di scatto, occorre impostare `delayCount` sul numero di secondi di attesa richiesti prima scattare la foto.
ja: シャッターボタンをタップまたはクリックしたときに、`delayCount`（遅延カウント）を、写真を撮影するまでカメラに待機させたい秒数に設定します。
ko: 셔터 버튼을 탭 또는 클릭할 때, 사진 촬영 전 카메라가 대기할 시간을 초 단위로 `delayCount`를 설정합니다.
nl: Stel `delayCount` in op het aantal seconden dat de camera moet wachten voor het maken van een foto nadat je op de sluiterknop hebt getikt of geklikt.
no: Angi `delayCount` til det antall sekunder du vil at kameraet skal vente før det tar bildet etter at du trykker eller klikker på utløserknappen.
pt: Quando você tocar ou clicar no botão obturador, definir `delayCount` com o número de segundos que deseja que a câmera aguarde antes de tirar a foto.
sv: Ställ in `delayCount` som antalet sekunder du vill att kameran ska vänta innan den tar bilden när du har tryckt eller klickat på slutarknappen.
th: เมื่อคุณแตะหรือคลิกปุ่มชัตเตอร์ ให้ตั้งค่า `delayCount` เป็นจำนวนวินาทีที่คุณต้องการให้กล้องรอก่อนที่จะถ่ายรูป
tr: Deklanşör düğmesine dokunduğunda veya tıkladığında, `delayCount`’u kameranın fotoğrafı çekmeden önce beklemesini istediğin saniye sayısına ayarla.
vi: Khi bạn chạm hoặc bấm nút chụp, hãy đặt `delayCount` thành số giây mà bạn muốn camera đợi trước khi chụp ảnh.
zh_cn: 轻点或点按快门按钮时，将 `delayCount` 设为相机拍照前要等待的秒数。
zh_tw: 當你點按快門按鈕時，將 `delayCount` 設定為你要相機在拍照前等待的秒數。

source: Schedule a [Timer](doc://com.apple.documentation/documentation/foundation/timer) to [decrement](glossary://decrement) `delayCount` once per second.
de: Lege einen [Timer](doc://com.apple.documentation/documentation/foundation/timer) fest, um `delayCount` mit jeder Sekunde zu [verringern](glossary://decrement).
es: Programa un [temporizador](doc://com.apple.documentation/documentation/foundation/timer) para que [reduzca el valor](glossary://decrement) de `delayCount` una vez por segundo.
es_419: Configura un temporizador ([Timer](doc://com.apple.documentation/documentation/foundation/timer)) para que [disminuya](glossary://decrement) el valor de `delayCount` un segundo a la vez.
fr: Programme un [minuteur](doc://com.apple.documentation/documentation/foundation/timer) pour [décrémenter](glossary://decrement) `delayCount` une fois par seconde.
it: Imposta un [Timer](doc://com.apple.documentation/documentation/foundation/timer) per [decrementare](glossary://decrement) `delayCount` una volta al secondo.
ja: 1秒につき1回`delayCount`（遅延カウント）を[減らす（デクリメントする）](glossary://decrement)[Timer](doc://com.apple.documentation/documentation/foundation/timer)（タイマー）を設定します。
ko: `delayCount`를 초당 1회 [감소](glossary://decrement)하도록 [Timer](doc://com.apple.documentation/documentation/foundation/timer)를 설정합니다.
nl: Plan een [Timer](doc://com.apple.documentation/documentation/foundation/timer) om `delayCount` eenmaal per seconde te [verlagen](glossary://decrement).
no: Planlegg en [Timer](doc://com.apple.documentation/documentation/foundation/timer) for å [minske](glossary://decrement) `delayCount` én gang per sekund.
pt: Programar um [Timer](doc://com.apple.documentation/documentation/foundation/timer) para [decrementar](glossary://decrement) `delayCount` uma vez por segundo.
sv: Schemalägg en [Timer](doc://com.apple.documentation/documentation/foundation/timer) för att [minska](glossary://decrement) `delayCount` en gång per sekund.
th: กำหนดเวลา[นาฬิกานับถอยหลัง](doc://com.apple.documentation/documentation/foundation/timer)ให้[ลด](glossary://decrement)จำนวนของ `delayCount` ลงครั้งละหนึ่งวินาที
tr: `delayCount`’u saniyede bir kez [azaltmak](glossary://decrement) için bir [Sayaç](doc://com.apple.documentation/documentation/foundation/timer) zamanla.
vi: Đặt lịch trình một [Hẹn giờ](doc://com.apple.documentation/documentation/foundation/timer) thành `delayCount` [giảm dần](glossary://decrement) một đơn vị mỗi giây.
zh_cn: 设定 [Timer](doc://com.apple.documentation/documentation/foundation/timer)（计时器），以每秒钟将 `delayCount` [递减](glossary://decrement)一次。
zh_tw: 將 [Timer](doc://com.apple.documentation/documentation/foundation/timer) 排定為每秒[遞減](glossary://decrement) `delayCount` 一次。

source: When `delayCount` reaches zero, stop the timer, and simultaneously tell the camera to take a photo.
de: Wenn `delayCount` den Wert 0 erreicht, stoppe den Timer und weise gleichzeitig die Kamera an, ein Foto aufzunehmen.
es: Cuando `delayCount` llegue a cero, para el temporizador y dile a la cámara que haga una foto al mismo tiempo.
es_419: Cuando `delayCount` llegue a cero, detén el temporizador e indícale a la vez a la cámara que tome la foto.
fr: Quand `delayCount` atteint zéro, arrête le minuteur et indique simultanément à l’appareil photo de prendre une photo.
it: Quando `delayCount` raggiunge lo zero, occorre interrompere il timer e indicare simultaneamente alla fotocamera di scattare una foto.
ja: `delayCount`（遅延カウント）がゼロになったら、タイマーを停止して、同時に写真を撮影するようにカメラに伝えます。
ko: `delayCount`가 0이 되면 타이머를 멈추고 동시에 사진을 촬영하도록 카메라에 지시합니다.
nl: Wanneer `delayCount` nul bereikt, stop je de timer en geef je tegelijk de camera opdracht om een foto te maken.
no: Når `delayCount` blir null, stopper den nedtellingen, og samtidig gir den kameraet beskjed om å ta et bilde.
pt: Quando `delayCount` chegar a zero, parar o timer e, simultaneamente, instruir a câmera para que tire uma foto.
sv: När `delayCount` når noll stoppar den timern och säger samtidigt åt kameran att ta en bild.
th: เมื่อ `delayCount` ถึงศูนย์ ให้หยุดนาฬิกานับถอยหลังแล้วสั่งให้กล้องถ่ายรูปพร้อมกัน
tr: `delayCount` sıfıra ulaştığında sayacı durdur ve aynı anda kameraya bir fotoğraf çekmesini söyle.
vi: Khi `delayCount` đến 0, dừng hẹn giờ và đồng thời báo cho camera chụp ảnh.
zh_cn: `delayCount` 变为零时，停止计时器，同时让相机拍摄照片。
zh_tw: 當 `delayCount` 到達 0 時，停止計時器，並同時告訴相機拍照。

source: First define the [state property](glossary://state%20value) `delayCount` at the top of `CameraView`, above its `body` property, setting its initial value to zero.
de: Definiere als Erstes die [Statuseigenschaft](glossary://state%20value) `delayCount` ganz oben in `CameraView` über der `body`-Eigenschaft. Dadurch setzt du den Ausgangswert auf null.
es: Primero define la [propiedad de estado](glossary://state%20value) `delayCount` en la parte superior de `CameraView`, encima de la propiedad `body`, estableciendo su valor inicial en cero.
es_419: Primero define la [propiedad de estado](glossary://state%20value) `"delayCount"` en el área superior de `"CameraView"`, arriba de su propiedad `"body"` con un valor inicial de cero.
fr: Commence par définir la [propriété d’état](glossary://state%20value) `delayCount` en haut de `CameraView`, au-dessus de sa propriété `body`, en définissant sa valeur originale sur zéro.
it: Prima definisci la [proprietà di stato](glossary://state%20value) `delayCount` in cima a `CameraView`, sopra la proprietà `body`, e imposta il suo valore iniziale su zero.
ja: まず、[状態プロパティ](glossary://state%20value) `delayCount`（遅延カウント）を`CameraView`（カメラビュー）の一番上（`body`プロパティの上）に定義し、初期値をゼロに設定します。
ko: 먼저 `delayCount` [상태 속성](glossary://state%20value)을 `CameraView`의 상단인 `body` 속성 위에 정의하고, 초기 값을 0으로 설정합니다.
nl: Definieer eerst de [statuseigenschap](glossary://state%20value) `delayCount` aan het begin van `CameraView`, boven de eigenschap `body`, en stel de beginwaarde ervan in op nul.
no: Definer først [statusegenskapen](glossary://state%20value) `delayCount` øverst i `CameraView`, over `body`-egenskapen, og angi den innledende verdien som null.
pt: Primeiro, defina a [propriedade de estado](glossary://state%20value) `delayCount` na parte superior de `CameraView`, acima da sua propriedade `body`, definindo seu valor inicial como zero.
sv: Definiera först [statusegenskapen](glossary://state%20value) `delayCount` överst i `CameraView`, ovanför dess `body`-egenskap, och ställ in det inledande värdet på noll.
th: ก่อนอื่นให้กำหนด[คุณสมบัติสถานะ](glossary://state%20value) `delayCount` ที่ด้านบนสุดของ `CameraView` ซึ่งอยู่ด้านบนคุณสมบัติ `body` โดยตั้งค่าเริ่มต้นเป็นศูนย์
tr: Öncelikle, `body` özelliğinin üstünde, ilk değerini sıfır olarak ayarlayarak `CameraView`’ın üstündeki `delayCount` [durum özelliğini](glossary://state%20value) tanımla.
vi: Trước tiên, định nghĩa [thuộc tính trạng thái](glossary://state%20value) `delayCount` ở trên cùng của `CameraView`, phía trên thuộc tính `body`, đặt giá trị ban đầu thành 0.
zh_cn: 首先在 `CameraView` 顶部、`body`（主体）属性上方定义[状态属性](glossary://state%20value) `delayCount`，并将它的初始值设为零。
zh_tw: 首先在其 `body` 屬性上方的 `CameraView` 頂部定義[狀態屬性](glossary://state%20value) `delayCount`，將其初始值設定為 0。
