Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Apply another operation to the images by adding this code above `.map { $0.image }`:
de: Füge eine weitere Operation zu den Bildern hinzu, indem du diesen Code über `.map { $0.image }` einfügst:
es: Aplica otra operación a las imágenes añadiendo este código encima de `.map { $0.image }`:
es_419: Para aplicar otra operación a las imágenes, agrega el siguiente código arriba de `\".map { $0.image }\"`:
fr: Applique une autre opération aux images en ajoutant ce code au-dessus `.map { $0.image }` :
it: Applica un’altra operazione alle immagini, aggiungendo il codice mostrato di seguito sopra `.map { $0.image }`:
ja: このコードを`.map { $0.image }`の上に追加して、イメージに別の操作を適用します:
ko: `.map { $0.image }` 위에 다음 코드를 추가하여 이미지에 다른 작업을 적용합니다.
nl: Pas een andere bewerking op de afbeeldingen toe door deze code boven `.map { $0.image }` toe te voegen:
no: Bruk en annen handling på bildene ved å legge til denne koden over `.map { $0.image }`:
pt: Para aplicar mais uma operação às imagens, adicione esta linha ao código acima de `.map { $0.image }`:
sv: Använd en annan åtgärd på bilderna genom att lägga till den här koden ovanför `.map { $0.image }`:
th: ปรับใช้การดำเนินการอื่นกับภาพโดยเพิ่มโค้ดนี้เหนือ `.map { $0.image }`:
tr: Bu kodu `.map { $0.image }` öğesinin üstüne ekleyerek görüntülere başka bir işlem uygula:
vi: Áp dụng một thao tác khác cho các hình ảnh bằng cách thêm mã này phía trên `.map { $0.image }`:
zh_cn: 将另一个操作应用到图像，方法是将这些代码添加到 `.map { $0.image }` 上方：
zh_tw: 在 `.map { $0.image }` 上方加入這行程式碼來套用另一個操作到影像上：

source: You’re applying one `map` operation after another to the [stream](glossary://asynchronous%20stream), or [chaining](glossary://chaining) the operations. In fact, you can chain as many operations together as you’d like. For example, the following takes the input from the preview stream, rotates the images, blurs them, and finally converts them to a stream of `Image`.
de: Du wendest eine `map`-Operation nach der anderen auf den [Stream](glossary://asynchronous%20stream) an oder [verkettest](glossary://chaining) die Operationen. Du kannst tatsächlich so viele Operationen miteinander verketten, wie du möchtest. Beispielsweise verwendet Folgendes die Eingabe des Vorschau-Streams, dreht die Bilder, zeichnet sie weich und konvertiert sie zuletzt in einen `Image`-Stream.
es: Estás aplicando una operación `map` después de otra a la [secuencia](glossary://asynchronous%20stream), o [encadenando](glossary://chaining) las operaciones. De hecho, puedes encadenar tantas operaciones como quieras. Por ejemplo, lo siguiente toma la entrada de la secuencia de vista previa, gira las imágenes, las desenfoca y, finalmente, las convierte en una secuencia de `Image`.
es_419: Estás aplicando una operación `map` tras otra al [flujo](glossary://asynchronous%20stream); es decir, [encadenando](glossary://chaining) las operaciones. De hecho, puedes encadenar tantas operaciones como quieras. Por ejemplo, el siguiente código toma la entrada del flujo de vista previa, y luego la gira, difumina y convierte en un flujo de `Image`.
fr: Tu appliques une opération `map` après l’autre au [flux](glossary://asynchronous%20stream). On appelle aussi cela le [chaînage](glossary://chaining) d’opérations. En fait, tu peux enchaîner autant d’opérations que tu veux. Par exemple, l’exemple suivant prend l’entrée du flux d’aperçu, fait pivoter les images, les floute et les convertit finalement en flux d’`Image`.
it: Stai applicando un’operazione `map` dopo l’altra al [flusso](glossary://asynchronous%20stream), ovvero, stai eseguendo un [concatenamento](glossary://chaining) delle operazioni. Puoi concatenare tutte le operazioni che desideri. Per esempio, il codice di seguito prende l’input dal flusso di anteprima, ruota le immagini, le sfoca e infine le converte in un flusso `Image`.
ja: 1つの`map`操作を次々と[ストリーム](glossary://asynchronous%20stream)操作に適用するか、操作を[連鎖](glossary://chaining)させます。実際には、いくつでも好きなだけ操作を連鎖させることができます。例えば、次の例では、プレビューストリームから入力を受け取り、イメージを回転させてぼかし、最後に`Image`（イメージ）のストリームに変換します。
ko: 하나의 `map` 작업을 [스트림](glossary://asynchronous%20stream) 또는 [연결](glossary://chaining) 작업에 차례로 적용하고 있습니다. 즉, 원하는 만큼 작업을 함께 연결할 수 있습니다. 예를 들어, 다음은 미리보기 스트림에서 입력을 가져오고, 이미지를 회전하고 흐리게 처리하며, 마지막으로 해당 이미지를 `Image`의 스트림으로 변환합니다.
nl: Je past de ene na de andere `map`-bewerking op de [stroom](glossary://asynchronous%20stream) toe door de bewerkingen te [koppelen](glossary://chaining). Je kunt zoveel bewerkingen aan elkaar koppelen als je wilt. Zo ontvangt de volgende code de invoer van de voorvertoningsstroom, waarna de afbeeldingen worden geroteerd en vervaagd, en uiteindelijk worden omgezet in een `Image`-stroom.
no: Du bruker en `map`-handling etter en annen i [strømmen](glossary://asynchronous%20stream) eller [lenker](glossary://chaining) handlingene. Du kan lenke sammen så mange handlinger du vil. For eksempel vil følgende ta inndataene fra forhåndsvisningsstrømmen, rotere bildene, gjøre dem uskarpe og til slutt konvertere dem til en `Image`-strøm.
pt: Você está aplicando uma operação `map` após outra nas operações de [fluxo](glossary://asynchronous%20stream) ou [encadeamento](glossary://chaining). Na verdade, você pode encadear quantas operações quiser. O exemplo a seguir recebe a entrada do fluxo de pré‑visualização, gira as imagens, as desfoca e, por fim, as converte para um fluxo de `Image`.
sv: Du använder en `map`-åtgärd efter en annan i [strömmen](glossary://asynchronous%20stream) eller [kopplar](glossary://chaining) åtgärderna. Följande tar exempelvis inmatningen från förhandsvisningsströmmen, roterar bilderna, gör dem oskarpa och konverterar dem slutligen till en `Image`-ström.
th: คุณกำลังปรับใช้การดำเนินการ `map` ทีละรายการกับการดำเนินการ[สตรีม](glossary://asynchronous%20stream)หรือการดำเนินการ[การเชื่อมโยง](glossary://chaining) อันที่จริง คุณสามารถเชื่อมโยงการดำเนินการเข้าด้วยกันได้มากเท่าที่คุณต้องการ ตัวอย่างเช่น การดำเนินการต่อไปนี้จะรับ input จากสตรีมการแสดงตัวอย่าง หมุนภาพ เบลอภาพ และสุดท้ายแปลงภาพเป็นสตรีมของ `Image`
tr: Bir `map` işlemi ardından başka bir tanesini [akışa](glossary://asynchronous%20stream) uyguluyor ya da işlemleri [bağlıyorsun](glossary://chaining). Aslında, istediğin kadar çok işlemi birbirine bağlayabilirsin. Örneğin aşağıdaki kod, bir önceki akıştan girdiyi alır, görüntüleri döndürür, bulanıklaştırır ve son olarak da onları bir `Image` akışına dönüştürür.
vi: Bạn đang áp dụng một thao tác `map` sau một thao tác khác cho [luồng](glossary://asynchronous%20stream) hay [móc nối](glossary://chaining) các thao tác. Trong thực tế, bạn có thể móc nối nhiều thao tác cùng nhau tùy thích. Ví dụ: phần sau đây sử dụng đầu vào từ luồng xem trước, xoay các hình ảnh, làm mờ chúng và cuối cùng là chuyển đổi chúng thành một luồng `Image`.
zh_cn: 你正在将 `map` 操作一个接一个地应用到[流](glossary://asynchronous%20stream)，这个过程也称为[串联](glossary://chaining)操作。事实上，你可以按需串联任意数量的操作。例如，以下操作接收来自预览流的输入、旋转图像、模糊化图像，最后将它们转换为 `Image` 流。
zh_tw: 你正在對[串流](glossary://asynchronous%20stream)或[連接](glossary://chaining)操作一個接一個地套用 `map` 操作。事實上，你可以將任意數量的操作連接在一起。例如，下列程式碼使用來自預覽串流的輸入，旋轉影像並將其模糊，最後將它們轉換成 `Image` 串流。

source: Experiment a little!
de: Experimentiere ein bisschen!
es: ¡Experimenta un poco!
es_419: ¡Experimenta un poco!
fr: Fais tes propres expériences !
it: Prova a sperimentare un po’!
ja: ちょっと試してみましょう!
ko: 실험해 보세요!
nl: Probeer wat te experimenteren!
no: Eksperimenter litt!
pt: Experimente um pouco!
sv: Experimentera lite!
th: ทดลองใช้กันสักหน่อย!
tr: Biraz deneme yap!
vi: Hãy thử nghiệm một chút!
zh_cn: 试验一下吧！
zh_tw: 小實驗！

source: Try different orientation options; for example, what happens when you change the orientation to `.down`?
de: Probiere verschiedene Ausrichtungsoptionen aus. Was z. B. passiert, wenn du die Orientierung in `.down` (runter) änderst?
es: Prueba diferentes opciones de orientación; por ejemplo, ¿qué sucede cuando cambias la orientación a `.down`?
es_419: Intenta con diferentes opciones; por ejemplo, ¿qué ocurre cuando cambias la orientación hacia abajo (`.down`)?
fr: Essaie différentes options d’orientation. Par exemple, que se passe-t-il quand tu changes l’orientation en `.down` ?
it: Prova ad applicare orientamenti diversi, per esempio, cosa succede quando modifichi l’orientamento in `.down`?
ja: 別の向きのオプションを試してみましょう。例えば、`.down`（下向き）に向きを変えると、どうなるでしょうか?
ko: 다양한 방향 옵션을 적용해 보세요. 예를 들어 `.down`으로 방향을 변경하면 어떤 일이 발생할까요?
nl: Probeer verschillende richtingsopties; wat gebeurt er bijvoorbeeld als je de richting instelt op `.down`.
no: Prøv forskjellige valg for retning. Hva skjer hvis du for eksempel endrer retningen til `.down`?
pt: Experimente opções diferentes de orientação; por exemplo, o que acontece quando você muda a orientação para `.down`?
sv: Prova olika riktningsalternativ. Vad händer exempelvis när du ändrar riktningen till `.down`?
th: ลองตัวเลือกแนวอื่นดูสิ เช่น จะเกิดอะไรขึ้นเมื่อคุณเปลี่ยนแนวเป็น `.down`
tr: Farklı yön seçeneklerini dene; örneğin yönü `.down` olarak değiştirdiğinde ne olur?
vi: Thử các tùy chọn hướng khác nhau; ví dụ: điều gì xảy ra khi bạn thay đổi hướng thành `.down`?
zh_cn: 试试不同的方向选项；例如，将方向更改为 `.down`（下）时会发生什么？
zh_tw: 嘗試不同的方向選項，例如，當你將方向更改成 `.down` 時會發生什麼事？

source: Try different blur values.
de: Probiere verschiedene Werte zum Weichzeichnen aus.
es: Prueba diferentes valores de difuminado.
es_419: Prueba con diferentes valores de difuminado.
fr: Teste différentes valeurs de floutage.
it: Prova diversi valori di sfocatura.
ja: 別のぼかし値を試してみましょう。
ko: 다양한 흐림 효과 값을 적용해 보세요.
nl: Probeer verschillende vervagingswaarden.
no: Prøv forskjellige verdier for uskarphet.
pt: Experimente valores diferentes de desfoque.
sv: Prova olika oskärpevärden.
th: ลองค่าการเบลออื่นดูสิ
tr: Farklı bulanıklık değerlerini dene.
vi: Thử các giá trị làm mờ khác nhau.
zh_cn: 试试不同的模糊值。
zh_tw: 嘗試不同的模糊值。

source: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) has lots of useful methods for transforming images.
de: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) hat zahlreiche nützliche Methoden, um Bilder umzuwandeln.
es: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) tiene muchos métodos útiles para transformar imágenes.
es_419: El objeto [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) tiene muchos métodos útiles de transformar imágenes.
fr: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) possède de nombreuses méthodes utiles pour transformer des images.
it: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) ha un sacco di metodi utili per trasformare le immagini.
ja: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)（コアイメージ）には、イメージを変換するための便利なメソッドがたくさんあります。
ko: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage)는 이미지를 변환하기 위해 많은 유용한 메소드를 제공합니다.
nl: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) bevat een groot aantal handige methoden voor het transformeren van afbeeldingen.
no: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) har mange nyttige metoder som kan brukes til å gjøre om på bilder.
pt: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) oferece vários métodos úteis para transformar imagens.
sv: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) har massor av användbara metoder för att omvandla bilder.
th: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) มีวิธีการที่เป็นประโยชน์มากมายสำหรับการแปลงภาพ
tr: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage), görüntüleri dönüştürmeye yönelik pek çok yararlı metot içerir.
vi: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) có nhiều phương thức hữu ích để biến đổi các hình ảnh.
zh_cn: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 包含用于转换图像的许多有用方法。
zh_tw: [CIImage](doc://com.apple.documentation/documentation/coreimage/ciimage) 有很多實用的方法可轉換影像。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..title
source: Capturing and Saving a Photo
de: Foto aufnehmen und sichern
es: Capturar y guardar una foto
es_419: Capturar y guardar una foto
fr: Prendre et enregistrer une photo
it: Acquisire e salvare una foto
ja: 写真を取り込んで保存する
ko: 사진 캡처하기 및 저장하기
nl: Een foto vastleggen en bewaren
no: Ta og arkivere et bilde
pt: Capturando e Salvando uma Foto
sv: Ta och spara en bild
th: การถ่ายรูปและบันทึกรูปภาพ
tr: Fotoğraf Yakalama ve Kaydetme
vi: Ghi lại và lưu một bức ảnh
zh_cn: 捕捉和存储照片
zh_tw: 擷取和儲存照片

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..Paragraph49
source: Smile! Click! A lot happens in quick succession when you take a photo. 📸
de: Bitte lächeln! Klick! Beim Aufnehmen eines Fotos passiert eine Menge direkt hintereinander. 📸
es: ¡Sonríe! ¡Clic! Al hacer una foto, suceden muchas cosas en un abrir y cerrar de ojos. 📸
es_419: ¡Sonríe y… clic! Ocurren muchas cosas en sucesión cuando tomas una foto. 📸
fr: Souris ! Clic ! Des tas de choses se produisent rapidement en chaîne lorsque tu prends une photo. 📸
it: Cheese! Quando scatti una foto avvengono molte cose in rapida successione. 📸
ja: はい笑って! クリック! 写真を撮影すると、そのあとすぐにたくさんのことが起こります。📸
ko: 웃어요! 찰칵! 사진을 찍을 때 많은 일이 연달아 빠르게 일어납니다. 📸
nl: Lach! Klik! Als je een foto maakt, gebeuren er een hoop dingen snel achterelkaar. 📸
no: Smil! Klikk! Mange ting skjer i rask rekkefølge når du tar et bilde. 📸
pt: Sorria! Clique! Muitas coisas acontecem em sucessão rápida quando você tira uma foto. 📸
sv: Le! Klicka! En massa saker händer i snabb följd när du tar en bild. 📸
th: ยิ้ม! คลิก! สิ่งต่างๆ มากมายเกิดขึ้นอย่างรวดเร็วและต่อเนื่องเมื่อคุณถ่ายรูป 📸
tr: Gülümse! Klik! Fotoğraf çekerken art arda pek çok şey olur. 📸
vi: Cười lên! Bấm! Rất nhiều thứ diễn ra trong một trình tự ngắn khi bạn chụp ảnh. 📸
zh_cn: 微笑！咔嚓！拍摄一张照片时，接二连三发生了许多事情。📸
zh_tw: 笑一個！按下快門！當你拍照時，很多事情都會接連地發生。📸

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..Paragraph50
source: Follow the action after you tap or click the shutter button, to investigate what happens from that moment to when the photo shows up in your photo library.
de: Sieh dir die Vorgänge genau an, die gestartet werden, wenn du auf den Auslöser tippst oder klickst, um zu untersuchen, was geschieht, wenn das Foto in deiner Fotomediathek eintrifft.
es: Sigue la acción después de tocar o pulsar el botón del obturador, para investigar lo que ocurre desde ese momento hasta que la foto aparece en tu fototeca.
es_419: Sigue la acción después de tocar o presionar el botón del obturador para investigar lo que ocurre desde ese momento hasta que la foto aparece en la fototeca.
fr: Suis l’action après avoir touché le bouton d’obturateur ou avoir cliqué dessus, pour étudier ce qui se passe à partir de ce moment-là et jusqu’à ce que la photo s’affiche dans ta photothèque.
it: Scopri cosa accade una volta selezionato il pulsante di scatto e fai attenzione a cosa succede da quel momento fino a quando la foto non viene visualizzata nella tua libreria.
ja: シャッターボタンをタップまたはクリックしたあとのアクションを追って、その瞬間から写真がフォトライブラリに表示されるまでに何が起きるかを調べましょう。
ko: 셔터 버튼을 탭 또는 클릭한 순간부터 사진이 사진 보관함에 나타날 때까지 어떤 일이 발생하는지 알아보세요.
nl: Volg de actie nadat je op de sluiterknop tikt of klikt. Onderzoek wat er vanaf dat moment gebeurt totdat de foto in je fotobibliotheek verschijnt.
no: Undersøk hva som skjer etter at du trykker eller klikker på utløseren, slik at du ser hva som skjer frem til bildet vises i bildebiblioteket.
pt: Siga a ação depois de tocar ou clicar no botão obturador para investigar o que acontece desde esse momento até a hora que a foto aparece na fototeca.
sv: Följ åtgärden efter att du har tryckt eller klickat på slutarknappen för att undersöka vad som händer från det ögonblicket tills bilden visas i bildbiblioteket.
th: ติดตามการทำงานหลังจากที่คุณแตะหรือคลิกปุ่มชัตเตอร์เพื่อตรวจสอบสิ่งที่เกิดขึ้นตั้งแต่ช่วงเวลานั้นไปจนถึงเมื่อรูปภาพแสดงขึ้นมาในคลังรูปภาพของคุณ
tr: Deklanşör düğmesine dokunma veya tıklama anından itibaren fotoğrafın fotoğraf arşivinde görünmesine kadar neler olacağını incelemek için eylemi izle.
vi: Theo dõi hành động sau khi bạn chạm hoặc bấm nút chụp, để kiểm tra những gì xảy ra từ thời điểm đó đến khi ảnh xuất hiện trong thư viện ảnh của bạn.
zh_cn: 跟踪轻点或点按快门按钮后执行的操作，探寻从拍摄瞬间到照片在照片图库中显示的过程中发生了什么。
zh_tw: 追蹤點按快門按鈕後的動作，檢查從那一刻到照片出現在你的照片圖庫中時發生了什麼。

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..TaskshutterButton..title
source: Responding to the Shutter Button
de: Auf die Taste für den Auslöser reagieren
es: Responder al botón del obturador
es_419: Responder al botón de obturador
fr: Répondre au bouton d’obturateur
it: Reagire al pulsante di scatto
ja: シャッターボタンに応答する
ko: 셔터 버튼에 응답하기
nl: Reageren op de sluiterknop
no: Svare på utløserknappen
pt: Respondendo ao Botão Obturador
sv: Svara på slutarknappen
th: การตอบสนองต่อปุ่มชัตเตอร์
tr: Deklanşör Düğmesine Yanıt Verme
vi: Phản hồi nút chụp
zh_cn: 响应快门按钮
zh_tw: 回應快門按鈕

source: Learn how to handle the shutter button action, and request the camera to take a photo.
de: Lerne, wie du die Aktion für die Auslösertaste verarbeitest und die Kamera anweist, ein Foto aufzunehmen.
es: Aprende a gestionar la acción del botón del obturador y a solicitar que la cámara haga una foto.
es_419: Descubre cómo administrar la acción del botón de obturador, y solicitar que la cámara tome una foto.
fr: Découvre comment gérer l’action du bouton d’obturateur et demander à l’appareil photo de prendre une photo.
it: Scopri come gestire l’azione del pulsante di scatto e come richiedere alla fotocamera di scattare una foto.
ja: シャッターボタンのアクションを処理する方法、およびカメラに写真を撮影するようリクエストする方法を学びましょう。
ko: 셔터 버튼 동작을 처리하는 방법을 배워보고 카메라가 사진을 찍도록 요청하세요.
nl: Leer hoe je de sluiterknopactie verwerkt en hoe je de camera vraagt om een foto te maken.
no: Lær deg hvordan du håndterer utløserknapphandlingen og ber kameraet om å ta et bilde.
pt: Saiba como controlar a ação do botão obturador e pedir que a câmera tire uma foto.
sv: Lär dig hur du hanterar slutarknappsåtgärden och begär att kameran tar en bild.
th: เรียนรู้วิธีจัดการกับการทำงานของปุ่มชัตเตอร์ และขอให้กล้องถ่ายรูป
tr: Deklanşör düğmesi eylemini nasıl işleyeceğini öğren ve kameradan fotoğraf çekmesini iste.
vi: Tìm hiểu cách xử lý tác vụ nút chụp và yêu cầu camera chụp ảnh.
zh_cn: 了解如何处理快门按钮操作，以及如何请求相机拍摄照片。
zh_tw: 學習如何處理快門按鈕動作，並要求相機拍照。

source: When you tap or click the shutter button in your camera view, things start happening!
de: Wenn du in der Kameraansicht auf die Taste für den Auslöser tippst oder klickst, geht es los!
es: Al tocar o hacer clic en el botón del obturador en la vista de cámara, ¡empieza a pasar de todo!
es_419: Cuando presionas o tocas el botón de obturador en la visualización de la cámara, ¡la magia empieza!
fr: Quand tu touches le bouton d’obturateur ou cliques dessus dans la vue de ton appareil photo, tout se met en route !
it: Quando selezioni il pulsante di scatto nella vista della fotocamera, la magia ha inizio!
ja: カメラビューでシャッターボタンをタップまたはクリックすると、いろいろなことが起き始めますよ!
ko: 카메라 보기에서 셔터 버튼을 탭 또는 클릭하면 여러 가지 일이 벌어집니다!
nl: Wanneer je op de sluiterknop in de cameraweergave tikt of klikt, gebeurt er van alles!
no: Når du trykker eller klikker på utløserknappen i kameravisningen, begynner det å skje ting!
pt: Quando você toca ou clica no botão obturador no visor da câmera, coisas começam a acontecer!
sv: När du trycker eller klickar på slutarknappen i kameravyn börjar saker hända!
th: เมื่อคุณแตะหรือคลิกปุ่มชัตเตอร์ในมุมมองกล้องของคุณ สิ่งต่างๆ ก็เริ่มเกิดขึ้น!
tr: Kamera görüntündeki deklanşör düğmesine dokunduğunda veya tıkladığında bir şeyler olmaya başlar!
vi: Khi bạn chạm hoặc bấm nút chụp trong chế độ xem camera, mọi thứ bắt đầu diễn ra!
zh_cn: 在相机视图中轻点或点按快门按钮时，一切就会开始发生！
zh_tw: 當你在相機顯示區中點按快門按鈕後，事情就開始發生了！

source: The button springs into action, grabs the model’s `camera` object, then calls its `takePhoto()` method.
de: Die Taste legt los, schnappt sich das Kameraobjekt des Modells und ruft dann dessen Methode `takePhoto()` (Foto aufnehmen) auf.
es: El botón entra en acción, coge el objeto `camera` del modelo y luego llama a su método `takePhoto()`.
es_419: El botón desata la acción, toma el objeto `camera` del modelo y llama a su método `takePhoto()`.
fr: Le bouton se met en action, récupère l’objet `camera` du modèle, puis appelle sa méthode `takePhoto()`.
it: Il pulsante entra in azione, prende l’oggetto `camera` del modello di dati, quindi richiama il relativo metodo `takePhoto()`.
ja: ボタンによって、素早くアクションが開始され、モデルの`camera`（カメラ）オブジェクトが取得されてから、`takePhoto()`（写真を撮影）メソッドが呼び出されます。
ko: 버튼이 작동하며 모델의 `camera` 객체를 가져오고, `takePhoto()` 메소드를 호출합니다.
nl: De knop komt in actie, pakt het `camera`-object van het model en roept vervolgens de `takePhoto()`-methode ervan aan.
no: Knappen begynner å arbeide ved å hente modellens `camera`-objekt og deretter kalle `takePhoto()`-metoden.
pt: O botão entra em ação, pega o objeto `camera` do modelo e chama o método `takePhoto()`.
sv: Knappen agerar genom att ta tag i modellens `camera`-objekt och anropar sedan dess `takePhoto()`-metod.
th: ปุ่มจะเริ่มทำงาน แล้วเลือกวัตถุ `camera` ของโมเดล จากนั้นจะเรียกใช้วิธีการ `takePhoto()`
tr: Düğme eyleme geçer, modelin `camera` nesnesini alır, sonra onun `takePhoto()` metodunu çağırır.
vi: Nút này làm xuất hiện một tác vụ, lấy đối tượng `camera` của mô hình, sau đó gọi phương thức `takePhoto()`.
zh_cn: 按钮立即开始行动，抓取模型的 `camera`（相机）对象，然后调用它的 `takePhoto()`（拍照）方法。
zh_tw: 按鈕開始執行動作，抓取模型的 `camera` 物件，然後呼叫它的 `takePhoto()` 方法。

source: Keep going to find out how it takes a photo!
de: Mache weiter so, um herauszufinden, wie ein Foto aufgenommen wird!
es: ¡Sigue adelante para averiguar cómo se hace una foto!
es_419: ¡Continúa para averiguar cómo toma una foto!
fr: Continue pour découvrir comment une photo est prise !
it: Vai avanti per scoprire in che modo scatta una foto!
ja: 引き続き、どのように写真が撮影されるのか解明しましょう!
ko: 사진을 어떻게 찍는지 계속해서 알아보세요!
nl: Blijf doorgaan om erachter te komen hoe er een foto wordt gemaakt!
no: Fortsett for å finne ut hvordan den tar et bilde!
pt: Continue para descobrir como uma foto é tirada!
sv: Fortsätt för att ta reda på hur den tar en bild!
th: ทำต่อไปเพื่อค้นหาวิธีถ่ายรูป!
tr: Nasıl fotoğraf çekildiğini öğrenmek için devam et!
vi: Tiếp tục để tìm hiểu cách chụp ảnh!
zh_cn: 继续探索，发现照片是如何拍出来的！
zh_tw: 繼續執行來看看它如何拍照！

# GuideBook..Guide0..StepCapturing Photos..TaskGroup1..TaskcapturePhoto..title
source: Capturing a Photo
de: Foto aufnehmen
es: Capturar una foto
es_419: Capturar una foto
fr: Prendre une photo
it: Acquisire una foto
ja: 写真を取り込む
ko: 사진 캡처하기
nl: Een foto vastleggen
no: Ta et bilde
pt: Capturando uma Foto
sv: Ta en bild
th: การถ่ายรูป
tr: Fotoğraf Yakalama
vi: Ghi lại một bức ảnh
zh_cn: 捕捉照片
zh_tw: 擷取照片
