Repository: BettaiebMohamed/c21ios
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: You use a lazy vertical grid ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) to display your photos as items in a grid layout. Because the layout uses a vertical grid, you only need to decide how many `columns` you want and the `spacing` between each item. After the grid has the number of columns, it expands vertically to add enough rows for displaying all of your photos.
de: Du verwendest das faule vertikale Raster ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)), um deine Fotos in einem Rasterlayout anzuzeigen. Da das Layout ein vertikales Raster verwendet, musst du nur entscheiden, wie viele Spalten (`columns`) und wie viel Abstand (`spacing`) du zwischen den Objekten haben möchtest. Sobald das Raster die Anzahl der Spalten erreicht, wird es vertikal erweitert und es werden genug Zeilen hinzugefügt, um alle Fotos anzuzeigen.
es: Puedes usar una cuadrícula vertical diferida ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) para mostrar tus fotos como ítems en una disposición de cuadrícula. Dado que la disposición usa una cuadrícula vertical, solo tienes que decidir cuántas columnas (`columns`) quieres y el espaciado (`spacing`) entre cada ítem. Una vez que tenga el número de columnas, se expande verticalmente para añadir suficientes filas para mostrar todas tus fotos.
es_419: Debes usar una cuadrícula vertical perezosa ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) para mostrar tus fotos como elementos en una disposición de cuadrícula. Como la disposición utiliza una cuadrícula vertical, sólo debes decidir cuántas columnas (`columns`) quieres y especificar el espacio (`spacing`) entre cada una. Al tener el número de columnas, la cuadrícula puede expandirse verticalmente para agregar suficientes filas para mostrar todas tus fotos.
fr: Tu utilises une grille verticale économe ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) pour afficher tes photos en tant qu’éléments disposés en grille. Étant donné que ta grille utilise une grille verticale, tu dois juste décider du nombre de `columns` (colonnes) que tu veux et du `spacing` (espacement) entre chaque élément. Une fois que la grille possède le nombre de colonnes, elle s’étend verticalement, afin dʼajouter le nombre de rangs nécessaire pour afficher toutes tes photos.
it: Per mostrare le foto come elementi in un layout a griglia, si utilizza una griglia verticale “pigra” ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)). Visto che il layout utilizza una griglia verticale, devi solo decidere quante `columns` vuoi e specificare il valore di `spacing` tra ciascun elemento. Una volta specificato il numero di colonne, la griglia si espanderà verticalmente, aggiungendo un numero di righe sufficiente per mostrare tutte le foto.
ja: ゆるやかな縦方向のグリッド（[LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)）を使って、写真をグリッドレイアウトの項目として表示しましょう。レイアウトでは縦方向のグリッドが使われるので、決める必要があるのは希望する`columns`（列）の数と、項目と項目の間の`spacing`（間隔）だけです。列の数が決まったら、グリッドが縦方向に広がって、すべての写真を表示できるだけの行が追加されます。
ko: 게으른(lazy) 세로 격자([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid))를 사용하면 사진을 격자 레이아웃의 항목으로 표시할 수 있습니다. 레이아웃에서 세로 격자를 사용하므로 원하는 `columns`의 개수와 각각의 항목 간 `spacing`만 결정하면 됩니다. 격자는 열 개수가 정해진 후 세로로 확장되어 모든 사진을 표시할 수 있는 충분한 행이 추가됩니다.
nl: Je gebruikt een [LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid) om je foto's als onderdelen in een rasterlay-out weer te geven. Aangezien de lay-out een verticaal raster gebruikt, hoef je alleen te bepalen hoeveel `columns` je wilt gebruiken en welke `spacing` er tussen de onderdelen moet worden toegepast. Zodra het raster het aantal kolommen heeft, wordt het in verticale richting uitgebreid zodat er voldoende rijen aan het raster worden toegevoegd voor al je foto's.
no: Du bruker et forsinket vertikalt rutenett ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) til å vise bildene som objekter i en rutenettlayout. Siden layouten bruker et vertikalt rutenett, trenger du bare å bestemme hvor mange `columns` du vil ha, og `spacing` mellom hvert objekt. Når rutenettet har det antallet kolonner, ekspanderes det vertikalt for å legge til mange nok rader til å kunne vise alle bildene dine.
pt: Você usa uma grade vertical preguiçosa ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) para mostrar as fotos como itens em um layout de grade. Como esse layout usa uma grade vertical, você precisa decidir apenas quantas `columns` você quer e o `spacing` entre cada item. Depois que a grade tem o número de colunas, ela se expande verticalmente para adicionar linhas suficientes para mostrar todas as fotos.
sv: Du använder ett slött vertikalt rutnät ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) till att visa bilder som objekt i en rutnätslayout. Eftersom layouten använder ett vertikalt rutnät behöver du bara bestämma hur många `columns` du vill ha och mängden `spacing` mellan varje objekt. När rutnätet har antalet kolumner kan det expandera vertikalt för att lägga till tillräckligt många rader för att visa alla dina bilder.
th: คุณจะใช้ตารางแนวตั้งแบบยืดหยุ่น ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) เพื่อแสดงรูปภาพของคุณเป็นรายการในเค้าโครงตาราง เนื่องจากเค้าโครงใช้ตารางแนวตั้ง คุณเพียงแค่ต้องตัดสินใจเกี่ยวกับจำนวนของ `columns` ที่คุณต้องการและ `spacing` ระหว่างแต่ละรายการ หลังจากที่ตารางมีจำนวนคอลัมน์แล้ว ตารางจะขยายขนาดในแนวตั้งเพื่อเพิ่มจำนวนแถวให้เพียงพอสำหรับการแสดงรูปภาพทั้งหมดของคุณ
tr: Fotoğraflarını ızgara yerleşimindeki öğeler olarak görüntülemek için tembel bir düşey ızgara ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) kullanırsın. Yerleşim düşey bir ızgara kullandığından yalnızca kaç tane `columns` istediğine ve her öğenin arasındaki `spacing`’e karar vermen gerekir. Izgarada bu sayıda sütun olduktan sonra ızgara, fotoğraflarının tamamını görüntülemeye yetecek sayıda satır eklemek için düşey olarak genişler.
vi: Bạn sử dụng một lưới dọc lazy ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) để hiển thị ảnh của mình dưới dạng các mục trong một bố cục lưới. Vì bố cục này sử dụng một lưới dọc nên bạn chỉ cần quyết định số lượng `columns` mong muốn và `spacing` giữa từng mục. Sau khi có số lượng cột, lưới mở rộng theo chiều dọc để thêm đủ số hàng nhằm hiển thị tất cả các ảnh của bạn.
zh_cn: 使用一个惰性垂直网格 ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) 来将照片显示为网格布局中的项目。由于布局使用的是垂直网格，你只需要决定想要的 `columns`（列）数和每个项目之间的 `spacing`（间距）。网格包含列数后会垂直展开，以添加足够的行来显示所有照片。
zh_tw: 你使用一個垂直的惰性網格 ([LazyVGrid](doc://com.apple.documentation/documentation/swiftui/lazyvgrid)) 來以網格的佈局展示你的照片。因為佈局使用垂直的網格，你只要決定需要多少個 `columns` 以及每個項目之間的 `spacing`。當網格包含一定數量的直欄後，它會垂直擴展來加入足夠的橫列，以展示你所有的照片。

source: Why lazy? Well, if the grid is larger than its containing view, the view only displays the items that are currently visible. This “laziness” actually enhances the performance of your app, especially as you scroll through the grid of photos.
de: Warum faul? Nun, wenn das Raster größer ist als die Ansicht, in der es enthalten ist, zeigt die Ansicht nur die Objekte an, die zum aktuellen Zeitpunkt sichtbar sind. Dieses Faulsein verbessert aber tatsächlich die Leistung deiner App, insbesondere, wenn du durch ein Raster aus Fotos scrollst.
es: ¿Por qué diferida? Bueno, si la cuadrícula es más grande que la vista que la contiene, solo muestra los ítems visibles actualmente. Esto en realidad mejora el rendimiento de tu app, especialmente cuando te desplazas por la cuadrícula de fotos.
es_419: ¿Que por qué es “lazy” o perezosa? Bueno, si la cuadrícula es más grande que la visualización que la contiene, la visualización solamente muestra los elementos que son visibles a la vez. Esta “holgazanería” en realidad mejora el rendimiento de tu app, especialmente a medida que te desplazas por la cuadrícula de fotos.
fr: En quoi est-elle économe ? Et bien, si la grille est plus grande que la vue qui la contient, la vue affiche uniquement les éléments qui sont actuellement visibles. Cette « économie » permet en fait d’améliorer les performances de ton app, en particulier quand tu parcours la grille de photos.
it: Perché viene definita “pigra”? Se la griglia è più grande della vista che la contiene, quest’ultima mostra solo gli elementi che sono attualmente visibili. In realtà, questa sua “pigrizia” consente di migliorare le prestazioni dell’app, specialmente quando scorri i contenuti della griglia di foto.
ja: なぜ、ゆるやかなのでしょう? そう、グリッドがそれに含まれているビューよりも大きい場合は、現在表示されている項目だけが表示されます。実はこの“ゆるやかさ”が、特に写真のグリッドをスクロールするときには、Appのパフォーマンスを向上させます。
ko: 왜 게으르다고 할까요? 격자를 포함하는 보기보다 격자가 더 큰 경우, 해당 보기는 현재 보이는 항목만 표시하기 때문입니다. 이러한 ‘게으름’ 덕분에 특히 사진 격자를 스크롤할 때 앱 성능이 실제로 향상됩니다.
nl: Waarom lazy (lui)? Als het raster groter is dan de omvattende weergave, geeft de weergave alleen de onderdelen weer die op dat moment zichtbaar zijn. Deze "luiheid" zorgt er overigens voor dat de prestaties van je app worden verbeterd, met name als je door het raster met foto's scrolt.
no: Hvorfor forsinket? Hvis rutenettet er større enn visningen som inneholder det, viser visningen bare objektene som er synlige. Denne «forsinkelsen» forbedrer appens ytelse, spesielt når du ruller gjennom rutenettet med bilder.
pt: Por que preguiçosa? Bom, se a grade é maior do que a visualização que a contém, a visualização mostra apenas os itens visíveis no momento. Na verdade, essa “preguiça” aprimora o desempenho do app, especialmente conforme você rola pela grade de fotos.
sv: Men varför kallas det slött? Jo, ifall rutnätet är större än vyn som innehåller det kommer vyn endast att visa de objekt som är synliga för tillfället. Den här ”slöheten” förbättrar faktiskt appens prestanda, särskilt när du rullar genom rutnätet med bilder.
th: ทำไมถึงใช้แบบยืดหยุ่น ถ้าตารางใหญ่กว่ามุมมองที่มี มุมมองจะแสดงเฉพาะรายการที่มองเห็นได้ในขณะนั้น อันที่จริง “ความยืดหยุ่น” นี้จะเพิ่มประสิทธิภาพของแอปของคุณ โดยเฉพาะในขณะที่คุณเลื่อนดูตารางรูปภาพ
tr: Neden tembel? Şöyle ki; ızgara, kendisini içeren görüntüden büyükse görüntü yalnızca o anda görünür olan öğeleri gösterir. Bu “tembellik” aslında uygulamanın performansını artırır, özellikle de fotoğraf ızgarası boyunca kaydırırken.
vi: Tại sao là lazy (lười biếng)? Chà, nếu lưới lớn hơn chế độ xem chứa đựng thì chế độ xem chỉ hiển thị các mục hiện nhìn thấy được. Tính chất “lười biếng” này thực sự cải thiện hiệu năng của ứng dụng, đặc biệt là khi bạn cuộn qua lưới ảnh.
zh_cn: 为什么叫做惰性？那是因为，如果网格比它含有的视图更大，视图只会显示当前可见的项目。这种“惰性”实际上增强了 App 的性能，特别是对滚动浏览照片网格时的性能。
zh_tw: 為什麼是惰性？如果網格大於它包含的顯示區，顯示區只會顯示目前可見的項目。這種「懶惰」實際上提高了 App 的效能，尤其是當捲動瀏覽照片網格時。

source: You could use a fixed number of columns in your grid, but a more [responsive](glossary://responsive) approach is to display as many columns as you can, depending on the width of the view. This creates a much better experience as people resize your app.
de: Du hättest in deinem Raster eine feste Spaltenanzahl verwenden können. Du erreichst aber eine bessere [Reaktionsfähigkeit](glossary://responsive), wenn du so viele Spalten wie möglich anzeigst, je nachdem, wie breit die Ansicht ist. So sorgst du für ein besseres Benutzererlebnis, wenn die Größe deiner App geändert wird.
es: Podrías usar un número fijo de columnas en tu cuadrícula, pero un enfoque con más [capacidad de respuesta](glossary://responsive) es mostrar tantas columnas como se puedan, en función de la anchura de la vista. Esto crea una experiencia mucho mejor cuando las personas cambien el tamaño de tu app.
es_419: Podrías usar un número fijo de columnas en tu cuadrícula, pero un enfoque más [receptivo](glossary://responsive) sería mostrar tantas columnas como sea posible según el ancho de la visualización. Esto crea una experiencia mucho mejor cuando las personas redimensionan la app.
fr: Tu pourrais utiliser un nombre de colonnes fixe dans ta grille, mais une approche plus [réactive](glossary://responsive) consisterait à afficher autant de colonnes qu’il est possible de caser, en fonction de la largeur de la vue. Cela crée une bien meilleure expérience lorsque des utilisateurs redimensionnent ton app.
it: Nella tua griglia puoi utilizzare un numero di colonne fisso, ma per adottare un approccio più [reattivo](glossary://responsive), potresti voler visualizzare quante più colonne possibili, in base alla larghezza della vista, offrendo così un’esperienza ottimizzata.
ja: グリッド内の列数を固定してもよいのですが、ビューの幅に応じてできるだけ多くの列を表示する方が、より[レスポンシブ](glossary://responsive)な方法といえます。そうすると、ユーザがAppのサイズを変更できて、操作性が向上します。
ko: 격자에 정해진 개수의 열을 사용할 수 있지만, 더욱 [반응형](glossary://responsive)인 방법은 보기의 너비에 따라 집어넣을 수 있는 최대한의 열을 표시하는 것입니다. 이렇게 하면 다른 사람이 사용자 앱의 크기를 조절할 때 더 나은 사용자 경험을 얻을 수 있습니다.
nl: Je kunt een vast aantal kolommen in je raster gebruiken, maar je kunt in plaats daarvan ook een [responsievere](glossary://responsive) benadering gebruiken waarbij je zoveel mogelijk kolommen inpast in de beschikbare breedte van de weergave. Zo ontstaat een veel betere gebruikerservaring als de grootte van de app wordt aangepast.
no: Du kan bruke et fast antall kolonner i rutenettet, men en mer [responsiv](glossary://responsive) løsning er å vise så mange kolonner som mulig, avhengig av bredden på visningen. Det gir en mye bedre opplevelse når brukerne endrer størrelsen på appen.
pt: Você poderia usar um número fixo de colunas na grade, mas a abordagem mais [responsiva](glossary://responsive) seria mostrar o máximo possível de colunas, dependendo da largura da visualização. Isso cria uma experiência muito melhor quando uma pessoa redimensiona o app.
sv: Du kan använda ett fast antal kolumner i rutnät, men ett mer [reaktivt](glossary://responsive) förhållningssätt är att visa så många kolumner som möjligt beroende på vyns bredd. Det skapar en mycket bättre upplevelse när användare ändrar storlek på appen.
th: คุณสามารถใช้จำนวนคอลัมน์ที่คงที่ในตารางของคุณได้ แต่วิธีการที่[ตอบสนอง](glossary://responsive)มากกว่าคือการแสดงคอลัมน์ให้มากที่สุดเท่าที่คุณสามารถทำได้ โดยจะขึ้นอยู่กับความกว้างของมุมมอง การทำเช่นนี้จะสร้างประสบการณ์ที่ดียิ่งขึ้นเมื่อผู้อื่นปรับขนาดแอปของคุณ
tr: Izgaranda sabit sayıda sütun kullanabilirdin ancak görüntünün genişliğine bağlı olarak görüntüleyebildiğin kadar çok sütun görüntülemek daha [yanıt verici](glossary://responsive) bir yaklaşımdır. Bu, kişiler uygulamanın büyüklüğünü değiştirdikçe daha iyi bir deneyim yaratır.
vi: Bạn có thể sử dụng một số lượng cột cố định trong lưới, nhưng sử dụng một phương pháp có tính [phản hồi](glossary://responsive) cao hơn để hiển thị số lượng cột nhiều nhất có thể, tùy theo chiều rộng của chế độ xem. Việc này tạo ra một trải nghiệm tốt hơn nhiều vì mọi người định cỡ lại ứng dụng của bạn.
zh_cn: 你可以在网格中使用固定列数，但更[快速响应](glossary://responsive)的方法是根据视图的宽度显示尽可能多的列。这种方法可为用户调整 App 大小带来更好的体验。
zh_tw: 你可以在網格中使用固定數量的直欄，但更具[回應性](glossary://responsive)方法是儘可能顯示更多的直欄，這取決於顯示區的寬度。當使用者調整你的 App 大小時，這樣能創造更好的使用體驗。

source: To create a grid that adapts to the width of your view, define an `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) and specify the size and spacing you want it to maintain.
de: Um ein Raster zu erstellen, das sich an die Breite der Ansicht anpasst, definiere ein `adaptive` (anpassungsfähiges) [Rasterobjekt](doc://com.apple.documentation/documentation/swiftui/griditem) und lege die Größe und den Abstand fest, der eingehalten werden soll.
es: Para crear una cuadrícula que se adapte a la anchura de tu vista, define `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) y especifica el tamaño y el espaciado que quieres que mantenga.
es_419: Para crear una cuadrícula que se adapte al ancho de tu visualización, define un elemento de cuadrícula, [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem), adaptativo (`adaptive`) y especifica el tamaño y el espacio que quieres que conserve.
fr: Pour créer une grille qui s’adapte à la largeur de ta vue, définis un [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) `adaptive` et indique la taille et l’espacement que tu veux qu’il conserve.
it: Per creare una griglia che si adatta alla larghezza della vista, definisci un [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) di tipo `adaptive` e specifica le dimensioni e la spaziatura che deve mantenere.
ja: ビューの幅に適応するグリッドを作成するには、`adaptive`（可変）[GridItem](doc://com.apple.documentation/documentation/swiftui/griditem)（グリッド項目）を定義して、維持したいサイズと間隔を指定します。
ko: 보기의 너비에 맞춰 격자를 생성하려면 `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem)을 정의하고 유지하려는 크기와 간격을 지정하십시오.
nl: Om een raster aan te maken dat zich aanpast aan de breedte van de weergave, moet je een `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) definiëren en opgeven welke grootte en spacing je het raster wilt gebruiken.
no: Du oppretter et rutenett som tilpasser seg etter bredden på visningen, ved å definere en `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) og angi størrelsen og mellomrommet som skal brukes.
pt: Para criar uma grade que se adapte à largura da visualização, defina um [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) `adaptive` e especifique o tamanho e o espaçamento que você quer que ele mantenha.
sv: Du skapar ett rutnät som anpassas efter vyns bredd genom att definiera `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) och ange storlek och mellanrum som ska bevaras.
th: ในการสร้างตารางที่ปรับให้เข้ากับความกว้างของมุมมองของคุณ ให้กำหนด [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) `adaptive` และระบุขนาดและระยะห่างที่คุณต้องการที่จะคงไว้
tr: Görüntünün genişliğine uyan bir ızgara yaratmak için bir `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) tanımla ve korunmasını istediğin büyüklüğü ve boşluğu belirt.
vi: Để tạo ra một lưới điều chỉnh theo chiều rộng của chế độ xem, hãy định nghĩa một [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) `adaptive` và chỉ định kích cỡ cũng như khoảng cách mà bạn muốn lưới duy trì.
zh_cn: 若要创建适应视图宽度的网格，可定义一个 `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem)（网格项），并指定大小和要保持的间距。
zh_tw: 若要製作能適應顯示區寬度的網格，請定義一個 `adaptive` [GridItem](doc://com.apple.documentation/documentation/swiftui/griditem) 並指定你想要保持的大小和間距。

source: Imagine having hundreds — or thousands — of photos. Even with adaptive layout, your grid can get very tall — way taller than the space you have to display it!
de: Stell dir vor, du hättest Hunderte oder Tausende Fotos. Selbst mit einem adaptiven Layout kann dein Raster sehr lang werden und den für die Anzeige verfügbaren Platz übersteigen!
es: Imagina que tienes cientos (o miles) de fotos. Incluso con una disposición adaptativa, tu cuadrícula puede ser muy alta, ¡mucho más que el espacio que tienes para mostrarla!
es_419: Imagina que tienes cientos, o incluso miles, de fotos. Aun con un diseño adaptativo, tu cuadrícula podría ser muy larga, ¡mucho más que el espacio que tienes para mostrarla!
fr: Imagine que tu as des centaines ou même des milliers de photos. Même avec une disposition adaptative, ta grille peut vraiment prendre une hauteur immense et dépasser largement l’espace dont tu disposes pour l’afficher !
it: Immagina di avere centinaia o persino migliaia di foto. Anche con un layout adattivo, la griglia può diventare molto lunga, molto più estesa dello spazio che hai a disposizione per visualizzarla.
ja: 何百枚、何千枚という写真がある場合を想像してみましょう。可変レイアウトを使用しても、グリッドの高さが非常に大きくなり、表示する必要がある領域を超えてしまう可能性がありますね!
ko: 수백 장 혹은 수천 장의 사진이 있다고 생각해 보세요. 레이아웃이 유연해도 격자가 매우 커질 수 있습니다. 즉, 격자를 표시해야 하는 공간보다 격자가 훨씬 더 커질 수 있다는 것입니다!
nl: Stel je voor dat je honderden of duizenden foto's hebt. Zelfs met een adaptieve lay-out kan je raster hierdoor erg groot worden. Veel groter dan de ruimte die je hebt om het raster weer te geven!
no: Se for deg at du har hundrevis – eller tusenvis – av bilder. Selv med en tilpasningsdyktig layout kan rutenettet bli veldig langt – mye lengre enn plassen som er tilgjengelig for å vise det!
pt: Imagine ter centenas (ou milhares) de fotos. Mesmo com um layout adaptável, a grade pode ficar alta demais, muito mais alta do que o espaço que você tem para mostrá-la!
sv: Föreställ dig att du har hundratals eller till och med tusentals bilder. Även om du har en adaptiv layout kan rutnätet bli väldigt långt – mycket längre än det utrymme du har att visa det!
th: ลองจินตนาการถึงรูปภาพจำนวนหลายร้อยหรือหลายพันรูป แม้จะมีเค้าโครงที่ปรับเปลี่ยนได้ แต่ตารางของคุณก็อาจสูงมากๆ ได้ ซึ่งสูงกว่าพื้นที่ที่คุณมีไว้แสดงตารางเสียอีก!
tr: Yüzlerce veya binlerce fotoğrafın olduğunu hayal et. Uyarlanabilir yerleşimle bile ızgaran çok uzun, hatta görüntülemek için kullanabileceğin alandan çok daha uzun hâle gelebilir!
vi: Hãy tưởng tượng bạn có hàng trăm — hoặc hàng nghìn — bức ảnh. Ngay cả với bố cục thích ứng thì lưới của bạn vẫn có thể trở nên rất cao — cao hơn rất nhiều so với không gian mà bạn có để hiển thị lưới!
zh_cn: 想像你有成百上千张照片。即使使用自适应布局，网格也可能变得非常高，可能比你用来显示它的空间要高得多！
zh_tw: 想像一下擁有數百甚至數千張照片。即使是使用適應性佈局，你的網格會變得非常的長，比你需要用來顯示它的空間還長得多！
